{"class_name": "Model", "keras_version": "1.1.1", "config": {"input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "SI_input", "config": {"batch_input_shape": [null, 50, 1], "input_dtype": "float32", "sparse": false, "name": "SI_input"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "SQ_input", "config": {"batch_input_shape": [null, 50, 1], "input_dtype": "float32", "sparse": false, "name": "SQ_input"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "SU_input", "config": {"batch_input_shape": [null, 50, 1], "input_dtype": "float32", "sparse": false, "name": "SU_input"}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "SV_input", "config": {"batch_input_shape": [null, 50, 1], "input_dtype": "float32", "sparse": false, "name": "SV_input"}}, {"class_name": "Convolution1D", "inbound_nodes": [[["SI_input", 0, 0]]], "name": "convI_1", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convI_1", "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["SQ_input", 0, 0]]], "name": "convQ_1", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convQ_1", "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["SU_input", 0, 0]]], "name": "convU_1", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convU_1", "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["SV_input", 0, 0]]], "name": "convV_1", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convV_1", "border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["convI_1", 0, 0]]], "name": "convI_2", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convI_2", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["convQ_1", 0, 0]]], "name": "convQ_2", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convQ_2", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["convU_1", 0, 0]]], "name": "convU_2", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convU_2", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["convV_1", 0, 0]]], "name": "convV_2", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convV_2", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_2", 0, 0]]], "name": "poolI_1", "config": {"stride": 2, "name": "poolI_1", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_2", 0, 0]]], "name": "poolQ_1", "config": {"stride": 2, "name": "poolQ_1", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_2", 0, 0]]], "name": "poolU_1", "config": {"stride": 2, "name": "poolU_1", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_2", 0, 0]]], "name": "poolV_1", "config": {"stride": 2, "name": "poolV_1", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_1", 0, 0]]], "name": "convI_3", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convI_3", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_1", 0, 0]]], "name": "convQ_3", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convQ_3", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_1", 0, 0]]], "name": "convU_3", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convU_3", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_1", 0, 0]]], "name": "convV_3", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convV_3", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_3", 0, 0]]], "name": "poolI_2", "config": {"stride": 2, "name": "poolI_2", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_3", 0, 0]]], "name": "poolQ_2", "config": {"stride": 2, "name": "poolQ_2", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_3", 0, 0]]], "name": "poolU_2", "config": {"stride": 2, "name": "poolU_2", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_3", 0, 0]]], "name": "poolV_2", "config": {"stride": 2, "name": "poolV_2", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_2", 0, 0]]], "name": "convI_4", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convI_4", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_2", 0, 0]]], "name": "convQ_4", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convQ_4", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_2", 0, 0]]], "name": "convU_4", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convU_4", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_2", 0, 0]]], "name": "convV_4", "config": {"nb_filter": 100, "b_regularizer": null, "input_length": null, "trainable": true, "init": "he_normal", "b_constraint": null, "input_dim": null, "name": "convV_4", "border_mode": "same", "W_regularizer": null, "activity_regularizer": null, "filter_length": 3, "bias": true, "activation": "relu", "W_constraint": null, "subsample_length": 1}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_4", 0, 0]]], "name": "poolI_3", "config": {"stride": 2, "name": "poolI_3", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_4", 0, 0]]], "name": "poolQ_3", "config": {"stride": 2, "name": "poolQ_3", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_4", 0, 0]]], "name": "poolU_3", "config": {"stride": 2, "name": "poolU_3", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_4", 0, 0]]], "name": "poolV_3", "config": {"stride": 2, "name": "poolV_3", "trainable": true, "pool_length": 2, "border_mode": "valid"}}, {"class_name": "Flatten", "inbound_nodes": [[["poolI_3", 0, 0]]], "name": "flatI", "config": {"trainable": true, "name": "flatI"}}, {"class_name": "Flatten", "inbound_nodes": [[["poolQ_3", 0, 0]]], "name": "flatQ", "config": {"trainable": true, "name": "flatQ"}}, {"class_name": "Flatten", "inbound_nodes": [[["poolU_3", 0, 0]]], "name": "flatU", "config": {"trainable": true, "name": "flatU"}}, {"class_name": "Flatten", "inbound_nodes": [[["poolV_3", 0, 0]]], "name": "flatV", "config": {"trainable": true, "name": "flatV"}}, {"class_name": "Merge", "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "name": "FC", "config": {"dot_axes": -1, "output_shape_type": "raw", "concat_axis": -1, "mode": "concat", "output_shape": null, "name": "FC", "mode_type": "raw"}}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "name": "FC2", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "FC2", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "relu", "output_dim": 200}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_BField", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_BField", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 50}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_theta", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_theta", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 50}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_chi", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_chi", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 50}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_vmac", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_vmac", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 30}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_a", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_a", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 15}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_B0", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_B0", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 20}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_B1", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_B1", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 20}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_doppler", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_doppler", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 20}}, {"class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "name": "out_kl", "config": {"input_dim": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "name": "out_kl", "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "activation": "softmax", "output_dim": 20}}]}}