{"class_name": "Model", "keras_version": "1.1.1", "config": {"name": "model_1", "layers": [{"name": "SI_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "SI_input", "batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32"}}, {"name": "SQ_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "SQ_input", "batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32"}}, {"name": "SU_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "SU_input", "batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32"}}, {"name": "SV_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "SV_input", "batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32"}}, {"name": "convI_1", "class_name": "Convolution1D", "inbound_nodes": [[["SI_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convI_1", "input_length": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convQ_1", "class_name": "Convolution1D", "inbound_nodes": [[["SQ_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convQ_1", "input_length": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convU_1", "class_name": "Convolution1D", "inbound_nodes": [[["SU_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convU_1", "input_length": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convV_1", "class_name": "Convolution1D", "inbound_nodes": [[["SV_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convV_1", "input_length": null, "border_mode": "valid", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convI_2", "class_name": "Convolution1D", "inbound_nodes": [[["convI_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convI_2", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convQ_2", "class_name": "Convolution1D", "inbound_nodes": [[["convQ_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convQ_2", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convU_2", "class_name": "Convolution1D", "inbound_nodes": [[["convU_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convU_2", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convV_2", "class_name": "Convolution1D", "inbound_nodes": [[["convV_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convV_2", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "poolI_1", "class_name": "MaxPooling1D", "inbound_nodes": [[["convI_2", 0, 0]]], "config": {"name": "poolI_1", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolQ_1", "class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_2", 0, 0]]], "config": {"name": "poolQ_1", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolU_1", "class_name": "MaxPooling1D", "inbound_nodes": [[["convU_2", 0, 0]]], "config": {"name": "poolU_1", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolV_1", "class_name": "MaxPooling1D", "inbound_nodes": [[["convV_2", 0, 0]]], "config": {"name": "poolV_1", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "convI_3", "class_name": "Convolution1D", "inbound_nodes": [[["poolI_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convI_3", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convQ_3", "class_name": "Convolution1D", "inbound_nodes": [[["poolQ_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convQ_3", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convU_3", "class_name": "Convolution1D", "inbound_nodes": [[["poolU_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convU_3", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convV_3", "class_name": "Convolution1D", "inbound_nodes": [[["poolV_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convV_3", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "poolI_2", "class_name": "MaxPooling1D", "inbound_nodes": [[["convI_3", 0, 0]]], "config": {"name": "poolI_2", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolQ_2", "class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_3", 0, 0]]], "config": {"name": "poolQ_2", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolU_2", "class_name": "MaxPooling1D", "inbound_nodes": [[["convU_3", 0, 0]]], "config": {"name": "poolU_2", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolV_2", "class_name": "MaxPooling1D", "inbound_nodes": [[["convV_3", 0, 0]]], "config": {"name": "poolV_2", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "convI_4", "class_name": "Convolution1D", "inbound_nodes": [[["poolI_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convI_4", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convQ_4", "class_name": "Convolution1D", "inbound_nodes": [[["poolQ_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convQ_4", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convU_4", "class_name": "Convolution1D", "inbound_nodes": [[["poolU_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convU_4", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convV_4", "class_name": "Convolution1D", "inbound_nodes": [[["poolV_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convV_4", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "poolI_3", "class_name": "MaxPooling1D", "inbound_nodes": [[["convI_4", 0, 0]]], "config": {"name": "poolI_3", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolQ_3", "class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_4", 0, 0]]], "config": {"name": "poolQ_3", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolU_3", "class_name": "MaxPooling1D", "inbound_nodes": [[["convU_4", 0, 0]]], "config": {"name": "poolU_3", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolV_3", "class_name": "MaxPooling1D", "inbound_nodes": [[["convV_4", 0, 0]]], "config": {"name": "poolV_3", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "convI_5", "class_name": "Convolution1D", "inbound_nodes": [[["poolI_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convI_5", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convQ_5", "class_name": "Convolution1D", "inbound_nodes": [[["poolQ_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convQ_5", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convU_5", "class_name": "Convolution1D", "inbound_nodes": [[["poolU_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convU_5", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "convV_5", "class_name": "Convolution1D", "inbound_nodes": [[["poolV_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "b_constraint": null, "filter_length": 3, "init": "he_normal", "name": "convV_5", "input_length": null, "border_mode": "same", "b_regularizer": null, "nb_filter": 100, "input_dim": null, "W_constraint": null, "activation": "relu", "bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "poolI_4", "class_name": "MaxPooling1D", "inbound_nodes": [[["convI_5", 0, 0]]], "config": {"name": "poolI_4", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolQ_4", "class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_5", 0, 0]]], "config": {"name": "poolQ_4", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolU_4", "class_name": "MaxPooling1D", "inbound_nodes": [[["convU_5", 0, 0]]], "config": {"name": "poolU_4", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "poolV_4", "class_name": "MaxPooling1D", "inbound_nodes": [[["convV_5", 0, 0]]], "config": {"name": "poolV_4", "trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid"}}, {"name": "flatI", "class_name": "Flatten", "inbound_nodes": [[["poolI_4", 0, 0]]], "config": {"name": "flatI", "trainable": true}}, {"name": "flatQ", "class_name": "Flatten", "inbound_nodes": [[["poolQ_4", 0, 0]]], "config": {"name": "flatQ", "trainable": true}}, {"name": "flatU", "class_name": "Flatten", "inbound_nodes": [[["poolU_4", 0, 0]]], "config": {"name": "flatU", "trainable": true}}, {"name": "flatV", "class_name": "Flatten", "inbound_nodes": [[["poolV_4", 0, 0]]], "config": {"name": "flatV", "trainable": true}}, {"name": "FC", "class_name": "Merge", "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "config": {"mode_type": "raw", "dot_axes": -1, "output_shape": null, "name": "FC", "concat_axis": -1, "mode": "concat", "output_shape_type": "raw"}}, {"name": "FC2", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 400, "init": "glorot_uniform", "name": "FC2", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "relu", "activity_regularizer": null}}, {"name": "out_BField", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "name": "out_BField", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_theta", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "name": "out_theta", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_chi", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "name": "out_chi", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_vmac", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform", "name": "out_vmac", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_a", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 10, "init": "glorot_uniform", "name": "out_a", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_B0", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 20, "init": "glorot_uniform", "name": "out_B0", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_B1", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 20, "init": "glorot_uniform", "name": "out_B1", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_doppler", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 20, "init": "glorot_uniform", "name": "out_doppler", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}, {"name": "out_kl", "class_name": "Dense", "inbound_nodes": [[["FC2", 0, 0]]], "config": {"b_regularizer": null, "b_constraint": null, "output_dim": 20, "init": "glorot_uniform", "name": "out_kl", "input_dim": null, "trainable": true, "W_regularizer": null, "bias": true, "W_constraint": null, "activation": "softmax", "activity_regularizer": null}}], "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]]}}