{"keras_version": "1.1.1", "config": {"output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]], "name": "model_1", "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "layers": [{"inbound_nodes": [], "name": "SI_input", "config": {"input_dtype": "float32", "sparse": false, "name": "SI_input", "batch_input_shape": [null, 50, 1]}, "class_name": "InputLayer"}, {"inbound_nodes": [], "name": "SQ_input", "config": {"input_dtype": "float32", "sparse": false, "name": "SQ_input", "batch_input_shape": [null, 50, 1]}, "class_name": "InputLayer"}, {"inbound_nodes": [], "name": "SU_input", "config": {"input_dtype": "float32", "sparse": false, "name": "SU_input", "batch_input_shape": [null, 50, 1]}, "class_name": "InputLayer"}, {"inbound_nodes": [], "name": "SV_input", "config": {"input_dtype": "float32", "sparse": false, "name": "SV_input", "batch_input_shape": [null, 50, 1]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["SI_input", 0, 0]]], "name": "convI_1", "config": {"name": "convI_1", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["SQ_input", 0, 0]]], "name": "convQ_1", "config": {"name": "convQ_1", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["SU_input", 0, 0]]], "name": "convU_1", "config": {"name": "convU_1", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["SV_input", 0, 0]]], "name": "convV_1", "config": {"name": "convV_1", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "valid", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convI_1", 0, 0]]], "name": "convI_2", "config": {"name": "convI_2", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convQ_1", 0, 0]]], "name": "convQ_2", "config": {"name": "convQ_2", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convU_1", 0, 0]]], "name": "convU_2", "config": {"name": "convU_2", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convV_1", 0, 0]]], "name": "convV_2", "config": {"name": "convV_2", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convI_2", 0, 0]]], "name": "poolI_1", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolI_1"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convQ_2", 0, 0]]], "name": "poolQ_1", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolQ_1"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convU_2", 0, 0]]], "name": "poolU_1", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolU_1"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convV_2", 0, 0]]], "name": "poolV_1", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolV_1"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["poolI_1", 0, 0]]], "name": "convI_3", "config": {"name": "convI_3", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolQ_1", 0, 0]]], "name": "convQ_3", "config": {"name": "convQ_3", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolU_1", 0, 0]]], "name": "convU_3", "config": {"name": "convU_3", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolV_1", 0, 0]]], "name": "convV_3", "config": {"name": "convV_3", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convI_3", 0, 0]]], "name": "poolI_2", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolI_2"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convQ_3", 0, 0]]], "name": "poolQ_2", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolQ_2"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convU_3", 0, 0]]], "name": "poolU_2", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolU_2"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convV_3", 0, 0]]], "name": "poolV_2", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolV_2"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["poolI_2", 0, 0]]], "name": "convI_4", "config": {"name": "convI_4", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolQ_2", 0, 0]]], "name": "convQ_4", "config": {"name": "convQ_4", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolU_2", 0, 0]]], "name": "convU_4", "config": {"name": "convU_4", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolV_2", 0, 0]]], "name": "convV_4", "config": {"name": "convV_4", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convI_4", 0, 0]]], "name": "poolI_3", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolI_3"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convQ_4", 0, 0]]], "name": "poolQ_3", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolQ_3"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convU_4", 0, 0]]], "name": "poolU_3", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolU_3"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convV_4", 0, 0]]], "name": "poolV_3", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolV_3"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["poolI_3", 0, 0]]], "name": "convI_5", "config": {"name": "convI_5", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolQ_3", 0, 0]]], "name": "convQ_5", "config": {"name": "convQ_5", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolU_3", 0, 0]]], "name": "convU_5", "config": {"name": "convU_5", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["poolV_3", 0, 0]]], "name": "convV_5", "config": {"name": "convV_5", "nb_filter": 100, "filter_length": 3, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "border_mode": "same", "trainable": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "subsample_length": 1, "activation": "relu", "init": "he_normal", "input_length": null}, "class_name": "Convolution1D"}, {"inbound_nodes": [[["convI_5", 0, 0]]], "name": "poolI_4", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolI_4"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convQ_5", 0, 0]]], "name": "poolQ_4", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolQ_4"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convU_5", 0, 0]]], "name": "poolU_4", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolU_4"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["convV_5", 0, 0]]], "name": "poolV_4", "config": {"trainable": true, "pool_length": 2, "stride": 2, "border_mode": "valid", "name": "poolV_4"}, "class_name": "MaxPooling1D"}, {"inbound_nodes": [[["poolI_4", 0, 0]]], "name": "flatI", "config": {"trainable": true, "name": "flatI"}, "class_name": "Flatten"}, {"inbound_nodes": [[["poolQ_4", 0, 0]]], "name": "flatQ", "config": {"trainable": true, "name": "flatQ"}, "class_name": "Flatten"}, {"inbound_nodes": [[["poolU_4", 0, 0]]], "name": "flatU", "config": {"trainable": true, "name": "flatU"}, "class_name": "Flatten"}, {"inbound_nodes": [[["poolV_4", 0, 0]]], "name": "flatV", "config": {"trainable": true, "name": "flatV"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "name": "FC", "config": {"mode_type": "raw", "mode": "concat", "dot_axes": -1, "output_shape": null, "concat_axis": -1, "name": "FC", "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["FC", 0, 0]]], "name": "FC2", "config": {"name": "FC2", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 400, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "relu", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_BField", "config": {"name": "out_BField", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 50, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_theta", "config": {"name": "out_theta", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 50, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_chi", "config": {"name": "out_chi", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 50, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_vmac", "config": {"name": "out_vmac", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 50, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_a", "config": {"name": "out_a", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 10, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_B0", "config": {"name": "out_B0", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 20, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_B1", "config": {"name": "out_B1", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 20, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_doppler", "config": {"name": "out_doppler", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 20, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_kl", "config": {"name": "out_kl", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "output_dim": 20, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "activation": "softmax", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}]}, "class_name": "Model"}