{"class_name": "Model", "keras_version": "1.1.1", "config": {"input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "SI_input", "config": {"batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32", "name": "SI_input"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "SQ_input", "config": {"batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32", "name": "SQ_input"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "SU_input", "config": {"batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32", "name": "SU_input"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "SV_input", "config": {"batch_input_shape": [null, 50, 1], "sparse": false, "input_dtype": "float32", "name": "SV_input"}, "inbound_nodes": []}, {"class_name": "Convolution1D", "name": "convI_1", "config": {"W_constraint": null, "border_mode": "valid", "input_length": null, "nb_filter": 50, "name": "convI_1", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["SI_input", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convQ_1", "config": {"W_constraint": null, "border_mode": "valid", "input_length": null, "nb_filter": 50, "name": "convQ_1", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["SQ_input", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convU_1", "config": {"W_constraint": null, "border_mode": "valid", "input_length": null, "nb_filter": 50, "name": "convU_1", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["SU_input", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convV_1", "config": {"W_constraint": null, "border_mode": "valid", "input_length": null, "nb_filter": 50, "name": "convV_1", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["SV_input", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convI_2", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convI_2", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["convI_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convQ_2", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convQ_2", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["convQ_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convU_2", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convU_2", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["convU_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convV_2", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convV_2", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["convV_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolI_1", "config": {"name": "poolI_1", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convI_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolQ_1", "config": {"name": "poolQ_1", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convQ_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolU_1", "config": {"name": "poolU_1", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convU_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolV_1", "config": {"name": "poolV_1", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convV_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convI_3", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convI_3", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolI_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convQ_3", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convQ_3", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolQ_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convU_3", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convU_3", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolU_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convV_3", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convV_3", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolV_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolI_2", "config": {"name": "poolI_2", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convI_3", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolQ_2", "config": {"name": "poolQ_2", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convQ_3", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolU_2", "config": {"name": "poolU_2", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convU_3", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolV_2", "config": {"name": "poolV_2", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convV_3", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convI_4", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convI_4", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolI_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convQ_4", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convQ_4", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolQ_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convU_4", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convU_4", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolU_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convV_4", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convV_4", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolV_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolI_3", "config": {"name": "poolI_3", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convI_4", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolQ_3", "config": {"name": "poolQ_3", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convQ_4", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolU_3", "config": {"name": "poolU_3", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convU_4", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolV_3", "config": {"name": "poolV_3", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convV_4", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convI_5", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convI_5", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolI_3", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convQ_5", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convQ_5", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolQ_3", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convU_5", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convU_5", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolU_3", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convV_5", "config": {"W_constraint": null, "border_mode": "same", "input_length": null, "nb_filter": 50, "name": "convV_5", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "filter_length": 3, "trainable": true, "init": "he_normal", "activation": "relu", "subsample_length": 1, "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["poolV_3", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolI_4", "config": {"name": "poolI_4", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convI_5", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolQ_4", "config": {"name": "poolQ_4", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convQ_5", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolU_4", "config": {"name": "poolU_4", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convU_5", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "poolV_4", "config": {"name": "poolV_4", "trainable": true, "border_mode": "valid", "pool_length": 2, "stride": 2}, "inbound_nodes": [[["convV_5", 0, 0]]]}, {"class_name": "Flatten", "name": "flatI", "config": {"trainable": true, "name": "flatI"}, "inbound_nodes": [[["poolI_4", 0, 0]]]}, {"class_name": "Flatten", "name": "flatQ", "config": {"trainable": true, "name": "flatQ"}, "inbound_nodes": [[["poolQ_4", 0, 0]]]}, {"class_name": "Flatten", "name": "flatU", "config": {"trainable": true, "name": "flatU"}, "inbound_nodes": [[["poolU_4", 0, 0]]]}, {"class_name": "Flatten", "name": "flatV", "config": {"trainable": true, "name": "flatV"}, "inbound_nodes": [[["poolV_4", 0, 0]]]}, {"class_name": "Merge", "name": "FC", "config": {"concat_axis": -1, "output_shape_type": "raw", "name": "FC", "output_shape": null, "mode_type": "raw", "dot_axes": -1, "mode": "concat"}, "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]]}, {"class_name": "Dense", "name": "FC2", "config": {"W_constraint": null, "name": "FC2", "output_dim": 200, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "relu", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC", 0, 0]]]}, {"class_name": "Dense", "name": "out_BField", "config": {"W_constraint": null, "name": "out_BField", "output_dim": 50, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_theta", "config": {"W_constraint": null, "name": "out_theta", "output_dim": 50, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_chi", "config": {"W_constraint": null, "name": "out_chi", "output_dim": 50, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_vmac", "config": {"W_constraint": null, "name": "out_vmac", "output_dim": 50, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_a", "config": {"W_constraint": null, "name": "out_a", "output_dim": 10, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_B0", "config": {"W_constraint": null, "name": "out_B0", "output_dim": 20, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_B1", "config": {"W_constraint": null, "name": "out_B1", "output_dim": 20, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_doppler", "config": {"W_constraint": null, "name": "out_doppler", "output_dim": 20, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "name": "out_kl", "config": {"W_constraint": null, "name": "out_kl", "output_dim": 20, "bias": true, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "activation": "softmax", "input_dim": null, "W_regularizer": null}, "inbound_nodes": [[["FC2", 0, 0]]]}], "output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]], "name": "model_1"}}