____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
SI_input (InputLayer)            (None, 50, 1)         0                                            
____________________________________________________________________________________________________
SQ_input (InputLayer)            (None, 50, 1)         0                                            
____________________________________________________________________________________________________
SU_input (InputLayer)            (None, 50, 1)         0                                            
____________________________________________________________________________________________________
SV_input (InputLayer)            (None, 50, 1)         0                                            
____________________________________________________________________________________________________
convI_1 (Convolution1D)          (None, 48, 50)        200         SI_input[0][0]                   
____________________________________________________________________________________________________
convQ_1 (Convolution1D)          (None, 48, 50)        200         SQ_input[0][0]                   
____________________________________________________________________________________________________
convU_1 (Convolution1D)          (None, 48, 50)        200         SU_input[0][0]                   
____________________________________________________________________________________________________
convV_1 (Convolution1D)          (None, 48, 50)        200         SV_input[0][0]                   
____________________________________________________________________________________________________
convI_2 (Convolution1D)          (None, 48, 50)        7550        convI_1[0][0]                    
____________________________________________________________________________________________________
convQ_2 (Convolution1D)          (None, 48, 50)        7550        convQ_1[0][0]                    
____________________________________________________________________________________________________
convU_2 (Convolution1D)          (None, 48, 50)        7550        convU_1[0][0]                    
____________________________________________________________________________________________________
convV_2 (Convolution1D)          (None, 48, 50)        7550        convV_1[0][0]                    
____________________________________________________________________________________________________
poolI_1 (MaxPooling1D)           (None, 24, 50)        0           convI_2[0][0]                    
____________________________________________________________________________________________________
poolQ_1 (MaxPooling1D)           (None, 24, 50)        0           convQ_2[0][0]                    
____________________________________________________________________________________________________
poolU_1 (MaxPooling1D)           (None, 24, 50)        0           convU_2[0][0]                    
____________________________________________________________________________________________________
poolV_1 (MaxPooling1D)           (None, 24, 50)        0           convV_2[0][0]                    
____________________________________________________________________________________________________
convI_3 (Convolution1D)          (None, 24, 50)        7550        poolI_1[0][0]                    
____________________________________________________________________________________________________
convQ_3 (Convolution1D)          (None, 24, 50)        7550        poolQ_1[0][0]                    
____________________________________________________________________________________________________
convU_3 (Convolution1D)          (None, 24, 50)        7550        poolU_1[0][0]                    
____________________________________________________________________________________________________
convV_3 (Convolution1D)          (None, 24, 50)        7550        poolV_1[0][0]                    
____________________________________________________________________________________________________
poolI_2 (MaxPooling1D)           (None, 12, 50)        0           convI_3[0][0]                    
____________________________________________________________________________________________________
poolQ_2 (MaxPooling1D)           (None, 12, 50)        0           convQ_3[0][0]                    
____________________________________________________________________________________________________
poolU_2 (MaxPooling1D)           (None, 12, 50)        0           convU_3[0][0]                    
____________________________________________________________________________________________________
poolV_2 (MaxPooling1D)           (None, 12, 50)        0           convV_3[0][0]                    
____________________________________________________________________________________________________
convI_4 (Convolution1D)          (None, 12, 50)        7550        poolI_2[0][0]                    
____________________________________________________________________________________________________
convQ_4 (Convolution1D)          (None, 12, 50)        7550        poolQ_2[0][0]                    
____________________________________________________________________________________________________
convU_4 (Convolution1D)          (None, 12, 50)        7550        poolU_2[0][0]                    
____________________________________________________________________________________________________
convV_4 (Convolution1D)          (None, 12, 50)        7550        poolV_2[0][0]                    
____________________________________________________________________________________________________
poolI_3 (MaxPooling1D)           (None, 6, 50)         0           convI_4[0][0]                    
____________________________________________________________________________________________________
poolQ_3 (MaxPooling1D)           (None, 6, 50)         0           convQ_4[0][0]                    
____________________________________________________________________________________________________
poolU_3 (MaxPooling1D)           (None, 6, 50)         0           convU_4[0][0]                    
____________________________________________________________________________________________________
poolV_3 (MaxPooling1D)           (None, 6, 50)         0           convV_4[0][0]                    
____________________________________________________________________________________________________
convI_5 (Convolution1D)          (None, 6, 50)         7550        poolI_3[0][0]                    
____________________________________________________________________________________________________
convQ_5 (Convolution1D)          (None, 6, 50)         7550        poolQ_3[0][0]                    
____________________________________________________________________________________________________
convU_5 (Convolution1D)          (None, 6, 50)         7550        poolU_3[0][0]                    
____________________________________________________________________________________________________
convV_5 (Convolution1D)          (None, 6, 50)         7550        poolV_3[0][0]                    
____________________________________________________________________________________________________
poolI_4 (MaxPooling1D)           (None, 3, 50)         0           convI_5[0][0]                    
____________________________________________________________________________________________________
poolQ_4 (MaxPooling1D)           (None, 3, 50)         0           convQ_5[0][0]                    
____________________________________________________________________________________________________
poolU_4 (MaxPooling1D)           (None, 3, 50)         0           convU_5[0][0]                    
____________________________________________________________________________________________________
poolV_4 (MaxPooling1D)           (None, 3, 50)         0           convV_5[0][0]                    
____________________________________________________________________________________________________
flatI (Flatten)                  (None, 150)           0           poolI_4[0][0]                    
____________________________________________________________________________________________________
flatQ (Flatten)                  (None, 150)           0           poolQ_4[0][0]                    
____________________________________________________________________________________________________
flatU (Flatten)                  (None, 150)           0           poolU_4[0][0]                    
____________________________________________________________________________________________________
flatV (Flatten)                  (None, 150)           0           poolV_4[0][0]                    
____________________________________________________________________________________________________
FC (Merge)                       (None, 600)           0           flatI[0][0]                      
                                                                   flatQ[0][0]                      
                                                                   flatU[0][0]                      
                                                                   flatV[0][0]                      
____________________________________________________________________________________________________
FC2 (Dense)                      (None, 200)           120200      FC[0][0]                         
____________________________________________________________________________________________________
out_BField (Dense)               (None, 50)            10050       FC2[0][0]                        
____________________________________________________________________________________________________
out_theta (Dense)                (None, 50)            10050       FC2[0][0]                        
____________________________________________________________________________________________________
out_chi (Dense)                  (None, 50)            10050       FC2[0][0]                        
____________________________________________________________________________________________________
out_vmac (Dense)                 (None, 50)            10050       FC2[0][0]                        
____________________________________________________________________________________________________
out_a (Dense)                    (None, 10)            2010        FC2[0][0]                        
____________________________________________________________________________________________________
out_B0 (Dense)                   (None, 20)            4020        FC2[0][0]                        
____________________________________________________________________________________________________
out_B1 (Dense)                   (None, 20)            4020        FC2[0][0]                        
____________________________________________________________________________________________________
out_doppler (Dense)              (None, 20)            4020        FC2[0][0]                        
____________________________________________________________________________________________________
out_kl (Dense)                   (None, 20)            4020        FC2[0][0]                        
====================================================================================================
Total params: 300090
____________________________________________________________________________________________________
