{"class_name": "Model", "keras_version": "1.1.0", "config": {"input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 1], "sparse": false, "input_dtype": "float32", "name": "SI_input"}, "name": "SI_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 1], "sparse": false, "input_dtype": "float32", "name": "SQ_input"}, "name": "SQ_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 1], "sparse": false, "input_dtype": "float32", "name": "SU_input"}, "name": "SU_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 64, 1], "sparse": false, "input_dtype": "float32", "name": "SV_input"}, "name": "SV_input"}, {"class_name": "GaussianNoise", "inbound_nodes": [[["SI_input", 0, 0]]], "config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_1"}, "name": "gaussiannoise_1"}, {"class_name": "GaussianNoise", "inbound_nodes": [[["SQ_input", 0, 0]]], "config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_2"}, "name": "gaussiannoise_2"}, {"class_name": "GaussianNoise", "inbound_nodes": [[["SU_input", 0, 0]]], "config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_3"}, "name": "gaussiannoise_3"}, {"class_name": "GaussianNoise", "inbound_nodes": [[["SV_input", 0, 0]]], "config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_4"}, "name": "gaussiannoise_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convI_1", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convI_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["gaussiannoise_2", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convQ_1", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convQ_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["gaussiannoise_3", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convU_1", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convU_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["gaussiannoise_4", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convV_1", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convV_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_1", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolI_1"}, "name": "poolI_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_1", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolQ_1"}, "name": "poolQ_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_1", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolU_1"}, "name": "poolU_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_1", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolV_1"}, "name": "poolV_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_1", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convI_2", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convI_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_1", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convQ_2", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convQ_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_1", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convU_2", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convU_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_1", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convV_2", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convV_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_2", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolI_2"}, "name": "poolI_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_2", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolQ_2"}, "name": "poolQ_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_2", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolU_2"}, "name": "poolU_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_2", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolV_2"}, "name": "poolV_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_2", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convI_3", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convI_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_2", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convQ_3", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convQ_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_2", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convU_3", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convU_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_2", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convV_3", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convV_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_3", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolI_3"}, "name": "poolI_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_3", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolQ_3"}, "name": "poolQ_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_3", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolU_3"}, "name": "poolU_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_3", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolV_3"}, "name": "poolV_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_3", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convI_4", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convI_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_3", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convQ_4", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convQ_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_3", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convU_4", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convU_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_3", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convV_4", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convV_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_4", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolI_4"}, "name": "poolI_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_4", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolQ_4"}, "name": "poolQ_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_4", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolU_4"}, "name": "poolU_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_4", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolV_4"}, "name": "poolV_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_4", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convI_5", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convI_5"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_4", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convQ_5", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convQ_5"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_4", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convU_5", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convU_5"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_4", 0, 0]]], "config": {"subsample_length": 1, "b_constraint": null, "activity_regularizer": null, "name": "convV_5", "activation": "relu", "trainable": true, "input_length": null, "input_dim": null, "W_regularizer": null, "border_mode": "same", "filter_length": 5, "b_regularizer": null, "init": "he_normal", "bias": true, "nb_filter": 50, "W_constraint": null}, "name": "convV_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_5", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolI_5"}, "name": "poolI_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_5", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolQ_5"}, "name": "poolQ_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_5", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolU_5"}, "name": "poolU_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_5", 0, 0]]], "config": {"stride": 2, "pool_length": 2, "border_mode": "valid", "trainable": true, "name": "poolV_5"}, "name": "poolV_5"}, {"class_name": "Flatten", "inbound_nodes": [[["poolI_5", 0, 0]]], "config": {"trainable": true, "name": "flatI"}, "name": "flatI"}, {"class_name": "Flatten", "inbound_nodes": [[["poolQ_5", 0, 0]]], "config": {"trainable": true, "name": "flatQ"}, "name": "flatQ"}, {"class_name": "Flatten", "inbound_nodes": [[["poolU_5", 0, 0]]], "config": {"trainable": true, "name": "flatU"}, "name": "flatU"}, {"class_name": "Flatten", "inbound_nodes": [[["poolV_5", 0, 0]]], "config": {"trainable": true, "name": "flatV"}, "name": "flatV"}, {"class_name": "Merge", "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "config": {"output_shape": null, "mode_type": "raw", "concat_axis": -1, "output_shape_type": "raw", "mode": "concat", "dot_axes": -1, "name": "FC"}, "name": "FC"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "name": "out_BField", "W_constraint": null}, "name": "out_BField"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "name": "out_theta", "W_constraint": null}, "name": "out_theta"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "name": "out_chi", "W_constraint": null}, "name": "out_chi"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "name": "out_vmac", "W_constraint": null}, "name": "out_vmac"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "name": "out_a", "W_constraint": null}, "name": "out_a"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 20, "b_regularizer": null, "init": "glorot_uniform", "name": "out_B0", "W_constraint": null}, "name": "out_B0"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 20, "b_regularizer": null, "init": "glorot_uniform", "name": "out_B1", "W_constraint": null}, "name": "out_B1"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 30, "b_regularizer": null, "init": "glorot_uniform", "name": "out_doppler", "W_constraint": null}, "name": "out_doppler"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"activation": "softmax", "b_constraint": null, "activity_regularizer": null, "bias": true, "trainable": true, "input_dim": null, "W_regularizer": null, "output_dim": 30, "b_regularizer": null, "init": "glorot_uniform", "name": "out_kl", "W_constraint": null}, "name": "out_kl"}], "output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]]}}