{"class_name": "Model", "keras_version": "1.1.0", "config": {"output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "SI_input", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 1], "name": "SI_input"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "SQ_input", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 1], "name": "SQ_input"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "SU_input", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 1], "name": "SU_input"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "SV_input", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 1], "name": "SV_input"}}, {"inbound_nodes": [[["SI_input", 0, 0]]], "class_name": "Convolution1D", "name": "convI_1", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 5, "name": "convI_1", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["SQ_input", 0, 0]]], "class_name": "Convolution1D", "name": "convQ_1", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 5, "name": "convQ_1", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["SU_input", 0, 0]]], "class_name": "Convolution1D", "name": "convU_1", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 5, "name": "convU_1", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["SV_input", 0, 0]]], "class_name": "Convolution1D", "name": "convV_1", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 5, "name": "convV_1", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["convI_1", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolI_1", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_1", "stride": 2}}, {"inbound_nodes": [[["convQ_1", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolQ_1", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_1", "stride": 2}}, {"inbound_nodes": [[["convU_1", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolU_1", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_1", "stride": 2}}, {"inbound_nodes": [[["convV_1", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolV_1", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_1", "stride": 2}}, {"inbound_nodes": [[["poolI_1", 0, 0]]], "class_name": "Convolution1D", "name": "convI_2", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 10, "name": "convI_2", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolQ_1", 0, 0]]], "class_name": "Convolution1D", "name": "convQ_2", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 10, "name": "convQ_2", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolU_1", 0, 0]]], "class_name": "Convolution1D", "name": "convU_2", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 10, "name": "convU_2", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolV_1", 0, 0]]], "class_name": "Convolution1D", "name": "convV_2", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 10, "name": "convV_2", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["convI_2", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolI_2", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_2", "stride": 2}}, {"inbound_nodes": [[["convQ_2", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolQ_2", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_2", "stride": 2}}, {"inbound_nodes": [[["convU_2", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolU_2", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_2", "stride": 2}}, {"inbound_nodes": [[["convV_2", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolV_2", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_2", "stride": 2}}, {"inbound_nodes": [[["poolI_2", 0, 0]]], "class_name": "Convolution1D", "name": "convI_3", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 15, "name": "convI_3", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolQ_2", 0, 0]]], "class_name": "Convolution1D", "name": "convQ_3", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 15, "name": "convQ_3", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolU_2", 0, 0]]], "class_name": "Convolution1D", "name": "convU_3", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 15, "name": "convU_3", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolV_2", 0, 0]]], "class_name": "Convolution1D", "name": "convV_3", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 15, "name": "convV_3", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["convI_3", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolI_3", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_3", "stride": 2}}, {"inbound_nodes": [[["convQ_3", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolQ_3", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_3", "stride": 2}}, {"inbound_nodes": [[["convU_3", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolU_3", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_3", "stride": 2}}, {"inbound_nodes": [[["convV_3", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolV_3", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_3", "stride": 2}}, {"inbound_nodes": [[["poolI_3", 0, 0]]], "class_name": "Convolution1D", "name": "convI_4", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 20, "name": "convI_4", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolQ_3", 0, 0]]], "class_name": "Convolution1D", "name": "convQ_4", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 20, "name": "convQ_4", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolU_3", 0, 0]]], "class_name": "Convolution1D", "name": "convU_4", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 20, "name": "convU_4", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolV_3", 0, 0]]], "class_name": "Convolution1D", "name": "convV_4", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 20, "name": "convV_4", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["convI_4", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolI_4", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_4", "stride": 2}}, {"inbound_nodes": [[["convQ_4", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolQ_4", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_4", "stride": 2}}, {"inbound_nodes": [[["convU_4", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolU_4", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_4", "stride": 2}}, {"inbound_nodes": [[["convV_4", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolV_4", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_4", "stride": 2}}, {"inbound_nodes": [[["poolI_4", 0, 0]]], "class_name": "Convolution1D", "name": "convI_5", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 25, "name": "convI_5", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolQ_4", 0, 0]]], "class_name": "Convolution1D", "name": "convQ_5", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 25, "name": "convQ_5", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolU_4", 0, 0]]], "class_name": "Convolution1D", "name": "convU_5", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 25, "name": "convU_5", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["poolV_4", 0, 0]]], "class_name": "Convolution1D", "name": "convV_5", "config": {"activity_regularizer": null, "W_constraint": null, "input_dim": null, "bias": true, "subsample_length": 1, "activation": "relu", "b_regularizer": null, "filter_length": 25, "name": "convV_5", "W_regularizer": null, "nb_filter": 50, "trainable": true, "border_mode": "same", "input_length": null, "init": "he_normal", "b_constraint": null}}, {"inbound_nodes": [[["convI_5", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolI_5", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_5", "stride": 2}}, {"inbound_nodes": [[["convQ_5", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolQ_5", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_5", "stride": 2}}, {"inbound_nodes": [[["convU_5", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolU_5", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_5", "stride": 2}}, {"inbound_nodes": [[["convV_5", 0, 0]]], "class_name": "MaxPooling1D", "name": "poolV_5", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_5", "stride": 2}}, {"inbound_nodes": [[["poolI_5", 0, 0]]], "class_name": "Flatten", "name": "flatI", "config": {"trainable": true, "name": "flatI"}}, {"inbound_nodes": [[["poolQ_5", 0, 0]]], "class_name": "Flatten", "name": "flatQ", "config": {"trainable": true, "name": "flatQ"}}, {"inbound_nodes": [[["poolU_5", 0, 0]]], "class_name": "Flatten", "name": "flatU", "config": {"trainable": true, "name": "flatU"}}, {"inbound_nodes": [[["poolV_5", 0, 0]]], "class_name": "Flatten", "name": "flatV", "config": {"trainable": true, "name": "flatV"}}, {"inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "class_name": "Merge", "name": "FC", "config": {"output_shape": null, "mode_type": "raw", "name": "FC", "concat_axis": -1, "output_shape_type": "raw", "mode": "concat", "dot_axes": -1}}, {"inbound_nodes": [[["FC", 0, 0]]], "class_name": "Dense", "name": "FC2", "config": {"activity_regularizer": null, "output_dim": 200, "W_constraint": null, "input_dim": null, "bias": true, "activation": "relu", "b_regularizer": null, "name": "FC2", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_BField", "config": {"activity_regularizer": null, "output_dim": 50, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_BField", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_theta", "config": {"activity_regularizer": null, "output_dim": 50, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_theta", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_chi", "config": {"activity_regularizer": null, "output_dim": 50, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_chi", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_vmac", "config": {"activity_regularizer": null, "output_dim": 50, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_vmac", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_a", "config": {"activity_regularizer": null, "output_dim": 10, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_a", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_B0", "config": {"activity_regularizer": null, "output_dim": 20, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_B0", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_B1", "config": {"activity_regularizer": null, "output_dim": 20, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_B1", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_doppler", "config": {"activity_regularizer": null, "output_dim": 20, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_doppler", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "class_name": "Dense", "name": "out_kl", "config": {"activity_regularizer": null, "output_dim": 20, "W_constraint": null, "input_dim": null, "bias": true, "activation": "softmax", "b_regularizer": null, "name": "out_kl", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "b_constraint": null}}], "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]]}}