{"config": {"input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "layers": [{"inbound_nodes": [], "name": "SI_input", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 1], "name": "SI_input"}}, {"inbound_nodes": [], "name": "SQ_input", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 1], "name": "SQ_input"}}, {"inbound_nodes": [], "name": "SU_input", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 1], "name": "SU_input"}}, {"inbound_nodes": [], "name": "SV_input", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 64, 1], "name": "SV_input"}}, {"inbound_nodes": [[["SI_input", 0, 0]]], "name": "convI_1", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convI_1", "filter_length": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["SQ_input", 0, 0]]], "name": "convQ_1", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convQ_1", "filter_length": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["SU_input", 0, 0]]], "name": "convU_1", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convU_1", "filter_length": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["SV_input", 0, 0]]], "name": "convV_1", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convV_1", "filter_length": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["convI_1", 0, 0]]], "name": "poolI_1", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_1", "stride": 2}}, {"inbound_nodes": [[["convQ_1", 0, 0]]], "name": "poolQ_1", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_1", "stride": 2}}, {"inbound_nodes": [[["convU_1", 0, 0]]], "name": "poolU_1", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_1", "stride": 2}}, {"inbound_nodes": [[["convV_1", 0, 0]]], "name": "poolV_1", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_1", "stride": 2}}, {"inbound_nodes": [[["poolI_1", 0, 0]]], "name": "convI_2", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convI_2", "filter_length": 10, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolQ_1", 0, 0]]], "name": "convQ_2", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convQ_2", "filter_length": 10, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolU_1", 0, 0]]], "name": "convU_2", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convU_2", "filter_length": 10, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolV_1", 0, 0]]], "name": "convV_2", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convV_2", "filter_length": 10, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["convI_2", 0, 0]]], "name": "poolI_2", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_2", "stride": 2}}, {"inbound_nodes": [[["convQ_2", 0, 0]]], "name": "poolQ_2", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_2", "stride": 2}}, {"inbound_nodes": [[["convU_2", 0, 0]]], "name": "poolU_2", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_2", "stride": 2}}, {"inbound_nodes": [[["convV_2", 0, 0]]], "name": "poolV_2", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_2", "stride": 2}}, {"inbound_nodes": [[["poolI_2", 0, 0]]], "name": "convI_3", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convI_3", "filter_length": 15, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolQ_2", 0, 0]]], "name": "convQ_3", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convQ_3", "filter_length": 15, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolU_2", 0, 0]]], "name": "convU_3", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convU_3", "filter_length": 15, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolV_2", 0, 0]]], "name": "convV_3", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convV_3", "filter_length": 15, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["convI_3", 0, 0]]], "name": "poolI_3", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_3", "stride": 2}}, {"inbound_nodes": [[["convQ_3", 0, 0]]], "name": "poolQ_3", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_3", "stride": 2}}, {"inbound_nodes": [[["convU_3", 0, 0]]], "name": "poolU_3", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_3", "stride": 2}}, {"inbound_nodes": [[["convV_3", 0, 0]]], "name": "poolV_3", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_3", "stride": 2}}, {"inbound_nodes": [[["poolI_3", 0, 0]]], "name": "convI_4", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convI_4", "filter_length": 20, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolQ_3", 0, 0]]], "name": "convQ_4", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convQ_4", "filter_length": 20, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolU_3", 0, 0]]], "name": "convU_4", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convU_4", "filter_length": 20, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolV_3", 0, 0]]], "name": "convV_4", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convV_4", "filter_length": 20, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["convI_4", 0, 0]]], "name": "poolI_4", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_4", "stride": 2}}, {"inbound_nodes": [[["convQ_4", 0, 0]]], "name": "poolQ_4", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_4", "stride": 2}}, {"inbound_nodes": [[["convU_4", 0, 0]]], "name": "poolU_4", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_4", "stride": 2}}, {"inbound_nodes": [[["convV_4", 0, 0]]], "name": "poolV_4", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_4", "stride": 2}}, {"inbound_nodes": [[["poolI_4", 0, 0]]], "name": "convI_5", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convI_5", "filter_length": 25, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolQ_4", 0, 0]]], "name": "convQ_5", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convQ_5", "filter_length": 25, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolU_4", 0, 0]]], "name": "convU_5", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convU_5", "filter_length": 25, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["poolV_4", 0, 0]]], "name": "convV_5", "class_name": "Convolution1D", "config": {"subsample_length": 1, "border_mode": "same", "bias": true, "name": "convV_5", "filter_length": 25, "trainable": true, "b_regularizer": null, "W_constraint": null, "init": "he_normal", "activation": "relu", "input_length": null, "b_constraint": null, "activity_regularizer": null, "nb_filter": 50, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["convI_5", 0, 0]]], "name": "poolI_5", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolI_5", "stride": 2}}, {"inbound_nodes": [[["convQ_5", 0, 0]]], "name": "poolQ_5", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolQ_5", "stride": 2}}, {"inbound_nodes": [[["convU_5", 0, 0]]], "name": "poolU_5", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolU_5", "stride": 2}}, {"inbound_nodes": [[["convV_5", 0, 0]]], "name": "poolV_5", "class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "border_mode": "valid", "name": "poolV_5", "stride": 2}}, {"inbound_nodes": [[["poolI_5", 0, 0]]], "name": "flatI", "class_name": "Flatten", "config": {"trainable": true, "name": "flatI"}}, {"inbound_nodes": [[["poolQ_5", 0, 0]]], "name": "flatQ", "class_name": "Flatten", "config": {"trainable": true, "name": "flatQ"}}, {"inbound_nodes": [[["poolU_5", 0, 0]]], "name": "flatU", "class_name": "Flatten", "config": {"trainable": true, "name": "flatU"}}, {"inbound_nodes": [[["poolV_5", 0, 0]]], "name": "flatV", "class_name": "Flatten", "config": {"trainable": true, "name": "flatV"}}, {"inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "name": "FC", "class_name": "Merge", "config": {"output_shape": null, "output_shape_type": "raw", "name": "FC", "mode": "concat", "concat_axis": -1, "dot_axes": [-1, -1], "mode_type": "raw"}}, {"inbound_nodes": [[["FC", 0, 0]]], "name": "FC2", "class_name": "Dense", "config": {"bias": true, "name": "FC2", "trainable": true, "output_dim": 300, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_B0", "class_name": "Dense", "config": {"bias": true, "name": "out_B0", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_B1", "class_name": "Dense", "config": {"bias": true, "name": "out_B1", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_BField", "class_name": "Dense", "config": {"bias": true, "name": "out_BField", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_a", "class_name": "Dense", "config": {"bias": true, "name": "out_a", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_chi", "class_name": "Dense", "config": {"bias": true, "name": "out_chi", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_doppler", "class_name": "Dense", "config": {"bias": true, "name": "out_doppler", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_kl", "class_name": "Dense", "config": {"bias": true, "name": "out_kl", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_theta", "class_name": "Dense", "config": {"bias": true, "name": "out_theta", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}, {"inbound_nodes": [[["FC2", 0, 0]]], "name": "out_vmac", "class_name": "Dense", "config": {"bias": true, "name": "out_vmac", "trainable": true, "output_dim": 30, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_constraint": null, "activity_regularizer": null, "input_dim": null, "W_regularizer": null}}], "name": "model_1", "output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_doppler", 0, 0], ["out_kl", 0, 0]]}, "class_name": "Model", "keras_version": "1.0.7"}