____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
stokes_input (InputLayer)        (None, 50, 4)         0                                            
____________________________________________________________________________________________________
conv_1 (Convolution1D)           (None, 48, 128)       1664        stokes_input[0][0]               
____________________________________________________________________________________________________
batchnormalization_1 (BatchNormal(None, 48, 128)       256         conv_1[0][0]                     
____________________________________________________________________________________________________
conv_2 (Convolution1D)           (None, 48, 128)       49280       batchnormalization_1[0][0]       
____________________________________________________________________________________________________
batchnormalization_2 (BatchNormal(None, 48, 128)       256         conv_2[0][0]                     
____________________________________________________________________________________________________
pool_1 (MaxPooling1D)            (None, 24, 128)       0           batchnormalization_2[0][0]       
____________________________________________________________________________________________________
conv_3a (Convolution1D)          (None, 24, 128)       98432       pool_1[0][0]                     
____________________________________________________________________________________________________
batchnormalization_3 (BatchNormal(None, 24, 128)       256         conv_3a[0][0]                    
____________________________________________________________________________________________________
conv_3b (Convolution1D)          (None, 24, 128)       98432       batchnormalization_3[0][0]       
____________________________________________________________________________________________________
batchnormalization_4 (BatchNormal(None, 24, 128)       256         conv_3b[0][0]                    
____________________________________________________________________________________________________
pool_2 (MaxPooling1D)            (None, 12, 128)       0           batchnormalization_4[0][0]       
____________________________________________________________________________________________________
conv_4a (Convolution1D)          (None, 12, 128)       147584      pool_2[0][0]                     
____________________________________________________________________________________________________
batchnormalization_5 (BatchNormal(None, 12, 128)       256         conv_4a[0][0]                    
____________________________________________________________________________________________________
conv_4b (Convolution1D)          (None, 12, 128)       147584      batchnormalization_5[0][0]       
____________________________________________________________________________________________________
batchnormalization_6 (BatchNormal(None, 12, 128)       256         conv_4b[0][0]                    
____________________________________________________________________________________________________
pool_3 (MaxPooling1D)            (None, 6, 128)        0           batchnormalization_6[0][0]       
____________________________________________________________________________________________________
conv_5a (Convolution1D)          (None, 6, 128)        196736      pool_3[0][0]                     
____________________________________________________________________________________________________
batchnormalization_7 (BatchNormal(None, 6, 128)        256         conv_5a[0][0]                    
____________________________________________________________________________________________________
conv_5b (Convolution1D)          (None, 6, 128)        196736      batchnormalization_7[0][0]       
____________________________________________________________________________________________________
batchnormalization_8 (BatchNormal(None, 6, 128)        256         conv_5b[0][0]                    
____________________________________________________________________________________________________
pool_4 (MaxPooling1D)            (None, 3, 128)        0           batchnormalization_8[0][0]       
____________________________________________________________________________________________________
flat (Flatten)                   (None, 384)           0           pool_4[0][0]                     
____________________________________________________________________________________________________
FC (Dense)                       (None, 200)           77000       flat[0][0]                       
____________________________________________________________________________________________________
out_BField (Dense)               (None, 50)            10050       FC[0][0]                         
____________________________________________________________________________________________________
out_theta (Dense)                (None, 50)            10050       FC[0][0]                         
____________________________________________________________________________________________________
out_chi (Dense)                  (None, 50)            10050       FC[0][0]                         
____________________________________________________________________________________________________
out_vmac (Dense)                 (None, 50)            10050       FC[0][0]                         
____________________________________________________________________________________________________
out_a (Dense)                    (None, 10)            2010        FC[0][0]                         
____________________________________________________________________________________________________
out_doppler (Dense)              (None, 20)            4020        FC[0][0]                         
====================================================================================================
Total params: 1061726
____________________________________________________________________________________________________
