{"keras_version": "1.1.1", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["stokes_input", 0, 0]], "output_layers": [["out_BField", 0, 0], ["out_theta", 0, 0], ["out_chi", 0, 0], ["out_vmac", 0, 0], ["out_a", 0, 0], ["out_doppler", 0, 0]], "layers": [{"name": "stokes_input", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 50, 4], "input_dtype": "float32", "name": "stokes_input"}}, {"name": "conv_1", "class_name": "Convolution1D", "inbound_nodes": [[["stokes_input", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_1", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 3, "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_1", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_1", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "conv_2", "class_name": "Convolution1D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_2", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 3, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_2", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_2", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "pool_1", "class_name": "MaxPooling1D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "config": {"name": "pool_1", "border_mode": "valid", "trainable": true, "pool_length": 2, "stride": 2}}, {"name": "conv_3a", "class_name": "Convolution1D", "inbound_nodes": [[["pool_1", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_3a", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 6, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_3a", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_3", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "conv_3b", "class_name": "Convolution1D", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_3b", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 6, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_3b", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_4", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "pool_2", "class_name": "MaxPooling1D", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "config": {"name": "pool_2", "border_mode": "valid", "trainable": true, "pool_length": 2, "stride": 2}}, {"name": "conv_4a", "class_name": "Convolution1D", "inbound_nodes": [[["pool_2", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_4a", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 9, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_4a", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_5", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "conv_4b", "class_name": "Convolution1D", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_4b", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 9, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_4b", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_6", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "pool_3", "class_name": "MaxPooling1D", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "config": {"name": "pool_3", "border_mode": "valid", "trainable": true, "pool_length": 2, "stride": 2}}, {"name": "conv_5a", "class_name": "Convolution1D", "inbound_nodes": [[["pool_3", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_5a", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 12, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_5a", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_7", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "conv_5b", "class_name": "Convolution1D", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "config": {"input_dim": null, "trainable": true, "name": "conv_5b", "input_length": null, "init": "he_normal", "activation": "relu", "bias": true, "filter_length": 12, "b_regularizer": null, "b_constraint": null, "border_mode": "same", "subsample_length": 1, "W_constraint": null, "W_regularizer": null, "nb_filter": 128, "activity_regularizer": null}}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_5b", 0, 0]]], "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_8", "axis": -1, "mode": 0, "gamma_regularizer": null, "epsilon": 1e-05}}, {"name": "pool_4", "class_name": "MaxPooling1D", "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "config": {"name": "pool_4", "border_mode": "valid", "trainable": true, "pool_length": 2, "stride": 2}}, {"name": "flat", "class_name": "Flatten", "inbound_nodes": [[["pool_4", 0, 0]]], "config": {"trainable": true, "name": "flat"}}, {"name": "FC", "class_name": "Dense", "inbound_nodes": [[["flat", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "FC", "activation": "relu", "W_constraint": null, "output_dim": 200, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"name": "out_BField", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "out_BField", "activation": "softmax", "W_constraint": null, "output_dim": 50, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"name": "out_theta", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "out_theta", "activation": "softmax", "W_constraint": null, "output_dim": 50, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"name": "out_chi", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "out_chi", "activation": "softmax", "W_constraint": null, "output_dim": 50, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"name": "out_vmac", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "out_vmac", "activation": "softmax", "W_constraint": null, "output_dim": 50, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"name": "out_a", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "out_a", "activation": "softmax", "W_constraint": null, "output_dim": 10, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"name": "out_doppler", "class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"input_dim": null, "trainable": true, "W_regularizer": null, "name": "out_doppler", "activation": "softmax", "W_constraint": null, "output_dim": 20, "b_constraint": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}]}}