_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
stokes_input (InputLayer)    (None, None, 150, 1)      0         
_________________________________________________________________
batch_normalization_1 (Batch (None, None, 150, 1)      4         
_________________________________________________________________
flatten (TimeDistributed)    (None, None, 150)         0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 128)               142848    
_________________________________________________________________
alpha (Dense)                (None, 5)                 645       
=================================================================
Total params: 143,497
Trainable params: 143,495
Non-trainable params: 2
_________________________________________________________________
