{"keras_version": "1.2.0", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 50, 50, 2], "input_dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_1", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "relu"}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_2", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_1", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_3", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_2", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_2", 0, 0], ["convolution2d_1", 0, 0]]], "class_name": "Merge", "name": "merge_1", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_1", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_4", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_3", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_5", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_4", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_4", 0, 0], ["merge_1", 0, 0]]], "class_name": "Merge", "name": "merge_2", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_2", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_6", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_6", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_5", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_7", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_7", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_6", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_6", 0, 0], ["merge_2", 0, 0]]], "class_name": "Merge", "name": "merge_3", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_3", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_8", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_8", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_7", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_7", 0, 0]]], "class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_9", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_9", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_8", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_8", 0, 0], ["merge_3", 0, 0]]], "class_name": "Merge", "name": "merge_4", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_4", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_10", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_10", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_9", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_9", 0, 0]]], "class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_11", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_11", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_10", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_10", 0, 0], ["merge_4", 0, 0]]], "class_name": "Merge", "name": "merge_5", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_5", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_12", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_12", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_12", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_11", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_11", 0, 0]]], "class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_13", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_13", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_12", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_12", 0, 0], ["merge_5", 0, 0]]], "class_name": "Merge", "name": "merge_6", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_6", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_6", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_14", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_14", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_13", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_13", 0, 0]]], "class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["activation_7", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_15", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_15", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_14", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_14", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_14", 0, 0], ["merge_6", 0, 0]]], "class_name": "Merge", "name": "merge_7", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_7", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_7", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_16", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_16", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_15", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_15", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_15", 0, 0]]], "class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["activation_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_17", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_17", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_17", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_16", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_16", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_16", 0, 0], ["merge_7", 0, 0]]], "class_name": "Merge", "name": "merge_8", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_8", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_18", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_18", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_18", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_17", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_17", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_17", 0, 0]]], "class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["activation_9", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_19", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_19", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_19", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_18", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_18", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_18", 0, 0], ["merge_8", 0, 0]]], "class_name": "Merge", "name": "merge_9", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_9", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_9", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_20", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_20", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_20", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_19", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_19", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_19", 0, 0]]], "class_name": "Activation", "name": "activation_10", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["activation_10", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_21", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_21", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_21", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_20", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_20", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_20", 0, 0], ["merge_9", 0, 0]]], "class_name": "Merge", "name": "merge_10", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_10", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_10", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_22", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_22", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_22", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_21", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_21", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_21", 0, 0]]], "class_name": "Activation", "name": "activation_11", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["activation_11", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_23", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_23", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_23", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_22", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_22", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_22", 0, 0], ["merge_10", 0, 0]]], "class_name": "Merge", "name": "merge_11", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_11", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_11", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_24", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_24", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_24", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_23", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_23", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_23", 0, 0]]], "class_name": "Activation", "name": "activation_12", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_12", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_25", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_25", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_25", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_24", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_24", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_24", 0, 0], ["merge_11", 0, 0]]], "class_name": "Merge", "name": "merge_12", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_12", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_12", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_26", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_26", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_26", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_25", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_25", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_25", 0, 0]]], "class_name": "Activation", "name": "activation_13", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_27", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_27", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_27", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_26", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_26", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_26", 0, 0], ["merge_12", 0, 0]]], "class_name": "Merge", "name": "merge_13", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_13", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_13", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_28", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_28", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_28", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_27", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_27", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_27", 0, 0]]], "class_name": "Activation", "name": "activation_14", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["activation_14", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_29", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_29", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_29", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_28", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_28", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_28", 0, 0], ["merge_13", 0, 0]]], "class_name": "Merge", "name": "merge_14", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_14", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_14", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_30", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_30", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_30", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_29", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_29", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_29", 0, 0]]], "class_name": "Activation", "name": "activation_15", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["activation_15", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_31", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_31", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_31", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_30", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_30", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_30", 0, 0], ["merge_14", 0, 0]]], "class_name": "Merge", "name": "merge_15", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_15", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_15", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_32", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_32", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_32", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_31", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_31", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_31", 0, 0]]], "class_name": "Activation", "name": "activation_16", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["activation_16", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_33", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_33", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_33", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_32", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_32", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_32", 0, 0], ["merge_15", 0, 0]]], "class_name": "Merge", "name": "merge_16", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_16", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_16", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_34", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_34", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_34", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_33", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_33", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_33", 0, 0]]], "class_name": "Activation", "name": "activation_17", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["activation_17", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_35", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_35", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_35", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_34", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_34", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_34", 0, 0], ["merge_16", 0, 0]]], "class_name": "Merge", "name": "merge_17", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_17", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_17", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_36", "config": {"nb_filter": 64, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_36", "nb_col": 3, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}, {"inbound_nodes": [[["convolution2d_36", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_35", "config": {"epsilon": 0.001, "mode": 0, "trainable": true, "name": "batchnormalization_35", "momentum": 0.99, "beta_regularizer": null, "axis": -1, "gamma_regularizer": null}}, {"inbound_nodes": [[["batchnormalization_35", 0, 0], ["convolution2d_1", 0, 0]]], "class_name": "Merge", "name": "merge_18", "config": {"concat_axis": -1, "mode": "sum", "name": "merge_18", "output_mask": null, "output_mask_type": "raw", "output_shape": null, "arguments": {}, "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_18", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_37", "config": {"nb_filter": 1, "init": "he_normal", "trainable": true, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "bias": true, "b_regularizer": null, "activity_regularizer": null, "name": "convolution2d_37", "nb_col": 1, "b_constraint": null, "border_mode": "same", "W_constraint": null, "dim_ordering": "tf", "activation": "linear"}}], "output_layers": [["convolution2d_37", 0, 0]]}}