{"keras_version": "1.2.0", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 50, 50, 2], "sparse": false, "input_dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "gaussiannoise_1", "class_name": "GaussianNoise", "config": {"sigma": 0.0002, "name": "gaussiannoise_1", "trainable": true}}, {"inbound_nodes": [[["gaussiannoise_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_1", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_2", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_1", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_3", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_2", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_2", 0, 0], ["convolution2d_1", 0, 0]]], "name": "merge_1", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_1", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_4", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_3", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_5", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_4", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_4", 0, 0], ["merge_1", 0, 0]]], "name": "merge_2", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_2", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution2d_6", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_6", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_5", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0]]], "name": "convolution2d_7", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_7", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_6", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_6", 0, 0], ["merge_2", 0, 0]]], "name": "merge_3", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_3", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution2d_8", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_8", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "batchnormalization_7", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_7", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution2d_9", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_9", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "batchnormalization_8", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_8", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_8", 0, 0], ["merge_3", 0, 0]]], "name": "merge_4", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_4", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_4", 0, 0]]], "name": "convolution2d_10", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_10", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "batchnormalization_9", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_9", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_5", 0, 0]]], "name": "convolution2d_11", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_11", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "batchnormalization_10", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_10", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_10", 0, 0], ["merge_4", 0, 0]]], "name": "merge_5", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_5", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_5", 0, 0]]], "name": "convolution2d_12", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_12", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "batchnormalization_11", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_11", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_11", 0, 0]]], "name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_6", 0, 0]]], "name": "convolution2d_13", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_13", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "batchnormalization_12", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_12", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_12", 0, 0], ["merge_5", 0, 0]]], "name": "merge_6", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_6", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_6", 0, 0]]], "name": "convolution2d_14", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_14", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "batchnormalization_13", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_13", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_13", 0, 0]]], "name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_7", 0, 0]]], "name": "convolution2d_15", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_15", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "batchnormalization_14", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_14", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_14", 0, 0], ["merge_6", 0, 0]]], "name": "merge_7", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_7", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_7", 0, 0]]], "name": "convolution2d_16", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_16", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "batchnormalization_15", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_15", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_15", 0, 0]]], "name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_8", 0, 0]]], "name": "convolution2d_17", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_17", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_17", 0, 0]]], "name": "batchnormalization_16", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_16", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_16", 0, 0], ["merge_7", 0, 0]]], "name": "merge_8", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_8", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_8", 0, 0]]], "name": "convolution2d_18", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_18", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "batchnormalization_17", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_17", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_17", 0, 0]]], "name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_9", 0, 0]]], "name": "convolution2d_19", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_19", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_19", 0, 0]]], "name": "batchnormalization_18", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_18", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_18", 0, 0], ["merge_8", 0, 0]]], "name": "merge_9", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_9", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_9", 0, 0]]], "name": "convolution2d_20", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_20", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_20", 0, 0]]], "name": "batchnormalization_19", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_19", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_19", 0, 0]]], "name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_10", 0, 0]]], "name": "convolution2d_21", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_21", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_21", 0, 0]]], "name": "batchnormalization_20", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_20", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_20", 0, 0], ["merge_9", 0, 0]]], "name": "merge_10", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_10", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_10", 0, 0]]], "name": "convolution2d_22", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_22", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_22", 0, 0]]], "name": "batchnormalization_21", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_21", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_11", 0, 0]]], "name": "convolution2d_23", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_23", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_23", 0, 0]]], "name": "batchnormalization_22", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_22", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_22", 0, 0], ["merge_10", 0, 0]]], "name": "merge_11", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_11", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_11", 0, 0]]], "name": "convolution2d_24", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_24", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_24", 0, 0]]], "name": "batchnormalization_23", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_23", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_12", 0, 0]]], "name": "convolution2d_25", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_25", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_25", 0, 0]]], "name": "batchnormalization_24", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_24", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_24", 0, 0], ["merge_11", 0, 0]]], "name": "merge_12", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_12", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_12", 0, 0]]], "name": "convolution2d_26", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_26", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "batchnormalization_25", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_25", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_25", 0, 0]]], "name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_13", 0, 0]]], "name": "convolution2d_27", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_27", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_27", 0, 0]]], "name": "batchnormalization_26", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_26", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_26", 0, 0], ["merge_12", 0, 0]]], "name": "merge_13", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_13", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_13", 0, 0]]], "name": "convolution2d_28", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_28", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_28", 0, 0]]], "name": "batchnormalization_27", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_27", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_27", 0, 0]]], "name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_14", 0, 0]]], "name": "convolution2d_29", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_29", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_29", 0, 0]]], "name": "batchnormalization_28", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_28", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_28", 0, 0], ["merge_13", 0, 0]]], "name": "merge_14", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_14", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_14", 0, 0]]], "name": "convolution2d_30", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_30", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_30", 0, 0]]], "name": "batchnormalization_29", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_29", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_15", 0, 0]]], "name": "convolution2d_31", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_31", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_31", 0, 0]]], "name": "batchnormalization_30", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_30", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_30", 0, 0], ["merge_14", 0, 0]]], "name": "merge_15", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_15", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_15", 0, 0]]], "name": "convolution2d_32", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_32", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "batchnormalization_31", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_31", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_31", 0, 0]]], "name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_16", 0, 0]]], "name": "convolution2d_33", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_33", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_33", 0, 0]]], "name": "batchnormalization_32", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_32", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_32", 0, 0], ["merge_15", 0, 0]]], "name": "merge_16", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_16", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_16", 0, 0]]], "name": "convolution2d_34", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_34", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_34", 0, 0]]], "name": "batchnormalization_33", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_33", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_33", 0, 0]]], "name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_17", 0, 0]]], "name": "convolution2d_35", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_35", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_35", 0, 0]]], "name": "batchnormalization_34", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_34", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_34", 0, 0], ["merge_16", 0, 0]]], "name": "merge_17", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_17", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_17", 0, 0]]], "name": "convolution2d_36", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 3, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 3, "name": "convolution2d_36", "bias": true, "dim_ordering": "tf", "nb_filter": 64, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "border_mode": "same", "b_constraint": null}}, {"inbound_nodes": [[["convolution2d_36", 0, 0]]], "name": "batchnormalization_35", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_35", "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "mode": 0}}, {"inbound_nodes": [[["batchnormalization_35", 0, 0], ["convolution2d_1", 0, 0]]], "name": "merge_18", "class_name": "Merge", "config": {"output_shape_type": "raw", "arguments": {}, "name": "merge_18", "output_mask": null, "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_mask_type": "raw", "mode": "sum", "output_shape": null}}, {"inbound_nodes": [[["merge_18", 0, 0]]], "name": "convolution2d_37", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "nb_col": 1, "init": "he_normal", "W_constraint": null, "b_regularizer": null, "nb_row": 1, "name": "convolution2d_37", "bias": true, "dim_ordering": "tf", "nb_filter": 1, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "relu", "border_mode": "same", "b_constraint": null}}], "name": "model_1", "output_layers": [["convolution2d_37", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}