{"class_name": "Model", "keras_version": "1.2.0", "config": {"output_layers": [["convolution2d_37", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 50, 50, 2]}}, {"class_name": "GaussianNoise", "name": "gaussiannoise_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"name": "gaussiannoise_1", "sigma": 0.001, "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_1", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_2", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["batchnormalization_2", 0, 0], ["convolution2d_1", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_1", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_3", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_4", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_2", "inbound_nodes": [[["batchnormalization_4", 0, 0], ["merge_1", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_2", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_6", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_6", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_5", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_7", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_7", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_6", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_3", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["merge_2", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_3", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_8", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_8", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_7", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_9", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_9", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_8", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_4", "inbound_nodes": [[["batchnormalization_8", 0, 0], ["merge_3", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_4", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_10", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_10", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_9", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_9", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_11", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_11", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_10", "inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_10", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_5", "inbound_nodes": [[["batchnormalization_10", 0, 0], ["merge_4", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_5", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_12", "inbound_nodes": [[["merge_5", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_12", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_11", "inbound_nodes": [[["convolution2d_12", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_11", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batchnormalization_11", 0, 0]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_13", "inbound_nodes": [[["activation_6", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_13", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_12", "inbound_nodes": [[["convolution2d_13", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_12", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_6", "inbound_nodes": [[["batchnormalization_12", 0, 0], ["merge_5", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_6", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_14", "inbound_nodes": [[["merge_6", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_14", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_13", "inbound_nodes": [[["convolution2d_14", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_13", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batchnormalization_13", 0, 0]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_15", "inbound_nodes": [[["activation_7", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_15", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_14", "inbound_nodes": [[["convolution2d_15", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_14", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_7", "inbound_nodes": [[["batchnormalization_14", 0, 0], ["merge_6", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_7", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_16", "inbound_nodes": [[["merge_7", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_16", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_15", "inbound_nodes": [[["convolution2d_16", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_15", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batchnormalization_15", 0, 0]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_17", "inbound_nodes": [[["activation_8", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_17", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_16", "inbound_nodes": [[["convolution2d_17", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_16", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_8", "inbound_nodes": [[["batchnormalization_16", 0, 0], ["merge_7", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_8", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_18", "inbound_nodes": [[["merge_8", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_18", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_17", "inbound_nodes": [[["convolution2d_18", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_17", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_19", "inbound_nodes": [[["activation_9", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_19", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_18", "inbound_nodes": [[["convolution2d_19", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_18", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_9", "inbound_nodes": [[["batchnormalization_18", 0, 0], ["merge_8", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_9", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_20", "inbound_nodes": [[["merge_9", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_20", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_19", "inbound_nodes": [[["convolution2d_20", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_19", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["batchnormalization_19", 0, 0]]], "config": {"name": "activation_10", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_21", "inbound_nodes": [[["activation_10", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_21", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_20", "inbound_nodes": [[["convolution2d_21", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_20", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_10", "inbound_nodes": [[["batchnormalization_20", 0, 0], ["merge_9", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_10", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_22", "inbound_nodes": [[["merge_10", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_22", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_21", "inbound_nodes": [[["convolution2d_22", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_21", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "config": {"name": "activation_11", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_23", "inbound_nodes": [[["activation_11", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_23", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_22", "inbound_nodes": [[["convolution2d_23", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_22", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_11", "inbound_nodes": [[["batchnormalization_22", 0, 0], ["merge_10", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_11", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_24", "inbound_nodes": [[["merge_11", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_24", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_23", "inbound_nodes": [[["convolution2d_24", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_23", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "config": {"name": "activation_12", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_25", "inbound_nodes": [[["activation_12", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_25", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_24", "inbound_nodes": [[["convolution2d_25", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_24", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_12", "inbound_nodes": [[["batchnormalization_24", 0, 0], ["merge_11", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_12", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_26", "inbound_nodes": [[["merge_12", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_26", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_25", "inbound_nodes": [[["convolution2d_26", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_25", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["batchnormalization_25", 0, 0]]], "config": {"name": "activation_13", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_27", "inbound_nodes": [[["activation_13", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_27", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_26", "inbound_nodes": [[["convolution2d_27", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_26", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_13", "inbound_nodes": [[["batchnormalization_26", 0, 0], ["merge_12", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_13", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_28", "inbound_nodes": [[["merge_13", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_28", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_27", "inbound_nodes": [[["convolution2d_28", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_27", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["batchnormalization_27", 0, 0]]], "config": {"name": "activation_14", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_29", "inbound_nodes": [[["activation_14", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_29", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_28", "inbound_nodes": [[["convolution2d_29", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_28", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_14", "inbound_nodes": [[["batchnormalization_28", 0, 0], ["merge_13", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_14", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_30", "inbound_nodes": [[["merge_14", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_30", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_29", "inbound_nodes": [[["convolution2d_30", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_29", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "config": {"name": "activation_15", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_31", "inbound_nodes": [[["activation_15", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_31", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_30", "inbound_nodes": [[["convolution2d_31", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_30", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_15", "inbound_nodes": [[["batchnormalization_30", 0, 0], ["merge_14", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_15", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_32", "inbound_nodes": [[["merge_15", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_32", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_31", "inbound_nodes": [[["convolution2d_32", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_31", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["batchnormalization_31", 0, 0]]], "config": {"name": "activation_16", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_33", "inbound_nodes": [[["activation_16", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_33", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_32", "inbound_nodes": [[["convolution2d_33", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_32", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_16", "inbound_nodes": [[["batchnormalization_32", 0, 0], ["merge_15", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_16", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_34", "inbound_nodes": [[["merge_16", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_34", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_33", "inbound_nodes": [[["convolution2d_34", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_33", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["batchnormalization_33", 0, 0]]], "config": {"name": "activation_17", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_35", "inbound_nodes": [[["activation_17", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_35", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_34", "inbound_nodes": [[["convolution2d_35", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_34", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_17", "inbound_nodes": [[["batchnormalization_34", 0, 0], ["merge_16", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_17", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_36", "inbound_nodes": [[["merge_17", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "linear", "W_regularizer": null, "name": "convolution2d_36", "activity_regularizer": null, "nb_filter": 64, "bias": true}}, {"class_name": "BatchNormalization", "name": "batchnormalization_35", "inbound_nodes": [[["convolution2d_36", 0, 0]]], "config": {"epsilon": 0.001, "name": "batchnormalization_35", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "mode": 0}}, {"class_name": "Merge", "name": "merge_18", "inbound_nodes": [[["batchnormalization_35", 0, 0], ["convolution2d_1", 0, 0]]], "config": {"output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "output_shape_type": "raw", "name": "merge_18", "arguments": {}, "mode": "sum"}}, {"class_name": "Convolution2D", "name": "convolution2d_37", "inbound_nodes": [[["merge_18", 0, 0]]], "config": {"b_regularizer": null, "nb_col": 1, "dim_ordering": "tf", "nb_row": 1, "border_mode": "same", "trainable": true, "subsample": [1, 1], "init": "he_normal", "b_constraint": null, "W_constraint": null, "activation": "relu", "W_regularizer": null, "name": "convolution2d_37", "activity_regularizer": null, "nb_filter": 1, "bias": true}}]}}