{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50, 2], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "GaussianNoise", "config": {"trainable": true, "name": "gaussiannoise_1", "sigma": 0.0}, "name": "gaussiannoise_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_1", "activation": "relu", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_1", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_1", "gamma_regularizer": null}, "name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_3", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_2", "gamma_regularizer": null}, "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_1", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_1", "inbound_nodes": [[["batchnormalization_2", 0, 0], ["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_4", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_3", "gamma_regularizer": null}, "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_5", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_5", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_4", "gamma_regularizer": null}, "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_2", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_2", "inbound_nodes": [[["batchnormalization_4", 0, 0], ["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_6", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_6", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_5", "gamma_regularizer": null}, "name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_7", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_7", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_6", "gamma_regularizer": null}, "name": "batchnormalization_6", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_3", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_3", "inbound_nodes": [[["batchnormalization_6", 0, 0], ["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_8", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_8", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_7", "gamma_regularizer": null}, "name": "batchnormalization_7", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_9", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_9", "inbound_nodes": [[["activation_4", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_8", "gamma_regularizer": null}, "name": "batchnormalization_8", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_4", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_4", "inbound_nodes": [[["batchnormalization_8", 0, 0], ["merge_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_10", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_10", "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_9", "gamma_regularizer": null}, "name": "batchnormalization_9", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_11", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_11", "inbound_nodes": [[["activation_5", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_10", "gamma_regularizer": null}, "name": "batchnormalization_10", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_5", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_5", "inbound_nodes": [[["batchnormalization_10", 0, 0], ["merge_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_12", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_12", "inbound_nodes": [[["merge_5", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_11", "gamma_regularizer": null}, "name": "batchnormalization_11", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_13", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_13", "inbound_nodes": [[["activation_6", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_12", "gamma_regularizer": null}, "name": "batchnormalization_12", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_6", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_6", "inbound_nodes": [[["batchnormalization_12", 0, 0], ["merge_5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_14", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_14", "inbound_nodes": [[["merge_6", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_13", "gamma_regularizer": null}, "name": "batchnormalization_13", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_15", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_15", "inbound_nodes": [[["activation_7", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_14", "gamma_regularizer": null}, "name": "batchnormalization_14", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_7", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_7", "inbound_nodes": [[["batchnormalization_14", 0, 0], ["merge_6", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_16", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_16", "inbound_nodes": [[["merge_7", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_15", "gamma_regularizer": null}, "name": "batchnormalization_15", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["batchnormalization_15", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_17", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_17", "inbound_nodes": [[["activation_8", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_16", "gamma_regularizer": null}, "name": "batchnormalization_16", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_8", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_8", "inbound_nodes": [[["batchnormalization_16", 0, 0], ["merge_7", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_18", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_18", "inbound_nodes": [[["merge_8", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_17", "gamma_regularizer": null}, "name": "batchnormalization_17", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_19", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_19", "inbound_nodes": [[["activation_9", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_18", "gamma_regularizer": null}, "name": "batchnormalization_18", "inbound_nodes": [[["convolution2d_19", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_9", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_9", "inbound_nodes": [[["batchnormalization_18", 0, 0], ["merge_8", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_20", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_20", "inbound_nodes": [[["merge_9", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_19", "gamma_regularizer": null}, "name": "batchnormalization_19", "inbound_nodes": [[["convolution2d_20", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["batchnormalization_19", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_21", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_21", "inbound_nodes": [[["activation_10", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_20", "gamma_regularizer": null}, "name": "batchnormalization_20", "inbound_nodes": [[["convolution2d_21", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_10", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_10", "inbound_nodes": [[["batchnormalization_20", 0, 0], ["merge_9", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_22", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_22", "inbound_nodes": [[["merge_10", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_21", "gamma_regularizer": null}, "name": "batchnormalization_21", "inbound_nodes": [[["convolution2d_22", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batchnormalization_21", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_23", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_23", "inbound_nodes": [[["activation_11", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_22", "gamma_regularizer": null}, "name": "batchnormalization_22", "inbound_nodes": [[["convolution2d_23", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_11", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_11", "inbound_nodes": [[["batchnormalization_22", 0, 0], ["merge_10", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_24", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_24", "inbound_nodes": [[["merge_11", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_23", "gamma_regularizer": null}, "name": "batchnormalization_23", "inbound_nodes": [[["convolution2d_24", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["batchnormalization_23", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_25", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_25", "inbound_nodes": [[["activation_12", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_24", "gamma_regularizer": null}, "name": "batchnormalization_24", "inbound_nodes": [[["convolution2d_25", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_12", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_12", "inbound_nodes": [[["batchnormalization_24", 0, 0], ["merge_11", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_26", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_26", "inbound_nodes": [[["merge_12", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_25", "gamma_regularizer": null}, "name": "batchnormalization_25", "inbound_nodes": [[["convolution2d_26", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["batchnormalization_25", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_27", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_27", "inbound_nodes": [[["activation_13", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_26", "gamma_regularizer": null}, "name": "batchnormalization_26", "inbound_nodes": [[["convolution2d_27", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_13", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_13", "inbound_nodes": [[["batchnormalization_26", 0, 0], ["merge_12", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_28", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_28", "inbound_nodes": [[["merge_13", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_27", "gamma_regularizer": null}, "name": "batchnormalization_27", "inbound_nodes": [[["convolution2d_28", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["batchnormalization_27", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_29", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_29", "inbound_nodes": [[["activation_14", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_28", "gamma_regularizer": null}, "name": "batchnormalization_28", "inbound_nodes": [[["convolution2d_29", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_14", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_14", "inbound_nodes": [[["batchnormalization_28", 0, 0], ["merge_13", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_30", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_30", "inbound_nodes": [[["merge_14", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_29", "gamma_regularizer": null}, "name": "batchnormalization_29", "inbound_nodes": [[["convolution2d_30", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["batchnormalization_29", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_31", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_31", "inbound_nodes": [[["activation_15", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_30", "gamma_regularizer": null}, "name": "batchnormalization_30", "inbound_nodes": [[["convolution2d_31", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_15", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_15", "inbound_nodes": [[["batchnormalization_30", 0, 0], ["merge_14", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_32", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_32", "inbound_nodes": [[["merge_15", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_31", "gamma_regularizer": null}, "name": "batchnormalization_31", "inbound_nodes": [[["convolution2d_32", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["batchnormalization_31", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_33", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_33", "inbound_nodes": [[["activation_16", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_32", "gamma_regularizer": null}, "name": "batchnormalization_32", "inbound_nodes": [[["convolution2d_33", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_16", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_16", "inbound_nodes": [[["batchnormalization_32", 0, 0], ["merge_15", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_34", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_34", "inbound_nodes": [[["merge_16", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_33", "gamma_regularizer": null}, "name": "batchnormalization_33", "inbound_nodes": [[["convolution2d_34", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["batchnormalization_33", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_35", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_35", "inbound_nodes": [[["activation_17", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_34", "gamma_regularizer": null}, "name": "batchnormalization_34", "inbound_nodes": [[["convolution2d_35", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_17", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_17", "inbound_nodes": [[["batchnormalization_34", 0, 0], ["merge_16", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 3, "nb_filter": 64, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_36", "activation": "linear", "nb_row": 3, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_36", "inbound_nodes": [[["merge_17", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "trainable": true, "epsilon": 0.001, "axis": -1, "mode": 0, "name": "batchnormalization_35", "gamma_regularizer": null}, "name": "batchnormalization_35", "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"class_name": "Merge", "config": {"output_shape_type": "raw", "mode": "sum", "name": "merge_18", "output_mask_type": "raw", "concat_axis": -1, "output_shape": null, "mode_type": "raw", "output_mask": null, "arguments": {}, "dot_axes": -1}, "name": "merge_18", "inbound_nodes": [[["batchnormalization_35", 0, 0], ["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "same", "nb_col": 1, "nb_filter": 1, "subsample": [1, 1], "bias": true, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_37", "activation": "relu", "nb_row": 1, "init": "he_normal", "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null}, "name": "convolution2d_37", "inbound_nodes": [[["merge_18", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["convolution2d_37", 0, 0]], "name": "model_1"}, "keras_version": "1.2.0"}