____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 50, 50, 2)     0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 50, 50, 64)    1216        input_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_3[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_7[0][0]            
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_8[0][0]            
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 50, 50, 64)    36928       convolution2d_9[0][0]            
____________________________________________________________________________________________________
deconvolution2d_1 (Deconvolution (None, 50, 50, 64)    36928       convolution2d_10[0][0]           
____________________________________________________________________________________________________
deconvolution2d_2 (Deconvolution (None, 50, 50, 64)    36928       deconvolution2d_1[0][0]          
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 50, 50, 64)    0           convolution2d_9[0][0]            
                                                                   deconvolution2d_2[0][0]          
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 50, 50, 64)    0           merge_1[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_3 (Deconvolution (None, 50, 50, 64)    36928       activation_1[0][0]               
____________________________________________________________________________________________________
deconvolution2d_4 (Deconvolution (None, 50, 50, 64)    36928       deconvolution2d_3[0][0]          
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 50, 50, 64)    0           convolution2d_7[0][0]            
                                                                   deconvolution2d_4[0][0]          
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 50, 50, 64)    0           merge_2[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_5 (Deconvolution (None, 50, 50, 64)    36928       activation_2[0][0]               
____________________________________________________________________________________________________
deconvolution2d_6 (Deconvolution (None, 50, 50, 64)    36928       deconvolution2d_5[0][0]          
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 50, 50, 64)    0           convolution2d_5[0][0]            
                                                                   deconvolution2d_6[0][0]          
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 50, 50, 64)    0           merge_3[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_7 (Deconvolution (None, 50, 50, 64)    36928       activation_3[0][0]               
____________________________________________________________________________________________________
deconvolution2d_8 (Deconvolution (None, 50, 50, 64)    36928       deconvolution2d_7[0][0]          
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 50, 50, 64)    0           convolution2d_3[0][0]            
                                                                   deconvolution2d_8[0][0]          
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 50, 50, 64)    0           merge_4[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_9 (Deconvolution (None, 50, 50, 64)    36928       activation_4[0][0]               
____________________________________________________________________________________________________
deconvolution2d_10 (Deconvolutio (None, 50, 50, 64)    36928       deconvolution2d_9[0][0]          
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 50, 50, 64)    0           convolution2d_1[0][0]            
                                                                   deconvolution2d_10[0][0]         
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 50, 50, 64)    0           merge_5[0][0]                    
____________________________________________________________________________________________________
deconvolution2d_11 (Deconvolutio (None, 50, 50, 1)     65          activation_5[0][0]               
____________________________________________________________________________________________________
lambda_1 (Lambda)                (None, 50, 50, 1)     0           input_1[0][0]                    
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 50, 50, 1)     0           deconvolution2d_11[0][0]         
                                                                   lambda_1[0][0]                   
====================================================================================================
Total params: 702,913
Trainable params: 702,913
Non-trainable params: 0
____________________________________________________________________________________________________
