{"class_name": "Model", "keras_version": "1.2.0", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 50, 50, 2]}}, {"name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_1", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_2", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_3", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_6", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_7", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_8", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_9", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"dim_ordering": "tf", "init": "he_normal", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "convolution2d_10", "bias": true, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "W_regularizer": null, "trainable": true, "nb_row": 3, "W_constraint": null}}, {"name": "deconvolution2d_1", "class_name": "Deconvolution2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_1", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "deconvolution2d_2", "class_name": "Deconvolution2D", "inbound_nodes": [[["deconvolution2d_1", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_2", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["convolution2d_9", 0, 0], ["deconvolution2d_2", 0, 0]]], "config": {"output_mask": null, "name": "merge_1", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"name": "deconvolution2d_3", "class_name": "Deconvolution2D", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_3", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "deconvolution2d_4", "class_name": "Deconvolution2D", "inbound_nodes": [[["deconvolution2d_3", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_4", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["convolution2d_7", 0, 0], ["deconvolution2d_4", 0, 0]]], "config": {"output_mask": null, "name": "merge_2", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["merge_2", 0, 0]]], "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"name": "deconvolution2d_5", "class_name": "Deconvolution2D", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_5", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "deconvolution2d_6", "class_name": "Deconvolution2D", "inbound_nodes": [[["deconvolution2d_5", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_6", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["convolution2d_5", 0, 0], ["deconvolution2d_6", 0, 0]]], "config": {"output_mask": null, "name": "merge_3", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["merge_3", 0, 0]]], "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"name": "deconvolution2d_7", "class_name": "Deconvolution2D", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_7", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "deconvolution2d_8", "class_name": "Deconvolution2D", "inbound_nodes": [[["deconvolution2d_7", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_8", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["convolution2d_3", 0, 0], ["deconvolution2d_8", 0, 0]]], "config": {"output_mask": null, "name": "merge_4", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["merge_4", 0, 0]]], "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"name": "deconvolution2d_9", "class_name": "Deconvolution2D", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_9", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "deconvolution2d_10", "class_name": "Deconvolution2D", "inbound_nodes": [[["deconvolution2d_9", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "relu", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_10", "bias": true, "nb_row": 3, "b_constraint": null, "nb_filter": 64, "nb_col": 3, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 64], "W_constraint": null}}, {"name": "merge_5", "class_name": "Merge", "inbound_nodes": [[["convolution2d_1", 0, 0], ["deconvolution2d_10", 0, 0]]], "config": {"output_mask": null, "name": "merge_5", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["merge_5", 0, 0]]], "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"name": "deconvolution2d_11", "class_name": "Deconvolution2D", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "subsample": [1, 1], "name": "deconvolution2d_11", "bias": true, "nb_row": 1, "b_constraint": null, "nb_filter": 1, "nb_col": 1, "init": "he_normal", "trainable": true, "output_shape": [32, 50, 50, 1], "W_constraint": null}}, {"name": "lambda_1", "class_name": "Lambda", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"name": "lambda_1", "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s,\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000f\u0004\u0000\u0019S)\u0003N\u00e9\u0000\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\rtrainFConv.py\u00da\b<lambda>\u008a\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [50, 50, 1], "function_type": "lambda", "trainable": true, "output_shape_type": "raw"}}, {"name": "merge_6", "class_name": "Merge", "inbound_nodes": [[["deconvolution2d_11", 0, 0], ["lambda_1", 0, 0]]], "config": {"output_mask": null, "name": "merge_6", "mode_type": "raw", "dot_axes": -1, "arguments": {}, "mode": "sum", "concat_axis": -1, "output_shape_type": "raw", "output_shape": null, "output_mask_type": "raw"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["merge_6", 0, 0]]}}