{"config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 112, 4], "input_dtype": "float32", "sparse": false, "name": "stokes_input"}, "name": "stokes_input", "inbound_nodes": []}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 64, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_1", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_1", "inbound_nodes": [[["stokes_input", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 64, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_2a", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_2a", "inbound_nodes": [[["conv_1", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 64, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_2b", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_2b", "inbound_nodes": [[["conv_2a", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 64, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_2c", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_2c", "inbound_nodes": [[["conv_2b", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "stride": 2, "name": "pool_1", "border_mode": "valid"}, "name": "pool_1", "inbound_nodes": [[["conv_2c", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 128, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_3a", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_3a", "inbound_nodes": [[["pool_1", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 128, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_3b", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_3b", "inbound_nodes": [[["conv_3a", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 128, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_3c", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_3c", "inbound_nodes": [[["conv_3b", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 128, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_3d", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_3d", "inbound_nodes": [[["conv_3c", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "stride": 2, "name": "pool_2", "border_mode": "valid"}, "name": "pool_2", "inbound_nodes": [[["conv_3d", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 256, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_4a", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_4a", "inbound_nodes": [[["pool_2", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 256, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_4b", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_4b", "inbound_nodes": [[["conv_4a", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 256, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_4c", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_4c", "inbound_nodes": [[["conv_4b", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 256, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_4d", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_4d", "inbound_nodes": [[["conv_4c", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "stride": 2, "name": "pool_3", "border_mode": "valid"}, "name": "pool_3", "inbound_nodes": [[["conv_4d", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 512, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_5a", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_5a", "inbound_nodes": [[["pool_3", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 512, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_5b", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_5b", "inbound_nodes": [[["conv_5a", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 512, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_5c", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_5c", "inbound_nodes": [[["conv_5b", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"input_dim": null, "border_mode": "same", "bias": true, "filter_length": 5, "input_length": null, "nb_filter": 512, "trainable": true, "subsample_length": 1, "b_regularizer": null, "activation": "relu", "name": "conv_5d", "W_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_constraint": null, "W_regularizer": null}, "name": "conv_5d", "inbound_nodes": [[["conv_5c", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "pool_length": 2, "stride": 2, "name": "pool_4", "border_mode": "valid"}, "name": "pool_4", "inbound_nodes": [[["conv_5d", 0, 0]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flat"}, "name": "flat", "inbound_nodes": [[["pool_4", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "relu", "name": "FC2", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 200}, "name": "FC2", "inbound_nodes": [[["flat", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_T0", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_T0", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_T1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_T1", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_T2", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_T2", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_vmic", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_vmic", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_B0", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_B0", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_B1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_B1", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_v0", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_v0", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_v1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_v1", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_thB0", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_thB0", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_thB1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_thB1", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_chiB0", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_chiB0", "inbound_nodes": [[["FC2", 0, 0]]]}, {"class_name": "Dense", "config": {"W_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "b_regularizer": null, "activation": "softmax", "name": "out_chiB1", "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "output_dim": 50}, "name": "out_chiB1", "inbound_nodes": [[["FC2", 0, 0]]]}], "input_layers": [["stokes_input", 0, 0]], "name": "model_1", "output_layers": [["out_T0", 0, 0], ["out_T1", 0, 0], ["out_T2", 0, 0], ["out_vmic", 0, 0], ["out_B0", 0, 0], ["out_B1", 0, 0], ["out_v0", 0, 0], ["out_v1", 0, 0], ["out_thB0", 0, 0], ["out_thB1", 0, 0], ["out_chiB0", 0, 0], ["out_chiB1", 0, 0]]}, "keras_version": "1.1.1", "class_name": "Model"}