{"class_name": "Model", "keras_version": "1.0.7", "config": {"layers": [{"class_name": "InputLayer", "config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 128, 1]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "he_normal", "filter_length": 5, "activation": "relu", "input_dim": null, "name": "convolution1d_1", "nb_filter": 50, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_length": null, "b_constraint": null, "trainable": true, "bias": true, "subsample_length": 1}, "name": "convolution1d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_1", "pool_length": 2}, "name": "maxpooling1d_1", "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "he_normal", "filter_length": 10, "activation": "relu", "input_dim": null, "name": "convolution1d_2", "nb_filter": 50, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_length": null, "b_constraint": null, "trainable": true, "bias": true, "subsample_length": 1}, "name": "convolution1d_2", "inbound_nodes": [[["maxpooling1d_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_2", "pool_length": 2}, "name": "maxpooling1d_2", "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "he_normal", "filter_length": 15, "activation": "relu", "input_dim": null, "name": "convolution1d_3", "nb_filter": 50, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_length": null, "b_constraint": null, "trainable": true, "bias": true, "subsample_length": 1}, "name": "convolution1d_3", "inbound_nodes": [[["maxpooling1d_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_3", "pool_length": 2}, "name": "maxpooling1d_3", "inbound_nodes": [[["convolution1d_3", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "he_normal", "filter_length": 20, "activation": "relu", "input_dim": null, "name": "convolution1d_4", "nb_filter": 50, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_length": null, "b_constraint": null, "trainable": true, "bias": true, "subsample_length": 1}, "name": "convolution1d_4", "inbound_nodes": [[["maxpooling1d_3", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_4", "pool_length": 2}, "name": "maxpooling1d_4", "inbound_nodes": [[["convolution1d_4", 0, 0]]]}, {"class_name": "Convolution1D", "config": {"activity_regularizer": null, "border_mode": "same", "init": "he_normal", "filter_length": 25, "activation": "relu", "input_dim": null, "name": "convolution1d_5", "nb_filter": 50, "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "input_length": null, "b_constraint": null, "trainable": true, "bias": true, "subsample_length": 1}, "name": "convolution1d_5", "inbound_nodes": [[["maxpooling1d_4", 0, 0]]]}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_5", "pool_length": 2}, "name": "maxpooling1d_5", "inbound_nodes": [[["convolution1d_5", 0, 0]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["maxpooling1d_5", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 20, "init": "glorot_uniform", "activation": "softmax", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "input_dim": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 20, "init": "glorot_uniform", "activation": "softmax", "name": "dense_2", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "input_dim": null}, "name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 20, "init": "glorot_uniform", "activation": "softmax", "name": "dense_3", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "input_dim": null}, "name": "dense_3", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "config": {"activity_regularizer": null, "output_dim": 20, "init": "glorot_uniform", "activation": "softmax", "name": "dense_4", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "input_dim": null}, "name": "dense_4", "inbound_nodes": [[["flatten_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0]]}}