{"keras_version": "1.0.7", "config": {"output_layers": [["dense_2", 0, 0], ["dense_4", 0, 0], ["dense_6", 0, 0], ["dense_8", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 128, 1], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_1", "class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "filter_length": 5, "border_mode": "same", "init": "he_normal", "name": "convolution1d_1", "activation": "relu", "subsample_length": 1, "W_constraint": null, "nb_filter": 50, "b_constraint": null, "W_regularizer": null}}, {"inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "maxpooling1d_1", "class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_1", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "convolution1d_2", "class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "filter_length": 10, "border_mode": "same", "init": "he_normal", "name": "convolution1d_2", "activation": "relu", "subsample_length": 1, "W_constraint": null, "nb_filter": 50, "b_constraint": null, "W_regularizer": null}}, {"inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "maxpooling1d_2", "class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_2", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "convolution1d_3", "class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "filter_length": 15, "border_mode": "same", "init": "he_normal", "name": "convolution1d_3", "activation": "relu", "subsample_length": 1, "W_constraint": null, "nb_filter": 50, "b_constraint": null, "W_regularizer": null}}, {"inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "maxpooling1d_3", "class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_3", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "name": "convolution1d_4", "class_name": "Convolution1D", "config": {"input_dim": null, "bias": true, "input_length": null, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "filter_length": 20, "border_mode": "same", "init": "he_normal", "name": "convolution1d_4", "activation": "relu", "subsample_length": 1, "W_constraint": null, "nb_filter": 50, "b_constraint": null, "W_regularizer": null}}, {"inbound_nodes": [[["convolution1d_4", 0, 0]]], "name": "maxpooling1d_4", "class_name": "MaxPooling1D", "config": {"stride": 2, "trainable": true, "border_mode": "valid", "name": "maxpooling1d_4", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_4", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "activation": "relu", "input_dim": null, "W_regularizer": null, "output_dim": 400}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_3", "activation": "relu", "input_dim": null, "W_regularizer": null, "output_dim": 400}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_5", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_5", "activation": "relu", "input_dim": null, "W_regularizer": null, "output_dim": 400}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_7", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_7", "activation": "relu", "input_dim": null, "W_regularizer": null, "output_dim": 400}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "activation": "softmax", "input_dim": null, "W_regularizer": null, "output_dim": 20}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "dense_4", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_4", "activation": "softmax", "input_dim": null, "W_regularizer": null, "output_dim": 20}}, {"inbound_nodes": [[["dense_5", 0, 0]]], "name": "dense_6", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_6", "activation": "softmax", "input_dim": null, "W_regularizer": null, "output_dim": 20}}, {"inbound_nodes": [[["dense_7", 0, 0]]], "name": "dense_8", "class_name": "Dense", "config": {"b_regularizer": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "name": "dense_8", "activation": "softmax", "input_dim": null, "W_regularizer": null, "output_dim": 20}}], "name": "model_1"}, "class_name": "Model"}