{"class_name": "Model", "config": {"output_layers": [["out_tau", 0, 0], ["out_v", 0, 0], ["out_vth", 0, 0], ["out_a", 0, 0], ["out_B", 0, 0], ["out_thB", 0, 0], ["out_phiB", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SI_input", "input_dtype": "float32"}, "name": "SI_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SQ_input", "input_dtype": "float32"}, "name": "SQ_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SU_input", "input_dtype": "float32"}, "name": "SU_input"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SV_input", "input_dtype": "float32"}, "name": "SV_input"}, {"class_name": "Convolution1D", "inbound_nodes": [[["SI_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convI_1", "border_mode": "same", "b_constraint": null, "filter_length": 5, "activation": "relu"}, "name": "convI_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["SQ_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convQ_1", "border_mode": "same", "b_constraint": null, "filter_length": 5, "activation": "relu"}, "name": "convQ_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["SU_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convU_1", "border_mode": "same", "b_constraint": null, "filter_length": 5, "activation": "relu"}, "name": "convU_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["SV_input", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convV_1", "border_mode": "same", "b_constraint": null, "filter_length": 5, "activation": "relu"}, "name": "convV_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_1", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolI_1", "border_mode": "valid"}, "name": "poolI_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_1", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolQ_1", "border_mode": "valid"}, "name": "poolQ_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_1", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolU_1", "border_mode": "valid"}, "name": "poolU_1"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_1", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolV_1", "border_mode": "valid"}, "name": "poolV_1"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convI_2", "border_mode": "same", "b_constraint": null, "filter_length": 10, "activation": "relu"}, "name": "convI_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convQ_2", "border_mode": "same", "b_constraint": null, "filter_length": 10, "activation": "relu"}, "name": "convQ_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convU_2", "border_mode": "same", "b_constraint": null, "filter_length": 10, "activation": "relu"}, "name": "convU_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_1", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convV_2", "border_mode": "same", "b_constraint": null, "filter_length": 10, "activation": "relu"}, "name": "convV_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_2", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolI_2", "border_mode": "valid"}, "name": "poolI_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_2", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolQ_2", "border_mode": "valid"}, "name": "poolQ_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_2", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolU_2", "border_mode": "valid"}, "name": "poolU_2"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_2", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolV_2", "border_mode": "valid"}, "name": "poolV_2"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convI_3", "border_mode": "same", "b_constraint": null, "filter_length": 15, "activation": "relu"}, "name": "convI_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convQ_3", "border_mode": "same", "b_constraint": null, "filter_length": 15, "activation": "relu"}, "name": "convQ_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convU_3", "border_mode": "same", "b_constraint": null, "filter_length": 15, "activation": "relu"}, "name": "convU_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_2", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convV_3", "border_mode": "same", "b_constraint": null, "filter_length": 15, "activation": "relu"}, "name": "convV_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_3", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolI_3", "border_mode": "valid"}, "name": "poolI_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_3", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolQ_3", "border_mode": "valid"}, "name": "poolQ_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_3", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolU_3", "border_mode": "valid"}, "name": "poolU_3"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_3", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolV_3", "border_mode": "valid"}, "name": "poolV_3"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convI_4", "border_mode": "same", "b_constraint": null, "filter_length": 20, "activation": "relu"}, "name": "convI_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convQ_4", "border_mode": "same", "b_constraint": null, "filter_length": 20, "activation": "relu"}, "name": "convQ_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convU_4", "border_mode": "same", "b_constraint": null, "filter_length": 20, "activation": "relu"}, "name": "convU_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_3", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convV_4", "border_mode": "same", "b_constraint": null, "filter_length": 20, "activation": "relu"}, "name": "convV_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_4", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolI_4", "border_mode": "valid"}, "name": "poolI_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_4", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolQ_4", "border_mode": "valid"}, "name": "poolQ_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_4", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolU_4", "border_mode": "valid"}, "name": "poolU_4"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_4", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolV_4", "border_mode": "valid"}, "name": "poolV_4"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolI_4", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convI_5", "border_mode": "same", "b_constraint": null, "filter_length": 25, "activation": "relu"}, "name": "convI_5"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolQ_4", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convQ_5", "border_mode": "same", "b_constraint": null, "filter_length": 25, "activation": "relu"}, "name": "convQ_5"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolU_4", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convU_5", "border_mode": "same", "b_constraint": null, "filter_length": 25, "activation": "relu"}, "name": "convU_5"}, {"class_name": "Convolution1D", "inbound_nodes": [[["poolV_4", 0, 0]]], "config": {"W_regularizer": null, "subsample_length": 1, "input_dim": null, "b_regularizer": null, "trainable": true, "bias": true, "input_length": null, "init": "he_normal", "activity_regularizer": null, "W_constraint": null, "nb_filter": 50, "name": "convV_5", "border_mode": "same", "b_constraint": null, "filter_length": 25, "activation": "relu"}, "name": "convV_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convI_5", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolI_5", "border_mode": "valid"}, "name": "poolI_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convQ_5", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolQ_5", "border_mode": "valid"}, "name": "poolQ_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convU_5", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolU_5", "border_mode": "valid"}, "name": "poolU_5"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["convV_5", 0, 0]]], "config": {"stride": 2, "trainable": true, "pool_length": 2, "name": "poolV_5", "border_mode": "valid"}, "name": "poolV_5"}, {"class_name": "Flatten", "inbound_nodes": [[["poolI_5", 0, 0]]], "config": {"name": "flatI", "trainable": true}, "name": "flatI"}, {"class_name": "Flatten", "inbound_nodes": [[["poolQ_5", 0, 0]]], "config": {"name": "flatQ", "trainable": true}, "name": "flatQ"}, {"class_name": "Flatten", "inbound_nodes": [[["poolU_5", 0, 0]]], "config": {"name": "flatU", "trainable": true}, "name": "flatU"}, {"class_name": "Flatten", "inbound_nodes": [[["poolV_5", 0, 0]]], "config": {"name": "flatV", "trainable": true}, "name": "flatV"}, {"class_name": "Merge", "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "config": {"mode": "concat", "output_shape": null, "name": "FC", "dot_axes": [-1, -1], "mode_type": "raw", "output_shape_type": "raw", "concat_axis": -1}, "name": "FC"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 90, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "FC_B", "trainable": true, "init": "glorot_uniform", "activation": "relu"}, "name": "FC_B"}, {"class_name": "Dense", "inbound_nodes": [[["FC", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 90, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "FC_tau", "trainable": true, "init": "glorot_uniform", "activation": "relu"}, "name": "FC_tau"}, {"class_name": "Dense", "inbound_nodes": [[["FC_B", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_B", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_B"}, {"class_name": "Dense", "inbound_nodes": [[["FC_tau", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_a", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_a"}, {"class_name": "Dense", "inbound_nodes": [[["FC_B", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_phiB", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_phiB"}, {"class_name": "Dense", "inbound_nodes": [[["FC_tau", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_tau", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_tau"}, {"class_name": "Dense", "inbound_nodes": [[["FC_B", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_thB", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_thB"}, {"class_name": "Dense", "inbound_nodes": [[["FC_tau", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_v", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_v"}, {"class_name": "Dense", "inbound_nodes": [[["FC_tau", 0, 0]]], "config": {"W_regularizer": null, "input_dim": null, "b_regularizer": null, "bias": true, "output_dim": 30, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "out_vth", "trainable": true, "init": "glorot_uniform", "activation": "softmax"}, "name": "out_vth"}], "name": "model_1", "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]]}, "keras_version": "1.0.7"}