{"keras_version": "1.0.7", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "input_2"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "input_3"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_4", "config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "input_4"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_1", "config": {"input_dim": null, "name": "convolution1d_1", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 5, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["input_3", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_11", "config": {"input_dim": null, "name": "convolution1d_11", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 5, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["input_4", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_16", "config": {"input_dim": null, "name": "convolution1d_16", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 5, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["input_2", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_6", "config": {"input_dim": null, "name": "convolution1d_6", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 5, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["convolution1d_1", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_1", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_1", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_11", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_11", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_11", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_16", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_16", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_16", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_6", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_6", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_6", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_11", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_12", "config": {"input_dim": null, "name": "convolution1d_12", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 10, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_16", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_17", "config": {"input_dim": null, "name": "convolution1d_17", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 10, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_2", "config": {"input_dim": null, "name": "convolution1d_2", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 10, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_6", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_7", "config": {"input_dim": null, "name": "convolution1d_7", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 10, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["convolution1d_12", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_12", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_12", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_17", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_17", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_17", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_2", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_2", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_2", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_7", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_7", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_7", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_12", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_13", "config": {"input_dim": null, "name": "convolution1d_13", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 15, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_17", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_18", "config": {"input_dim": null, "name": "convolution1d_18", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 15, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_3", "config": {"input_dim": null, "name": "convolution1d_3", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 15, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_7", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_8", "config": {"input_dim": null, "name": "convolution1d_8", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 15, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["convolution1d_13", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_13", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_13", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_18", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_18", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_18", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_3", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_3", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_3", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_8", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_8", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_8", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_13", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_14", "config": {"input_dim": null, "name": "convolution1d_14", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 20, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_18", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_19", "config": {"input_dim": null, "name": "convolution1d_19", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 20, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_4", "config": {"input_dim": null, "name": "convolution1d_4", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 20, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_8", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_9", "config": {"input_dim": null, "name": "convolution1d_9", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 20, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["convolution1d_14", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_14", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_14", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_19", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_19", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_19", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_4", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_4", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_4", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_9", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_9", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_9", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_9", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_10", "config": {"input_dim": null, "name": "convolution1d_10", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 25, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_14", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_15", "config": {"input_dim": null, "name": "convolution1d_15", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 25, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_19", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_20", "config": {"input_dim": null, "name": "convolution1d_20", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 25, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["maxpooling1d_4", 0, 0]]], "class_name": "Convolution1D", "name": "convolution1d_5", "config": {"input_dim": null, "name": "convolution1d_5", "W_regularizer": null, "activation": "relu", "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "nb_filter": 50, "W_constraint": null, "trainable": true, "bias": true, "filter_length": 25, "input_length": null, "b_regularizer": null, "b_constraint": null, "subsample_length": 1}}, {"inbound_nodes": [[["convolution1d_10", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_10", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_10", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_15", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_15", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_15", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_20", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_20", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_20", "pool_length": 2}}, {"inbound_nodes": [[["convolution1d_5", 0, 0]]], "class_name": "MaxPooling1D", "name": "maxpooling1d_5", "config": {"border_mode": "valid", "stride": 2, "trainable": true, "name": "maxpooling1d_5", "pool_length": 2}}, {"inbound_nodes": [[["maxpooling1d_5", 0, 0]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["maxpooling1d_10", 0, 0]]], "class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}}, {"inbound_nodes": [[["maxpooling1d_15", 0, 0]]], "class_name": "Flatten", "name": "flatten_3", "config": {"trainable": true, "name": "flatten_3"}}, {"inbound_nodes": [[["maxpooling1d_20", 0, 0]]], "class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4"}}, {"inbound_nodes": [[["flatten_1", 0, 0], ["flatten_2", 0, 0], ["flatten_3", 0, 0], ["flatten_4", 0, 0]]], "class_name": "Merge", "name": "merge_1", "config": {"mode_type": "raw", "mode": "concat", "name": "merge_1", "concat_axis": -1, "output_shape": null, "output_shape_type": "raw", "dot_axes": [-1, -1]}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_3", "config": {"name": "dense_3", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_4", "config": {"name": "dense_4", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_5", "config": {"name": "dense_5", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_6", "config": {"name": "dense_6", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Dense", "name": "dense_7", "config": {"name": "dense_7", "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 20, "bias": true, "b_regularizer": null, "b_constraint": null}}], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0], ["dense_3", 0, 0], ["dense_4", 0, 0], ["dense_5", 0, 0], ["dense_6", 0, 0], ["dense_7", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]]}}