{"config": {"name": "model_1", "output_layers": [["out_tau", 0, 0], ["out_v", 0, 0], ["out_vth", 0, 0], ["out_a", 0, 0], ["out_B", 0, 0], ["out_thB", 0, 0], ["out_phiB", 0, 0]], "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0]], "layers": [{"name": "SI_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SI_input", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"name": "SQ_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SQ_input", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"name": "SU_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SU_input", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"name": "SV_input", "inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 1], "name": "SV_input", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"name": "convI_1", "inbound_nodes": [[["SI_input", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convI_1", "input_dim": null, "subsample_length": 1, "filter_length": 5, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convQ_1", "inbound_nodes": [[["SQ_input", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convQ_1", "input_dim": null, "subsample_length": 1, "filter_length": 5, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convU_1", "inbound_nodes": [[["SU_input", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convU_1", "input_dim": null, "subsample_length": 1, "filter_length": 5, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convV_1", "inbound_nodes": [[["SV_input", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convV_1", "input_dim": null, "subsample_length": 1, "filter_length": 5, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "poolI_1", "inbound_nodes": [[["convI_1", 0, 0]]], "config": {"name": "poolI_1", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolQ_1", "inbound_nodes": [[["convQ_1", 0, 0]]], "config": {"name": "poolQ_1", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolU_1", "inbound_nodes": [[["convU_1", 0, 0]]], "config": {"name": "poolU_1", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolV_1", "inbound_nodes": [[["convV_1", 0, 0]]], "config": {"name": "poolV_1", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "convI_2", "inbound_nodes": [[["poolI_1", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convI_2", "input_dim": null, "subsample_length": 1, "filter_length": 10, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convQ_2", "inbound_nodes": [[["poolQ_1", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convQ_2", "input_dim": null, "subsample_length": 1, "filter_length": 10, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convU_2", "inbound_nodes": [[["poolU_1", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convU_2", "input_dim": null, "subsample_length": 1, "filter_length": 10, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convV_2", "inbound_nodes": [[["poolV_1", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convV_2", "input_dim": null, "subsample_length": 1, "filter_length": 10, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "poolI_2", "inbound_nodes": [[["convI_2", 0, 0]]], "config": {"name": "poolI_2", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolQ_2", "inbound_nodes": [[["convQ_2", 0, 0]]], "config": {"name": "poolQ_2", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolU_2", "inbound_nodes": [[["convU_2", 0, 0]]], "config": {"name": "poolU_2", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolV_2", "inbound_nodes": [[["convV_2", 0, 0]]], "config": {"name": "poolV_2", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "convI_3", "inbound_nodes": [[["poolI_2", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convI_3", "input_dim": null, "subsample_length": 1, "filter_length": 15, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convQ_3", "inbound_nodes": [[["poolQ_2", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convQ_3", "input_dim": null, "subsample_length": 1, "filter_length": 15, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convU_3", "inbound_nodes": [[["poolU_2", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convU_3", "input_dim": null, "subsample_length": 1, "filter_length": 15, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convV_3", "inbound_nodes": [[["poolV_2", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convV_3", "input_dim": null, "subsample_length": 1, "filter_length": 15, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "poolI_3", "inbound_nodes": [[["convI_3", 0, 0]]], "config": {"name": "poolI_3", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolQ_3", "inbound_nodes": [[["convQ_3", 0, 0]]], "config": {"name": "poolQ_3", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolU_3", "inbound_nodes": [[["convU_3", 0, 0]]], "config": {"name": "poolU_3", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolV_3", "inbound_nodes": [[["convV_3", 0, 0]]], "config": {"name": "poolV_3", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "convI_4", "inbound_nodes": [[["poolI_3", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convI_4", "input_dim": null, "subsample_length": 1, "filter_length": 20, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convQ_4", "inbound_nodes": [[["poolQ_3", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convQ_4", "input_dim": null, "subsample_length": 1, "filter_length": 20, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convU_4", "inbound_nodes": [[["poolU_3", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convU_4", "input_dim": null, "subsample_length": 1, "filter_length": 20, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convV_4", "inbound_nodes": [[["poolV_3", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convV_4", "input_dim": null, "subsample_length": 1, "filter_length": 20, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "poolI_4", "inbound_nodes": [[["convI_4", 0, 0]]], "config": {"name": "poolI_4", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolQ_4", "inbound_nodes": [[["convQ_4", 0, 0]]], "config": {"name": "poolQ_4", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolU_4", "inbound_nodes": [[["convU_4", 0, 0]]], "config": {"name": "poolU_4", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolV_4", "inbound_nodes": [[["convV_4", 0, 0]]], "config": {"name": "poolV_4", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "convI_5", "inbound_nodes": [[["poolI_4", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convI_5", "input_dim": null, "subsample_length": 1, "filter_length": 25, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convQ_5", "inbound_nodes": [[["poolQ_4", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convQ_5", "input_dim": null, "subsample_length": 1, "filter_length": 25, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convU_5", "inbound_nodes": [[["poolU_4", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convU_5", "input_dim": null, "subsample_length": 1, "filter_length": 25, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "convV_5", "inbound_nodes": [[["poolV_4", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "activation": "relu", "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 50, "trainable": true, "name": "convV_5", "input_dim": null, "subsample_length": 1, "filter_length": 25, "input_length": null, "init": "he_normal", "W_constraint": null}, "class_name": "Convolution1D"}, {"name": "poolI_5", "inbound_nodes": [[["convI_5", 0, 0]]], "config": {"name": "poolI_5", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolQ_5", "inbound_nodes": [[["convQ_5", 0, 0]]], "config": {"name": "poolQ_5", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolU_5", "inbound_nodes": [[["convU_5", 0, 0]]], "config": {"name": "poolU_5", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "poolV_5", "inbound_nodes": [[["convV_5", 0, 0]]], "config": {"name": "poolV_5", "pool_length": 2, "trainable": true, "stride": 2, "border_mode": "valid"}, "class_name": "MaxPooling1D"}, {"name": "flatI", "inbound_nodes": [[["poolI_5", 0, 0]]], "config": {"name": "flatI", "trainable": true}, "class_name": "Flatten"}, {"name": "flatQ", "inbound_nodes": [[["poolQ_5", 0, 0]]], "config": {"name": "flatQ", "trainable": true}, "class_name": "Flatten"}, {"name": "flatU", "inbound_nodes": [[["poolU_5", 0, 0]]], "config": {"name": "flatU", "trainable": true}, "class_name": "Flatten"}, {"name": "flatV", "inbound_nodes": [[["poolV_5", 0, 0]]], "config": {"name": "flatV", "trainable": true}, "class_name": "Flatten"}, {"name": "FC", "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0]]], "config": {"name": "FC", "dot_axes": [-1, -1], "concat_axis": -1, "output_shape_type": "raw", "mode": "concat", "mode_type": "raw", "output_shape": null}, "class_name": "Merge"}, {"name": "FC_B", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "FC_B", "input_dim": null, "output_dim": 50, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "FC_a", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "FC_a", "input_dim": null, "output_dim": 50, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "FC_tau", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "FC_tau", "input_dim": null, "output_dim": 50, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "FC_thB", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "FC_thB", "input_dim": null, "output_dim": 50, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "FC_v", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "FC_v", "input_dim": null, "output_dim": 50, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "FC_vth", "inbound_nodes": [[["FC", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "FC_vth", "input_dim": null, "output_dim": 50, "activation": "relu", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_B", "inbound_nodes": [[["FC_B", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_B", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_a", "inbound_nodes": [[["FC_a", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_a", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_phiB", "inbound_nodes": [[["FC_thB", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_phiB", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_tau", "inbound_nodes": [[["FC_tau", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_tau", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_thB", "inbound_nodes": [[["FC_thB", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_thB", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_v", "inbound_nodes": [[["FC_v", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_v", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"name": "out_vth", "inbound_nodes": [[["FC_vth", 0, 0]]], "config": {"b_constraint": null, "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "trainable": true, "name": "out_vth", "input_dim": null, "output_dim": 20, "activation": "softmax", "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}]}, "keras_version": "1.0.7", "class_name": "Model"}