____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
stokes_input (InputLayer)        (None, 128, 4)        0                                            
____________________________________________________________________________________________________
conv_1 (Conv1D)                  (None, 128, 64)       832         stokes_input[0][0]               
____________________________________________________________________________________________________
conv1d_2 (Conv1D)                (None, 64, 64)        12352       conv_1[0][0]                     
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 64, 64)        256         conv1d_2[0][0]                   
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 64)        0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
conv1d_3 (Conv1D)                (None, 64, 64)        12352       activation_1[0][0]               
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 64, 64)        4160        conv_1[0][0]                     
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 64, 64)        256         conv1d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 64, 64)        0           conv1d_1[0][0]                   
                                                                   batch_normalization_2[0][0]      
____________________________________________________________________________________________________
conv1d_5 (Conv1D)                (None, 32, 64)        12352       add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 32, 64)        256         conv1d_5[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 32, 64)        0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
conv1d_6 (Conv1D)                (None, 32, 64)        12352       activation_2[0][0]               
____________________________________________________________________________________________________
conv1d_4 (Conv1D)                (None, 32, 64)        4160        add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 32, 64)        256         conv1d_6[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 32, 64)        0           conv1d_4[0][0]                   
                                                                   batch_normalization_4[0][0]      
____________________________________________________________________________________________________
conv1d_8 (Conv1D)                (None, 16, 64)        12352       add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 16, 64)        256         conv1d_8[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 16, 64)        0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
conv1d_9 (Conv1D)                (None, 16, 64)        12352       activation_3[0][0]               
____________________________________________________________________________________________________
conv1d_7 (Conv1D)                (None, 16, 64)        4160        add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 16, 64)        256         conv1d_9[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 16, 64)        0           conv1d_7[0][0]                   
                                                                   batch_normalization_6[0][0]      
____________________________________________________________________________________________________
conv1d_11 (Conv1D)               (None, 8, 64)         12352       add_3[0][0]                      
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 8, 64)         256         conv1d_11[0][0]                  
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 8, 64)         0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
conv1d_12 (Conv1D)               (None, 8, 64)         12352       activation_4[0][0]               
____________________________________________________________________________________________________
conv1d_10 (Conv1D)               (None, 8, 64)         4160        add_3[0][0]                      
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 8, 64)         256         conv1d_12[0][0]                  
____________________________________________________________________________________________________
add_4 (Add)                      (None, 8, 64)         0           conv1d_10[0][0]                  
                                                                   batch_normalization_8[0][0]      
____________________________________________________________________________________________________
conv1d_14 (Conv1D)               (None, 4, 64)         12352       add_4[0][0]                      
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 4, 64)         256         conv1d_14[0][0]                  
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 4, 64)         0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
conv1d_15 (Conv1D)               (None, 4, 64)         12352       activation_5[0][0]               
____________________________________________________________________________________________________
conv1d_13 (Conv1D)               (None, 4, 64)         4160        add_4[0][0]                      
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 4, 64)         256         conv1d_15[0][0]                  
____________________________________________________________________________________________________
add_5 (Add)                      (None, 4, 64)         0           conv1d_13[0][0]                  
                                                                   batch_normalization_10[0][0]     
____________________________________________________________________________________________________
flat (Flatten)                   (None, 256)           0           add_5[0][0]                      
____________________________________________________________________________________________________
mu_input (InputLayer)            (None, 1)             0                                            
____________________________________________________________________________________________________
FC (Concatenate)                 (None, 257)           0           flat[0][0]                       
                                                                   mu_input[0][0]                   
____________________________________________________________________________________________________
y_true (InputLayer)              (None, 1)             0                                            
____________________________________________________________________________________________________
weights (Dense)                  (None, 150)           38700       FC[0][0]                         
____________________________________________________________________________________________________
loss (Lambda)                    (None, 1)             0           y_true[0][0]                     
                                                                   weights[0][0]                    
====================================================================================================
Total params: 186,412
Trainable params: 185,132
Non-trainable params: 1,280
____________________________________________________________________________________________________
