{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "Convolution1D", "config": {"b_regularizer": null, "subsample_length": 1, "border_mode": "same", "batch_input_shape": [null, 128, 1], "W_regularizer": null, "activation": "relu", "name": "convolution1d_1", "input_dtype": "float32", "filter_length": 5, "b_constraint": null, "input_dim": null, "nb_filter": 50, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_length": null, "init": "he_normal", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 2, "stride": 2, "name": "maxpooling1d_1", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_regularizer": null, "subsample_length": 1, "border_mode": "same", "batch_input_shape": [null, 128, 1], "W_regularizer": null, "activation": "relu", "name": "convolution1d_2", "input_dtype": "float32", "filter_length": 5, "b_constraint": null, "input_dim": null, "nb_filter": 100, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_length": null, "init": "he_normal", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 2, "stride": 2, "name": "maxpooling1d_2", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_regularizer": null, "subsample_length": 1, "border_mode": "same", "batch_input_shape": [null, 128, 1], "W_regularizer": null, "activation": "relu", "name": "convolution1d_3", "input_dtype": "float32", "filter_length": 5, "b_constraint": null, "input_dim": null, "nb_filter": 150, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_length": null, "init": "he_normal", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 2, "stride": 2, "name": "maxpooling1d_3", "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution1D", "config": {"b_regularizer": null, "subsample_length": 1, "border_mode": "same", "batch_input_shape": [null, 128, 1], "W_regularizer": null, "activation": "relu", "name": "convolution1d_4", "input_dtype": "float32", "filter_length": 5, "b_constraint": null, "input_dim": null, "nb_filter": 200, "activity_regularizer": null, "W_constraint": null, "trainable": true, "input_length": null, "init": "he_normal", "bias": true}}, {"class_name": "MaxPooling1D", "config": {"pool_length": 2, "stride": 2, "name": "maxpooling1d_4", "border_mode": "valid", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 500, "W_regularizer": null, "activation": "relu", "name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 20, "W_regularizer": null, "activation": "softmax", "name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "input_dim": null, "W_constraint": null, "bias": true}}]}