{"config": [{"class_name": "Convolution1D", "config": {"input_length": null, "batch_input_shape": [null, 128, 1], "b_constraint": null, "nb_filter": 50, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "input_dtype": "float32", "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "activation": "relu", "name": "convolution1d_1", "init": "uniform"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1", "pool_length": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "b_constraint": null, "W_constraint": null, "nb_filter": 100, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "init": "uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution1d_2"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_2", "pool_length": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "b_constraint": null, "W_constraint": null, "nb_filter": 150, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "init": "uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution1d_3"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_3", "pool_length": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "b_constraint": null, "W_constraint": null, "nb_filter": 200, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "init": "uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution1d_4"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_4", "pool_length": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "b_constraint": null, "W_constraint": null, "nb_filter": 250, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "init": "uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution1d_5"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_5", "pool_length": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "b_constraint": null, "W_constraint": null, "nb_filter": 300, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "init": "uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution1d_6"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_6", "pool_length": 2}}, {"class_name": "Convolution1D", "config": {"input_length": null, "b_constraint": null, "W_constraint": null, "nb_filter": 350, "bias": true, "input_dim": null, "subsample_length": 1, "activity_regularizer": null, "border_mode": "same", "filter_length": 5, "init": "uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "convolution1d_7"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_7", "pool_length": 2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "bias": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "relu", "name": "dense_1"}}, {"class_name": "Dense", "config": {"output_dim": 20, "W_constraint": null, "bias": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "W_regularizer": null, "activation": "softmax", "name": "dense_2"}}], "class_name": "Sequential"}