{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "Convolution1D", "config": {"input_dtype": "float32", "name": "convolution1d_1", "batch_input_shape": [null, 128, 1], "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "W_regularizer": null, "init": "he_normal", "input_length": null, "b_regularizer": null, "input_dim": null, "nb_filter": 50, "trainable": true, "activation": "relu", "filter_length": 5, "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_1", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_2", "filter_length": 5, "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "init": "he_normal", "W_regularizer": null, "nb_filter": 100, "input_length": null, "b_regularizer": null, "input_dim": null, "trainable": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_2", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_3", "filter_length": 5, "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "init": "he_normal", "W_regularizer": null, "nb_filter": 150, "input_length": null, "b_regularizer": null, "input_dim": null, "trainable": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_3", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_4", "filter_length": 5, "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "init": "he_normal", "W_regularizer": null, "nb_filter": 200, "input_length": null, "b_regularizer": null, "input_dim": null, "trainable": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_4", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_5", "filter_length": 5, "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "init": "he_normal", "W_regularizer": null, "nb_filter": 250, "input_length": null, "b_regularizer": null, "input_dim": null, "trainable": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_5", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_6", "filter_length": 5, "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "init": "he_normal", "W_regularizer": null, "nb_filter": 300, "input_length": null, "b_regularizer": null, "input_dim": null, "trainable": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_6", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Convolution1D", "config": {"name": "convolution1d_7", "filter_length": 5, "border_mode": "same", "b_constraint": null, "subsample_length": 1, "bias": true, "W_constraint": null, "init": "he_normal", "W_regularizer": null, "nb_filter": 350, "input_length": null, "b_regularizer": null, "input_dim": null, "trainable": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "MaxPooling1D", "config": {"name": "maxpooling1d_7", "pool_length": 2, "border_mode": "valid", "trainable": true, "stride": 2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "output_dim": 200, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "relu", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "output_dim": 20, "input_dim": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "softmax", "activity_regularizer": null}}]}