{"keras_version": "1.2.0", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 50, 50, 2], "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_1", "nb_row": 3, "activation": "relu", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_2", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_1", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_1", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_3", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_2", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_2", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_2", 0, 0], ["convolution2d_1", 0, 0]]], "class_name": "Merge", "name": "merge_1", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_1", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_4", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_3", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_3", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_5", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_4", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_4", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_4", 0, 0], ["merge_1", 0, 0]]], "class_name": "Merge", "name": "merge_2", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_2", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_6", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_6", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_5", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_5", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_7", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_7", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_6", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_6", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_6", 0, 0], ["merge_2", 0, 0]]], "class_name": "Merge", "name": "merge_3", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_3", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_8", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_8", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_7", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_7", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_7", 0, 0]]], "class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_9", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_9", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_8", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_8", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_8", 0, 0], ["merge_3", 0, 0]]], "class_name": "Merge", "name": "merge_4", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_4", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_10", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_10", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_9", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_9", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_9", 0, 0]]], "class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"inbound_nodes": [[["activation_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_11", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_11", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_10", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_10", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_10", 0, 0], ["merge_4", 0, 0]]], "class_name": "Merge", "name": "merge_5", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_5", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_12", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_12", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_12", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_11", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_11", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_11", 0, 0]]], "class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"inbound_nodes": [[["activation_6", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_13", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_13", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_12", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_12", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_12", 0, 0], ["merge_5", 0, 0]]], "class_name": "Merge", "name": "merge_6", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_6", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_6", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_14", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_14", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_13", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_13", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_13", 0, 0]]], "class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"inbound_nodes": [[["activation_7", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_15", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_15", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_14", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_14", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_14", 0, 0], ["merge_6", 0, 0]]], "class_name": "Merge", "name": "merge_7", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_7", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_7", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_16", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_16", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_15", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_15", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_15", 0, 0]]], "class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"inbound_nodes": [[["activation_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_17", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_17", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_17", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_16", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_16", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_16", 0, 0], ["merge_7", 0, 0]]], "class_name": "Merge", "name": "merge_8", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_8", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_18", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_18", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_18", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_17", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_17", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_17", 0, 0]]], "class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"inbound_nodes": [[["activation_9", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_19", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_19", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_19", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_18", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_18", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_18", 0, 0], ["merge_8", 0, 0]]], "class_name": "Merge", "name": "merge_9", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_9", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_9", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_20", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_20", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_20", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_19", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_19", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_19", 0, 0]]], "class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"inbound_nodes": [[["activation_10", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_21", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_21", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_21", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_20", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_20", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_20", 0, 0], ["merge_9", 0, 0]]], "class_name": "Merge", "name": "merge_10", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_10", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_10", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_22", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_22", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_22", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_21", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_21", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_21", 0, 0]]], "class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"inbound_nodes": [[["activation_11", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_23", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_23", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_23", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_22", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_22", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_22", 0, 0], ["merge_10", 0, 0]]], "class_name": "Merge", "name": "merge_11", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_11", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_11", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_24", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_24", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_24", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_23", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_23", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_23", 0, 0]]], "class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"inbound_nodes": [[["activation_12", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_25", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_25", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_25", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_24", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_24", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_24", 0, 0], ["merge_11", 0, 0]]], "class_name": "Merge", "name": "merge_12", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_12", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_12", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_26", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_26", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_26", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_25", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_25", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_25", 0, 0]]], "class_name": "Activation", "name": "activation_13", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"inbound_nodes": [[["activation_13", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_27", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_27", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_27", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_26", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_26", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_26", 0, 0], ["merge_12", 0, 0]]], "class_name": "Merge", "name": "merge_13", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_13", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_13", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_28", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_28", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_28", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_27", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_27", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_27", 0, 0]]], "class_name": "Activation", "name": "activation_14", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"inbound_nodes": [[["activation_14", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_29", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_29", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_29", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_28", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_28", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_28", 0, 0], ["merge_13", 0, 0]]], "class_name": "Merge", "name": "merge_14", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_14", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_14", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_30", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_30", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_30", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_29", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_29", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_29", 0, 0]]], "class_name": "Activation", "name": "activation_15", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"inbound_nodes": [[["activation_15", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_31", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_31", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_31", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_30", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_30", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_30", 0, 0], ["merge_14", 0, 0]]], "class_name": "Merge", "name": "merge_15", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_15", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_15", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_32", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_32", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_32", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_31", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_31", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_31", 0, 0]]], "class_name": "Activation", "name": "activation_16", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"inbound_nodes": [[["activation_16", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_33", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_33", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_33", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_32", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_32", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_32", 0, 0], ["merge_15", 0, 0]]], "class_name": "Merge", "name": "merge_16", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_16", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_16", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_34", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_34", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_34", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_33", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_33", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_33", 0, 0]]], "class_name": "Activation", "name": "activation_17", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"inbound_nodes": [[["activation_17", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_35", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_35", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_35", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_34", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_34", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_34", 0, 0], ["merge_16", 0, 0]]], "class_name": "Merge", "name": "merge_17", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_17", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_17", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_36", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_36", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_36", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_35", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_35", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_35", 0, 0]]], "class_name": "Activation", "name": "activation_18", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}}, {"inbound_nodes": [[["activation_18", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_37", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_37", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_37", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_36", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_36", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_36", 0, 0], ["merge_17", 0, 0]]], "class_name": "Merge", "name": "merge_18", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_18", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_18", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_38", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_38", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_38", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_37", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_37", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_37", 0, 0]]], "class_name": "Activation", "name": "activation_19", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}}, {"inbound_nodes": [[["activation_19", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_39", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_39", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_39", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_38", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_38", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_38", 0, 0], ["merge_18", 0, 0]]], "class_name": "Merge", "name": "merge_19", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_19", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_19", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_40", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_40", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_40", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_39", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_39", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_39", 0, 0]]], "class_name": "Activation", "name": "activation_20", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}}, {"inbound_nodes": [[["activation_20", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_41", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_41", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_41", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_40", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_40", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_40", 0, 0], ["merge_19", 0, 0]]], "class_name": "Merge", "name": "merge_20", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_20", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_20", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_42", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_42", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_42", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_41", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_41", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_41", 0, 0]]], "class_name": "Activation", "name": "activation_21", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"inbound_nodes": [[["activation_21", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_43", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_43", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_43", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_42", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_42", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_42", 0, 0], ["merge_20", 0, 0]]], "class_name": "Merge", "name": "merge_21", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_21", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_21", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_44", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 3, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 64, "name": "convolution2d_44", "nb_row": 3, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}, {"inbound_nodes": [[["convolution2d_44", 0, 0]]], "class_name": "BatchNormalization", "name": "batchnormalization_43", "config": {"epsilon": 0.001, "trainable": true, "momentum": 0.99, "mode": 0, "gamma_regularizer": null, "beta_regularizer": null, "name": "batchnormalization_43", "axis": -1}}, {"inbound_nodes": [[["batchnormalization_43", 0, 0], ["convolution2d_1", 0, 0]]], "class_name": "Merge", "name": "merge_22", "config": {"output_mask": null, "dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "name": "merge_22", "mode": "sum", "output_shape": null, "output_mask_type": "raw", "concat_axis": -1, "mode_type": "raw"}}, {"inbound_nodes": [[["merge_22", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_45", "config": {"b_regularizer": null, "dim_ordering": "tf", "nb_col": 1, "b_constraint": null, "W_regularizer": null, "border_mode": "same", "init": "he_normal", "nb_filter": 6, "name": "convolution2d_45", "nb_row": 1, "activation": "linear", "subsample": [1, 1], "bias": true, "W_constraint": null, "activity_regularizer": null, "trainable": true}}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["convolution2d_45", 0, 0]]}}