{"class_name": "Model", "config": {"name": "model_1", "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 50, 50, 2], "input_dtype": "float32", "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_1", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_1", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution2d_2", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_2", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_2", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0]]], "name": "convolution2d_3", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_3", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0], ["convolution2d_1", 0, 0]]], "name": "merge_1", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_1", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "batchnormalization_3", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_3", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_3", 0, 0]]], "name": "convolution2d_4", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_4", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_4", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution2d_5", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_5", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_5", 0, 0], ["merge_1", 0, 0]]], "name": "merge_2", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_2", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_2", 0, 0]]], "name": "batchnormalization_5", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_5", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0]]], "name": "convolution2d_6", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_6", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "batchnormalization_6", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_6", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0]]], "name": "convolution2d_7", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_7", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_7", 0, 0], ["merge_2", 0, 0]]], "name": "merge_3", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_3", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_3", 0, 0]]], "name": "batchnormalization_7", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_7", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "activation_7", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_7", 0, 0]]], "name": "convolution2d_8", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_8", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "batchnormalization_8", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_8", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_8", 0, 0]]], "name": "activation_8", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_8", 0, 0]]], "name": "convolution2d_9", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_9", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_9", 0, 0], ["merge_3", 0, 0]]], "name": "merge_4", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_4", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_4", 0, 0]]], "name": "batchnormalization_9", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_9", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "activation_9", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_9", 0, 0]]], "name": "convolution2d_10", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_10", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "batchnormalization_10", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_10", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "activation_10", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_10", 0, 0]]], "name": "convolution2d_11", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_11", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_11", 0, 0], ["merge_4", 0, 0]]], "name": "merge_5", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_5", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_5", 0, 0]]], "name": "batchnormalization_11", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_11", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_11", 0, 0]]], "name": "activation_11", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_11", 0, 0]]], "name": "convolution2d_12", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_12", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "batchnormalization_12", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_12", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_12", 0, 0]]], "name": "activation_12", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_12", 0, 0]]], "name": "convolution2d_13", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_13", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_13", 0, 0], ["merge_5", 0, 0]]], "name": "merge_6", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_6", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_6", 0, 0]]], "name": "batchnormalization_13", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_13", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_13", 0, 0]]], "name": "activation_13", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0]]], "name": "convolution2d_14", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_14", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "batchnormalization_14", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_14", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_14", 0, 0]]], "name": "activation_14", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_14", 0, 0]]], "name": "convolution2d_15", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_15", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_15", 0, 0], ["merge_6", 0, 0]]], "name": "merge_7", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_7", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_7", 0, 0]]], "name": "batchnormalization_15", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_15", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_15", 0, 0]]], "name": "activation_15", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_15", 0, 0]]], "name": "convolution2d_16", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_16", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "name": "batchnormalization_16", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_16", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_16", 0, 0]]], "name": "activation_16", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_16", 0, 0]]], "name": "convolution2d_17", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_17", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_17", 0, 0], ["merge_7", 0, 0]]], "name": "merge_8", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_8", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_8", 0, 0]]], "name": "batchnormalization_17", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_17", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_17", 0, 0]]], "name": "activation_17", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_17", 0, 0]]], "name": "convolution2d_18", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_18", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_18", 0, 0]]], "name": "batchnormalization_18", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_18", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_18", 0, 0]]], "name": "activation_18", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_18", 0, 0]]], "name": "convolution2d_19", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_19", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_19", 0, 0], ["merge_8", 0, 0]]], "name": "merge_9", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_9", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_9", 0, 0]]], "name": "batchnormalization_19", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_19", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_19", 0, 0]]], "name": "activation_19", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_19", 0, 0]]], "name": "convolution2d_20", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_20", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_20", 0, 0]]], "name": "batchnormalization_20", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_20", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_20", 0, 0]]], "name": "activation_20", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_20", 0, 0]]], "name": "convolution2d_21", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_21", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_21", 0, 0], ["merge_9", 0, 0]]], "name": "merge_10", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_10", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_10", 0, 0]]], "name": "batchnormalization_21", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_21", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "activation_21", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_21", 0, 0]]], "name": "convolution2d_22", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_22", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_22", 0, 0]]], "name": "batchnormalization_22", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_22", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_22", 0, 0]]], "name": "activation_22", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_22", 0, 0]]], "name": "convolution2d_23", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_23", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_23", 0, 0], ["merge_10", 0, 0]]], "name": "merge_11", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_11", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_11", 0, 0]]], "name": "batchnormalization_23", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_23", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "activation_23", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_23", 0, 0]]], "name": "convolution2d_24", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_24", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_24", 0, 0]]], "name": "batchnormalization_24", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_24", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_24", 0, 0]]], "name": "activation_24", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_24", 0, 0]]], "name": "convolution2d_25", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_25", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_25", 0, 0], ["merge_11", 0, 0]]], "name": "merge_12", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_12", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_12", 0, 0]]], "name": "batchnormalization_25", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_25", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_25", 0, 0]]], "name": "activation_25", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_25", 0, 0]]], "name": "convolution2d_26", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_26", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "batchnormalization_26", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_26", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_26", 0, 0]]], "name": "activation_26", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_26", 0, 0]]], "name": "convolution2d_27", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_27", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_27", 0, 0], ["merge_12", 0, 0]]], "name": "merge_13", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_13", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_13", 0, 0]]], "name": "batchnormalization_27", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_27", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_27", 0, 0]]], "name": "activation_27", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_27", 0, 0]]], "name": "convolution2d_28", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_28", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_28", 0, 0]]], "name": "batchnormalization_28", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_28", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_28", 0, 0]]], "name": "activation_28", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_28", 0, 0]]], "name": "convolution2d_29", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_29", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_29", 0, 0], ["merge_13", 0, 0]]], "name": "merge_14", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_14", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_14", 0, 0]]], "name": "batchnormalization_29", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_29", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "activation_29", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_29", 0, 0]]], "name": "convolution2d_30", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_30", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_30", 0, 0]]], "name": "batchnormalization_30", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_30", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_30", 0, 0]]], "name": "activation_30", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_30", 0, 0]]], "name": "convolution2d_31", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_31", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_31", 0, 0], ["merge_14", 0, 0]]], "name": "merge_15", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_15", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_15", 0, 0]]], "name": "batchnormalization_31", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_31", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_31", 0, 0]]], "name": "activation_31", "config": {"name": "activation_31", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_31", 0, 0]]], "name": "convolution2d_32", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_32", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_32", 0, 0]]], "name": "batchnormalization_32", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_32", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_32", 0, 0]]], "name": "activation_32", "config": {"name": "activation_32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_32", 0, 0]]], "name": "convolution2d_33", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_33", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_33", 0, 0], ["merge_15", 0, 0]]], "name": "merge_16", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_16", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_16", 0, 0]]], "name": "batchnormalization_33", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_33", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_33", 0, 0]]], "name": "activation_33", "config": {"name": "activation_33", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_33", 0, 0]]], "name": "convolution2d_34", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_34", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_34", 0, 0]]], "name": "batchnormalization_34", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_34", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_34", 0, 0]]], "name": "activation_34", "config": {"name": "activation_34", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_34", 0, 0]]], "name": "convolution2d_35", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_35", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_35", 0, 0], ["merge_16", 0, 0]]], "name": "merge_17", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_17", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_17", 0, 0]]], "name": "batchnormalization_35", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_35", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_35", 0, 0]]], "name": "activation_35", "config": {"name": "activation_35", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_35", 0, 0]]], "name": "convolution2d_36", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_36", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_36", 0, 0]]], "name": "batchnormalization_36", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_36", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_36", 0, 0]]], "name": "activation_36", "config": {"name": "activation_36", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_36", 0, 0]]], "name": "convolution2d_37", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_37", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_37", 0, 0], ["merge_17", 0, 0]]], "name": "merge_18", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_18", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_18", 0, 0]]], "name": "batchnormalization_37", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_37", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_37", 0, 0]]], "name": "activation_37", "config": {"name": "activation_37", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_37", 0, 0]]], "name": "convolution2d_38", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_38", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_38", 0, 0]]], "name": "batchnormalization_38", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_38", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_38", 0, 0]]], "name": "activation_38", "config": {"name": "activation_38", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_38", 0, 0]]], "name": "convolution2d_39", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_39", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_39", 0, 0], ["merge_18", 0, 0]]], "name": "merge_19", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_19", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_19", 0, 0]]], "name": "batchnormalization_39", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_39", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_39", 0, 0]]], "name": "activation_39", "config": {"name": "activation_39", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_39", 0, 0]]], "name": "convolution2d_40", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_40", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_40", 0, 0]]], "name": "batchnormalization_40", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_40", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_40", 0, 0]]], "name": "activation_40", "config": {"name": "activation_40", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_40", 0, 0]]], "name": "convolution2d_41", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_41", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_41", 0, 0], ["merge_19", 0, 0]]], "name": "merge_20", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_20", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_20", 0, 0]]], "name": "batchnormalization_41", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_41", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_41", 0, 0]]], "name": "activation_41", "config": {"name": "activation_41", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_41", 0, 0]]], "name": "convolution2d_42", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_42", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_42", 0, 0]]], "name": "batchnormalization_42", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_42", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_42", 0, 0]]], "name": "activation_42", "config": {"name": "activation_42", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_42", 0, 0]]], "name": "convolution2d_43", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_43", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_43", 0, 0], ["merge_20", 0, 0]]], "name": "merge_21", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_21", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_21", 0, 0]]], "name": "convolution2d_44", "config": {"b_constraint": null, "nb_col": 3, "subsample": [1, 1], "bias": true, "name": "convolution2d_44", "nb_filter": 64, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "b_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_44", 0, 0]]], "name": "batchnormalization_43", "config": {"gamma_regularizer": null, "trainable": true, "mode": 0, "momentum": 0.99, "epsilon": 0.001, "name": "batchnormalization_43", "axis": -1, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_43", 0, 0], ["convolution2d_1", 0, 0]]], "name": "merge_22", "config": {"dot_axes": -1, "arguments": {}, "output_shape_type": "raw", "output_mask": null, "concat_axis": -1, "output_shape": null, "name": "merge_22", "mode_type": "raw", "mode": "sum", "output_mask_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_22", 0, 0]]], "name": "convolution2d_45", "config": {"b_constraint": null, "nb_col": 1, "subsample": [1, 1], "bias": true, "name": "convolution2d_45", "nb_filter": 6, "init": "he_normal", "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_row": 1, "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}], "output_layers": [["convolution2d_45", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.0"}