____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 50, 50, 2)     0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 50, 50, 64)    1216        input_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 50, 50, 64)    36928       convolution2d_1[0][0]            
____________________________________________________________________________________________________
batchnormalization_1 (BatchNorma (None, 50, 50, 64)    256         convolution2d_2[0][0]            
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 50, 50, 64)    0           batchnormalization_1[0][0]       
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 50, 50, 64)    36928       activation_1[0][0]               
____________________________________________________________________________________________________
batchnormalization_2 (BatchNorma (None, 50, 50, 64)    256         convolution2d_3[0][0]            
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_2[0][0]       
                                                                   convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 50, 50, 64)    36928       merge_1[0][0]                    
____________________________________________________________________________________________________
batchnormalization_3 (BatchNorma (None, 50, 50, 64)    256         convolution2d_4[0][0]            
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 50, 50, 64)    0           batchnormalization_3[0][0]       
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 50, 50, 64)    36928       activation_2[0][0]               
____________________________________________________________________________________________________
batchnormalization_4 (BatchNorma (None, 50, 50, 64)    256         convolution2d_5[0][0]            
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_4[0][0]       
                                                                   merge_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 50, 50, 64)    36928       merge_2[0][0]                    
____________________________________________________________________________________________________
batchnormalization_5 (BatchNorma (None, 50, 50, 64)    256         convolution2d_6[0][0]            
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 50, 50, 64)    0           batchnormalization_5[0][0]       
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 50, 50, 64)    36928       activation_3[0][0]               
____________________________________________________________________________________________________
batchnormalization_6 (BatchNorma (None, 50, 50, 64)    256         convolution2d_7[0][0]            
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_6[0][0]       
                                                                   merge_2[0][0]                    
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 50, 50, 64)    36928       merge_3[0][0]                    
____________________________________________________________________________________________________
batchnormalization_7 (BatchNorma (None, 50, 50, 64)    256         convolution2d_8[0][0]            
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 50, 50, 64)    0           batchnormalization_7[0][0]       
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 50, 50, 64)    36928       activation_4[0][0]               
____________________________________________________________________________________________________
batchnormalization_8 (BatchNorma (None, 50, 50, 64)    256         convolution2d_9[0][0]            
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_8[0][0]       
                                                                   merge_3[0][0]                    
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 50, 50, 64)    36928       merge_4[0][0]                    
____________________________________________________________________________________________________
batchnormalization_9 (BatchNorma (None, 50, 50, 64)    256         convolution2d_10[0][0]           
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 50, 50, 64)    0           batchnormalization_9[0][0]       
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 50, 50, 64)    36928       activation_5[0][0]               
____________________________________________________________________________________________________
batchnormalization_10 (BatchNorm (None, 50, 50, 64)    256         convolution2d_11[0][0]           
____________________________________________________________________________________________________
merge_5 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_10[0][0]      
                                                                   merge_4[0][0]                    
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 50, 50, 64)    36928       merge_5[0][0]                    
____________________________________________________________________________________________________
batchnormalization_11 (BatchNorm (None, 50, 50, 64)    256         convolution2d_12[0][0]           
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 50, 50, 64)    0           batchnormalization_11[0][0]      
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 50, 50, 64)    36928       activation_6[0][0]               
____________________________________________________________________________________________________
batchnormalization_12 (BatchNorm (None, 50, 50, 64)    256         convolution2d_13[0][0]           
____________________________________________________________________________________________________
merge_6 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_12[0][0]      
                                                                   merge_5[0][0]                    
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 50, 50, 64)    36928       merge_6[0][0]                    
____________________________________________________________________________________________________
batchnormalization_13 (BatchNorm (None, 50, 50, 64)    256         convolution2d_14[0][0]           
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 50, 50, 64)    0           batchnormalization_13[0][0]      
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 50, 50, 64)    36928       activation_7[0][0]               
____________________________________________________________________________________________________
batchnormalization_14 (BatchNorm (None, 50, 50, 64)    256         convolution2d_15[0][0]           
____________________________________________________________________________________________________
merge_7 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_14[0][0]      
                                                                   merge_6[0][0]                    
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, 50, 50, 64)    36928       merge_7[0][0]                    
____________________________________________________________________________________________________
batchnormalization_15 (BatchNorm (None, 50, 50, 64)    256         convolution2d_16[0][0]           
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 50, 50, 64)    0           batchnormalization_15[0][0]      
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, 50, 50, 64)    36928       activation_8[0][0]               
____________________________________________________________________________________________________
batchnormalization_16 (BatchNorm (None, 50, 50, 64)    256         convolution2d_17[0][0]           
____________________________________________________________________________________________________
merge_8 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_16[0][0]      
                                                                   merge_7[0][0]                    
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, 50, 50, 64)    36928       merge_8[0][0]                    
____________________________________________________________________________________________________
batchnormalization_17 (BatchNorm (None, 50, 50, 64)    256         convolution2d_18[0][0]           
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 50, 50, 64)    0           batchnormalization_17[0][0]      
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D) (None, 50, 50, 64)    36928       activation_9[0][0]               
____________________________________________________________________________________________________
batchnormalization_18 (BatchNorm (None, 50, 50, 64)    256         convolution2d_19[0][0]           
____________________________________________________________________________________________________
merge_9 (Merge)                  (None, 50, 50, 64)    0           batchnormalization_18[0][0]      
                                                                   merge_8[0][0]                    
____________________________________________________________________________________________________
convolution2d_20 (Convolution2D) (None, 50, 50, 64)    36928       merge_9[0][0]                    
____________________________________________________________________________________________________
batchnormalization_19 (BatchNorm (None, 50, 50, 64)    256         convolution2d_20[0][0]           
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 50, 50, 64)    0           batchnormalization_19[0][0]      
____________________________________________________________________________________________________
convolution2d_21 (Convolution2D) (None, 50, 50, 64)    36928       activation_10[0][0]              
____________________________________________________________________________________________________
batchnormalization_20 (BatchNorm (None, 50, 50, 64)    256         convolution2d_21[0][0]           
____________________________________________________________________________________________________
merge_10 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_20[0][0]      
                                                                   merge_9[0][0]                    
____________________________________________________________________________________________________
convolution2d_22 (Convolution2D) (None, 50, 50, 64)    36928       merge_10[0][0]                   
____________________________________________________________________________________________________
batchnormalization_21 (BatchNorm (None, 50, 50, 64)    256         convolution2d_22[0][0]           
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 50, 50, 64)    0           batchnormalization_21[0][0]      
____________________________________________________________________________________________________
convolution2d_23 (Convolution2D) (None, 50, 50, 64)    36928       activation_11[0][0]              
____________________________________________________________________________________________________
batchnormalization_22 (BatchNorm (None, 50, 50, 64)    256         convolution2d_23[0][0]           
____________________________________________________________________________________________________
merge_11 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_22[0][0]      
                                                                   merge_10[0][0]                   
____________________________________________________________________________________________________
convolution2d_24 (Convolution2D) (None, 50, 50, 64)    36928       merge_11[0][0]                   
____________________________________________________________________________________________________
batchnormalization_23 (BatchNorm (None, 50, 50, 64)    256         convolution2d_24[0][0]           
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 50, 50, 64)    0           batchnormalization_23[0][0]      
____________________________________________________________________________________________________
convolution2d_25 (Convolution2D) (None, 50, 50, 64)    36928       activation_12[0][0]              
____________________________________________________________________________________________________
batchnormalization_24 (BatchNorm (None, 50, 50, 64)    256         convolution2d_25[0][0]           
____________________________________________________________________________________________________
merge_12 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_24[0][0]      
                                                                   merge_11[0][0]                   
____________________________________________________________________________________________________
convolution2d_26 (Convolution2D) (None, 50, 50, 64)    36928       merge_12[0][0]                   
____________________________________________________________________________________________________
batchnormalization_25 (BatchNorm (None, 50, 50, 64)    256         convolution2d_26[0][0]           
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 50, 50, 64)    0           batchnormalization_25[0][0]      
____________________________________________________________________________________________________
convolution2d_27 (Convolution2D) (None, 50, 50, 64)    36928       activation_13[0][0]              
____________________________________________________________________________________________________
batchnormalization_26 (BatchNorm (None, 50, 50, 64)    256         convolution2d_27[0][0]           
____________________________________________________________________________________________________
merge_13 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_26[0][0]      
                                                                   merge_12[0][0]                   
____________________________________________________________________________________________________
convolution2d_28 (Convolution2D) (None, 50, 50, 64)    36928       merge_13[0][0]                   
____________________________________________________________________________________________________
batchnormalization_27 (BatchNorm (None, 50, 50, 64)    256         convolution2d_28[0][0]           
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 50, 50, 64)    0           batchnormalization_27[0][0]      
____________________________________________________________________________________________________
convolution2d_29 (Convolution2D) (None, 50, 50, 64)    36928       activation_14[0][0]              
____________________________________________________________________________________________________
batchnormalization_28 (BatchNorm (None, 50, 50, 64)    256         convolution2d_29[0][0]           
____________________________________________________________________________________________________
merge_14 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_28[0][0]      
                                                                   merge_13[0][0]                   
____________________________________________________________________________________________________
convolution2d_30 (Convolution2D) (None, 50, 50, 64)    36928       merge_14[0][0]                   
____________________________________________________________________________________________________
batchnormalization_29 (BatchNorm (None, 50, 50, 64)    256         convolution2d_30[0][0]           
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 50, 50, 64)    0           batchnormalization_29[0][0]      
____________________________________________________________________________________________________
convolution2d_31 (Convolution2D) (None, 50, 50, 64)    36928       activation_15[0][0]              
____________________________________________________________________________________________________
batchnormalization_30 (BatchNorm (None, 50, 50, 64)    256         convolution2d_31[0][0]           
____________________________________________________________________________________________________
merge_15 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_30[0][0]      
                                                                   merge_14[0][0]                   
____________________________________________________________________________________________________
convolution2d_32 (Convolution2D) (None, 50, 50, 64)    36928       merge_15[0][0]                   
____________________________________________________________________________________________________
batchnormalization_31 (BatchNorm (None, 50, 50, 64)    256         convolution2d_32[0][0]           
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 50, 50, 64)    0           batchnormalization_31[0][0]      
____________________________________________________________________________________________________
convolution2d_33 (Convolution2D) (None, 50, 50, 64)    36928       activation_16[0][0]              
____________________________________________________________________________________________________
batchnormalization_32 (BatchNorm (None, 50, 50, 64)    256         convolution2d_33[0][0]           
____________________________________________________________________________________________________
merge_16 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_32[0][0]      
                                                                   merge_15[0][0]                   
____________________________________________________________________________________________________
convolution2d_34 (Convolution2D) (None, 50, 50, 64)    36928       merge_16[0][0]                   
____________________________________________________________________________________________________
batchnormalization_33 (BatchNorm (None, 50, 50, 64)    256         convolution2d_34[0][0]           
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 50, 50, 64)    0           batchnormalization_33[0][0]      
____________________________________________________________________________________________________
convolution2d_35 (Convolution2D) (None, 50, 50, 64)    36928       activation_17[0][0]              
____________________________________________________________________________________________________
batchnormalization_34 (BatchNorm (None, 50, 50, 64)    256         convolution2d_35[0][0]           
____________________________________________________________________________________________________
merge_17 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_34[0][0]      
                                                                   merge_16[0][0]                   
____________________________________________________________________________________________________
convolution2d_36 (Convolution2D) (None, 50, 50, 64)    36928       merge_17[0][0]                   
____________________________________________________________________________________________________
batchnormalization_35 (BatchNorm (None, 50, 50, 64)    256         convolution2d_36[0][0]           
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 50, 50, 64)    0           batchnormalization_35[0][0]      
____________________________________________________________________________________________________
convolution2d_37 (Convolution2D) (None, 50, 50, 64)    36928       activation_18[0][0]              
____________________________________________________________________________________________________
batchnormalization_36 (BatchNorm (None, 50, 50, 64)    256         convolution2d_37[0][0]           
____________________________________________________________________________________________________
merge_18 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_36[0][0]      
                                                                   merge_17[0][0]                   
____________________________________________________________________________________________________
convolution2d_38 (Convolution2D) (None, 50, 50, 64)    36928       merge_18[0][0]                   
____________________________________________________________________________________________________
batchnormalization_37 (BatchNorm (None, 50, 50, 64)    256         convolution2d_38[0][0]           
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 50, 50, 64)    0           batchnormalization_37[0][0]      
____________________________________________________________________________________________________
convolution2d_39 (Convolution2D) (None, 50, 50, 64)    36928       activation_19[0][0]              
____________________________________________________________________________________________________
batchnormalization_38 (BatchNorm (None, 50, 50, 64)    256         convolution2d_39[0][0]           
____________________________________________________________________________________________________
merge_19 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_38[0][0]      
                                                                   merge_18[0][0]                   
____________________________________________________________________________________________________
convolution2d_40 (Convolution2D) (None, 50, 50, 64)    36928       merge_19[0][0]                   
____________________________________________________________________________________________________
batchnormalization_39 (BatchNorm (None, 50, 50, 64)    256         convolution2d_40[0][0]           
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 50, 50, 64)    0           batchnormalization_39[0][0]      
____________________________________________________________________________________________________
convolution2d_41 (Convolution2D) (None, 50, 50, 64)    36928       activation_20[0][0]              
____________________________________________________________________________________________________
batchnormalization_40 (BatchNorm (None, 50, 50, 64)    256         convolution2d_41[0][0]           
____________________________________________________________________________________________________
merge_20 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_40[0][0]      
                                                                   merge_19[0][0]                   
____________________________________________________________________________________________________
convolution2d_42 (Convolution2D) (None, 50, 50, 64)    36928       merge_20[0][0]                   
____________________________________________________________________________________________________
batchnormalization_41 (BatchNorm (None, 50, 50, 64)    256         convolution2d_42[0][0]           
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 50, 50, 64)    0           batchnormalization_41[0][0]      
____________________________________________________________________________________________________
convolution2d_43 (Convolution2D) (None, 50, 50, 64)    36928       activation_21[0][0]              
____________________________________________________________________________________________________
batchnormalization_42 (BatchNorm (None, 50, 50, 64)    256         convolution2d_43[0][0]           
____________________________________________________________________________________________________
merge_21 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_42[0][0]      
                                                                   merge_20[0][0]                   
____________________________________________________________________________________________________
convolution2d_44 (Convolution2D) (None, 50, 50, 64)    36928       merge_21[0][0]                   
____________________________________________________________________________________________________
batchnormalization_43 (BatchNorm (None, 50, 50, 64)    256         convolution2d_44[0][0]           
____________________________________________________________________________________________________
merge_22 (Merge)                 (None, 50, 50, 64)    0           batchnormalization_43[0][0]      
                                                                   convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_45 (Convolution2D) (None, 50, 50, 6)     390         merge_22[0][0]                   
====================================================================================================
Total params: 1,600,518
Trainable params: 1,595,014
Non-trainable params: 5,504
____________________________________________________________________________________________________
