{"config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 128, 2], "input_dtype": "float32", "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1"}, "name": "convolution2d_1", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_2"}, "name": "convolution2d_2", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1"}, "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_3"}, "name": "convolution2d_3", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_4"}, "name": "convolution2d_4", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2"}, "name": "maxpooling2d_2", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 128, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_5"}, "name": "convolution2d_5", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 128, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_6"}, "name": "convolution2d_6", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3"}, "name": "maxpooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_7"}, "name": "convolution2d_7", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_8"}, "name": "convolution2d_8", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_4"}, "name": "maxpooling2d_4", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_4", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_9"}, "name": "convolution2d_9", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 512, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_10"}, "name": "convolution2d_10", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "config": {"size": [2, 2], "name": "upsampling2d_1", "trainable": true}, "name": "upsampling2d_1", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_8", 0, 0]]], "config": {"concat_axis": 3, "output_shape": null, "mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "name": "merge_1", "dot_axes": -1}, "name": "merge_1", "class_name": "Merge"}, {"inbound_nodes": [[["merge_1", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_11"}, "name": "convolution2d_11", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_11", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 256, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_12"}, "name": "convolution2d_12", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_12", 0, 0]]], "config": {"size": [2, 2], "name": "upsampling2d_2", "trainable": true}, "name": "upsampling2d_2", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_6", 0, 0]]], "config": {"concat_axis": 3, "output_shape": null, "mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "name": "merge_2", "dot_axes": -1}, "name": "merge_2", "class_name": "Merge"}, {"inbound_nodes": [[["merge_2", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 128, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_13"}, "name": "convolution2d_13", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 128, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_14"}, "name": "convolution2d_14", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_14", 0, 0]]], "config": {"size": [2, 2], "name": "upsampling2d_3", "trainable": true}, "name": "upsampling2d_3", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["upsampling2d_3", 0, 0], ["convolution2d_4", 0, 0]]], "config": {"concat_axis": 3, "output_shape": null, "mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "name": "merge_3", "dot_axes": -1}, "name": "merge_3", "class_name": "Merge"}, {"inbound_nodes": [[["merge_3", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_15"}, "name": "convolution2d_15", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 64, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_16"}, "name": "convolution2d_16", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_16", 0, 0]]], "config": {"size": [2, 2], "name": "upsampling2d_4", "trainable": true}, "name": "upsampling2d_4", "class_name": "UpSampling2D"}, {"inbound_nodes": [[["upsampling2d_4", 0, 0], ["convolution2d_2", 0, 0]]], "config": {"concat_axis": 3, "output_shape": null, "mode_type": "raw", "mode": "concat", "output_shape_type": "raw", "name": "merge_4", "dot_axes": -1}, "name": "merge_4", "class_name": "Merge"}, {"inbound_nodes": [[["merge_4", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_17"}, "name": "convolution2d_17", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_17", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "relu", "nb_filter": 32, "border_mode": "same", "bias": true, "trainable": true, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_18"}, "name": "convolution2d_18", "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_18", 0, 0]]], "config": {"dim_ordering": "tf", "subsample": [1, 1], "activity_regularizer": null, "init": "glorot_uniform", "activation": "sigmoid", "nb_filter": 2, "border_mode": "valid", "bias": true, "trainable": true, "nb_col": 1, "nb_row": 1, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_19"}, "name": "convolution2d_19", "class_name": "Convolution2D"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["convolution2d_19", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.0"}