____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 128, 128, 2)   0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 128, 128, 32)  608         input_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 128, 128, 32)  9248        convolution2d_1[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 64, 64, 32)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 64, 64, 64)    18496       maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 64, 64, 64)    36928       convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 32, 32, 64)    0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 32, 32, 128)   73856       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 32, 32, 128)   147584      convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 16, 16, 128)   0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 16, 16, 256)   295168      maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 16, 16, 256)   590080      convolution2d_7[0][0]            
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)    (None, 8, 8, 256)     0           convolution2d_8[0][0]            
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 8, 8, 512)     1180160     maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 8, 8, 512)     2359808     convolution2d_9[0][0]            
____________________________________________________________________________________________________
upsampling2d_1 (UpSampling2D)    (None, 16, 16, 512)   0           convolution2d_10[0][0]           
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 16, 16, 768)   0           upsampling2d_1[0][0]             
                                                                   convolution2d_8[0][0]            
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 16, 16, 256)   1769728     merge_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 16, 16, 256)   590080      convolution2d_11[0][0]           
____________________________________________________________________________________________________
upsampling2d_2 (UpSampling2D)    (None, 32, 32, 256)   0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 32, 32, 384)   0           upsampling2d_2[0][0]             
                                                                   convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 32, 32, 128)   442496      merge_2[0][0]                    
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 32, 32, 128)   147584      convolution2d_13[0][0]           
____________________________________________________________________________________________________
upsampling2d_3 (UpSampling2D)    (None, 64, 64, 128)   0           convolution2d_14[0][0]           
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 64, 64, 192)   0           upsampling2d_3[0][0]             
                                                                   convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 64, 64, 64)    110656      merge_3[0][0]                    
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D) (None, 64, 64, 64)    36928       convolution2d_15[0][0]           
____________________________________________________________________________________________________
upsampling2d_4 (UpSampling2D)    (None, 128, 128, 64)  0           convolution2d_16[0][0]           
____________________________________________________________________________________________________
merge_4 (Merge)                  (None, 128, 128, 96)  0           upsampling2d_4[0][0]             
                                                                   convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D) (None, 128, 128, 32)  27680       merge_4[0][0]                    
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D) (None, 128, 128, 32)  9248        convolution2d_17[0][0]           
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D) (None, 128, 128, 2)   66          convolution2d_18[0][0]           
====================================================================================================
Total params: 7846402
____________________________________________________________________________________________________
