{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["convolution2d_19", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 128, 128, 2], "name": "input_1", "input_dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "trainable": true}, "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "trainable": true}, "name": "convolution2d_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "trainable": true}, "name": "maxpooling2d_1", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "trainable": true}, "name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_4", "trainable": true}, "name": "convolution2d_4", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "trainable": true}, "name": "maxpooling2d_2", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_5", "trainable": true}, "name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_6", "trainable": true}, "name": "convolution2d_6", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2], "trainable": true}, "name": "maxpooling2d_3", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_7", "trainable": true}, "name": "convolution2d_7", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_8", "trainable": true}, "name": "convolution2d_8", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4", "border_mode": "valid", "strides": [2, 2], "trainable": true}, "name": "maxpooling2d_4", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 512, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_9", "trainable": true}, "name": "convolution2d_9", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 512, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_10", "trainable": true}, "name": "convolution2d_10", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_1", "trainable": true, "size": [2, 2]}, "name": "upsampling2d_1", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "mode": "concat", "concat_axis": 3, "name": "merge_1", "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_1", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_8", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_11", "trainable": true}, "name": "convolution2d_11", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 256, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_12", "trainable": true}, "name": "convolution2d_12", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_2", "trainable": true, "size": [2, 2]}, "name": "upsampling2d_2", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "mode": "concat", "concat_axis": 3, "name": "merge_2", "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_2", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_6", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_13", "trainable": true}, "name": "convolution2d_13", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 128, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_14", "trainable": true}, "name": "convolution2d_14", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_3", "trainable": true, "size": [2, 2]}, "name": "upsampling2d_3", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "mode": "concat", "concat_axis": 3, "name": "merge_3", "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_3", "inbound_nodes": [[["upsampling2d_3", 0, 0], ["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_15", "trainable": true}, "name": "convolution2d_15", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_16", "trainable": true}, "name": "convolution2d_16", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling2d_4", "trainable": true, "size": [2, 2]}, "name": "upsampling2d_4", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"class_name": "Merge", "config": {"dot_axes": -1, "output_shape": null, "mode": "concat", "concat_axis": 3, "name": "merge_4", "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_4", "inbound_nodes": [[["upsampling2d_4", 0, 0], ["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_17", "trainable": true}, "name": "convolution2d_17", "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_18", "trainable": true}, "name": "convolution2d_18", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"nb_filter": 2, "init": "glorot_uniform", "activation": "sigmoid", "bias": true, "dim_ordering": "tf", "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "nb_col": 1, "nb_row": 1, "b_regularizer": null, "b_constraint": null, "name": "convolution2d_19", "trainable": true}, "name": "convolution2d_19", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}]}, "keras_version": "1.1.0"}