{"config": {"output_layers": [["deconvolution2d_11", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 50, 50, 2], "name": "input_1", "sparse": false, "input_dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_1", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_1", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_2", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_2", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_3", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_3", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_4", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_4", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_5", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_5", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_6", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_6", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_7", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_7", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_7", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_8", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_8", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_9", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_9", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_9", 0, 0]]], "class_name": "Convolution2D", "name": "convolution2d_10", "config": {"subsample": [1, 1], "trainable": true, "nb_row": 3, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "convolution2d_10", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "nb_filter": 64, "init": "he_normal"}}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_1", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_1", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["deconvolution2d_1", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_2", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_2", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_9", 0, 0], ["deconvolution2d_2", 0, 0]]], "class_name": "Merge", "name": "merge_1", "config": {"mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "name": "merge_1", "dot_axes": -1, "concat_axis": -1, "output_shape": null, "arguments": {}, "mode": "sum", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_3", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_3", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["deconvolution2d_3", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_4", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_4", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_7", 0, 0], ["deconvolution2d_4", 0, 0]]], "class_name": "Merge", "name": "merge_2", "config": {"mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "name": "merge_2", "dot_axes": -1, "concat_axis": -1, "output_shape": null, "arguments": {}, "mode": "sum", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_2", 0, 0]]], "class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_5", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_5", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["deconvolution2d_5", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_6", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_6", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_5", 0, 0], ["deconvolution2d_6", 0, 0]]], "class_name": "Merge", "name": "merge_3", "config": {"mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "name": "merge_3", "dot_axes": -1, "concat_axis": -1, "output_shape": null, "arguments": {}, "mode": "sum", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_3", 0, 0]]], "class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_7", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_7", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["deconvolution2d_7", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_8", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_8", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_3", 0, 0], ["deconvolution2d_8", 0, 0]]], "class_name": "Merge", "name": "merge_4", "config": {"mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "name": "merge_4", "dot_axes": -1, "concat_axis": -1, "output_shape": null, "arguments": {}, "mode": "sum", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_4", 0, 0]]], "class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_9", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_9", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["deconvolution2d_9", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_10", "config": {"nb_filter": 64, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_10", "W_constraint": null, "nb_col": 3, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 64], "nb_row": 3}}, {"inbound_nodes": [[["convolution2d_1", 0, 0], ["deconvolution2d_10", 0, 0]]], "class_name": "Merge", "name": "merge_5", "config": {"mode_type": "raw", "output_mask": null, "output_shape_type": "raw", "name": "merge_5", "dot_axes": -1, "concat_axis": -1, "output_shape": null, "arguments": {}, "mode": "sum", "output_mask_type": "raw"}}, {"inbound_nodes": [[["merge_5", 0, 0]]], "class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"inbound_nodes": [[["activation_5", 0, 0]]], "class_name": "Deconvolution2D", "name": "deconvolution2d_11", "config": {"nb_filter": 6, "subsample": [1, 1], "trainable": true, "init": "he_normal", "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_regularizer": null, "dim_ordering": "tf", "name": "deconvolution2d_11", "W_constraint": null, "nb_col": 1, "b_constraint": null, "border_mode": "same", "output_shape": [32, 50, 50, 6], "nb_row": 1}}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "1.2.0", "class_name": "Model"}