{"keras_version": "1.1.0", "config": {"layers": [{"config": {"input_dtype": "float32", "batch_input_shape": [null, 128, 128, 2], "name": "input_1", "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 32, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_1", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 32, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_2", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}, "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_3", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_4", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}, "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 128, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_5", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 128, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_6", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}, "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 256, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_7", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 256, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_8", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_4", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}, "name": "maxpooling2d_4", "class_name": "MaxPooling2D", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 512, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_9", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_9", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_4", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 512, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_10", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_10", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_1"}, "name": "upsampling2d_1", "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"config": {"mode": "concat", "dot_axes": -1, "name": "merge_1", "concat_axis": 3, "output_shape": null, "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["upsampling2d_1", 0, 0], ["convolution2d_8", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 256, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_11", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_11", "class_name": "Convolution2D", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 256, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_12", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_12", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_2"}, "name": "upsampling2d_2", "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"config": {"mode": "concat", "dot_axes": -1, "name": "merge_2", "concat_axis": 3, "output_shape": null, "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["upsampling2d_2", 0, 0], ["convolution2d_6", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 128, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_13", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_13", "class_name": "Convolution2D", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 128, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_14", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_14", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_3"}, "name": "upsampling2d_3", "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_14", 0, 0]]]}, {"config": {"mode": "concat", "dot_axes": -1, "name": "merge_3", "concat_axis": 3, "output_shape": null, "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_3", "class_name": "Merge", "inbound_nodes": [[["upsampling2d_3", 0, 0], ["convolution2d_4", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_15", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_15", "class_name": "Convolution2D", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_16", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_16", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_15", 0, 0]]]}, {"config": {"trainable": true, "size": [2, 2], "name": "upsampling2d_4"}, "name": "upsampling2d_4", "class_name": "UpSampling2D", "inbound_nodes": [[["convolution2d_16", 0, 0]]]}, {"config": {"mode": "concat", "dot_axes": -1, "name": "merge_4", "concat_axis": 3, "output_shape": null, "output_shape_type": "raw", "mode_type": "raw"}, "name": "merge_4", "class_name": "Merge", "inbound_nodes": [[["upsampling2d_4", 0, 0], ["convolution2d_2", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 32, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_17", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_17", "class_name": "Convolution2D", "inbound_nodes": [[["merge_4", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "activation": "relu", "W_constraint": null, "nb_filter": 32, "nb_col": 3, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_18", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "same"}, "name": "convolution2d_18", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_17", 0, 0]]]}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 1, "activation": "sigmoid", "W_constraint": null, "nb_filter": 2, "nb_col": 1, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "bias": true, "name": "convolution2d_19", "b_regularizer": null, "subsample": [1, 1], "init": "glorot_uniform", "border_mode": "valid"}, "name": "convolution2d_19", "class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_18", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["convolution2d_19", 0, 0]], "name": "model_1"}, "class_name": "Model"}