{"keras_version": "1.2.0", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["deconvolution2d_11", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 50, 50, 2], "input_dtype": "float32"}, "inbound_nodes": []}, {"name": "convolution2d_1", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_1", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution2d_2", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"name": "convolution2d_3", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"name": "convolution2d_4", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"name": "convolution2d_5", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"name": "convolution2d_6", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_6", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"name": "convolution2d_7", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_7", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"name": "convolution2d_8", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_8", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"name": "convolution2d_9", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_9", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"name": "convolution2d_10", "class_name": "Convolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "init": "he_normal", "b_constraint": null, "name": "convolution2d_10", "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"name": "deconvolution2d_1", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_1", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"name": "deconvolution2d_2", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_2", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["deconvolution2d_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}, "inbound_nodes": [[["deconvolution2d_2", 0, 0]]]}, {"name": "deconvolution2d_3", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_3", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "deconvolution2d_4", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_4", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["deconvolution2d_3", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}, "inbound_nodes": [[["deconvolution2d_4", 0, 0]]]}, {"name": "deconvolution2d_5", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_5", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "deconvolution2d_6", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_6", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["deconvolution2d_5", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}, "inbound_nodes": [[["deconvolution2d_6", 0, 0]]]}, {"name": "deconvolution2d_7", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_7", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "deconvolution2d_8", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_8", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["deconvolution2d_7", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}, "inbound_nodes": [[["deconvolution2d_8", 0, 0]]]}, {"name": "deconvolution2d_9", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_9", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "deconvolution2d_10", "class_name": "Deconvolution2D", "config": {"nb_filter": 64, "W_constraint": null, "bias": true, "nb_col": 3, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_10", "dim_ordering": "tf", "output_shape": [32, 50, 50, 64], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 3, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["deconvolution2d_9", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["deconvolution2d_10", 0, 0]]]}, {"name": "deconvolution2d_11", "class_name": "Deconvolution2D", "config": {"nb_filter": 6, "W_constraint": null, "bias": true, "nb_col": 1, "activation": "relu", "b_constraint": null, "name": "deconvolution2d_11", "dim_ordering": "tf", "output_shape": [32, 50, 50, 6], "trainable": true, "init": "he_normal", "W_regularizer": null, "nb_row": 1, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0]]]}], "input_layers": [["input_1", 0, 0]]}}