{"keras_version": "1.1.0", "config": {"output_layers": [["convolution2d_15", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "float32", "batch_input_shape": [null, 156, 156, 3], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_1", "activation": "relu", "nb_filter": 32, "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_2", "activation": "relu", "nb_filter": 64, "nb_row": 3}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_3", "activation": "relu", "nb_filter": 64, "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_4", "activation": "relu", "nb_filter": 128, "nb_row": 3}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_5", "activation": "relu", "nb_filter": 128, "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_6", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_6", "activation": "relu", "nb_filter": 256, "nb_row": 3}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "config": {"strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_7", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_7", "activation": "relu", "nb_filter": 256, "nb_row": 3}, "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_8", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_8", "activation": "relu", "nb_filter": 512, "nb_row": 3}, "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_1", "config": {"size": [2, 2], "name": "upsampling2d_1", "trainable": true}, "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"class_name": "Cropping2D", "name": "cropping2d_3", "config": {"cropping": [[4, 4], [4, 4]], "name": "cropping2d_3", "trainable": true}, "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_shape": null, "concat_axis": 3, "mode_type": "raw", "mode": "concat", "name": "merge_1", "output_shape_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["upsampling2d_1", 0, 0], ["cropping2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_9", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_9", "activation": "relu", "nb_filter": 256, "nb_row": 3}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_10", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_10", "activation": "relu", "nb_filter": 256, "nb_row": 3}, "inbound_nodes": [[["convolution2d_9", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_2", "config": {"size": [2, 2], "name": "upsampling2d_2", "trainable": true}, "inbound_nodes": [[["convolution2d_10", 0, 0]]]}, {"class_name": "Cropping2D", "name": "cropping2d_2", "config": {"cropping": [[16, 16], [16, 16]], "name": "cropping2d_2", "trainable": true}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"output_shape": null, "concat_axis": 3, "mode_type": "raw", "mode": "concat", "name": "merge_2", "output_shape_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["upsampling2d_2", 0, 0], ["cropping2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_11", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_11", "activation": "relu", "nb_filter": 128, "nb_row": 3}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_12", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_12", "activation": "relu", "nb_filter": 128, "nb_row": 3}, "inbound_nodes": [[["convolution2d_11", 0, 0]]]}, {"class_name": "UpSampling2D", "name": "upsampling2d_3", "config": {"size": [2, 2], "name": "upsampling2d_3", "trainable": true}, "inbound_nodes": [[["convolution2d_12", 0, 0]]]}, {"class_name": "Cropping2D", "name": "cropping2d_1", "config": {"cropping": [[40, 40], [40, 40]], "name": "cropping2d_1", "trainable": true}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Merge", "name": "merge_3", "config": {"output_shape": null, "concat_axis": 3, "mode_type": "raw", "mode": "concat", "name": "merge_3", "output_shape_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["upsampling2d_3", 0, 0], ["cropping2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_13", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_13", "activation": "relu", "nb_filter": 128, "nb_row": 3}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_14", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 3, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_14", "activation": "relu", "nb_filter": 128, "nb_row": 3}, "inbound_nodes": [[["convolution2d_13", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_15", "config": {"subsample": [1, 1], "b_regularizer": null, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "W_regularizer": null, "nb_col": 1, "W_constraint": null, "bias": true, "init": "he_normal", "activity_regularizer": null, "name": "convolution2d_15", "activation": "linear", "nb_filter": 6, "nb_row": 1}, "inbound_nodes": [[["convolution2d_14", 0, 0]]]}]}, "class_name": "Model"}