____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 156, 156, 3)   0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 154, 154, 32)  896         input_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 152, 152, 64)  18496       convolution2d_1[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 76, 76, 64)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 74, 74, 64)    36928       maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)  (None, 72, 72, 128)   73856       convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)    (None, 36, 36, 128)   0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)  (None, 34, 34, 128)   147584      maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)  (None, 32, 32, 256)   295168      convolution2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)    (None, 16, 16, 256)   0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)  (None, 14, 14, 256)   590080      maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)  (None, 12, 12, 512)   1180160     convolution2d_7[0][0]            
____________________________________________________________________________________________________
upsampling2d_1 (UpSampling2D)    (None, 24, 24, 512)   0           convolution2d_8[0][0]            
____________________________________________________________________________________________________
cropping2d_3 (Cropping2D)        (None, 24, 24, 256)   0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
merge_1 (Merge)                  (None, 24, 24, 768)   0           upsampling2d_1[0][0]             
                                                                   cropping2d_3[0][0]               
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)  (None, 22, 22, 256)   1769728     merge_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D) (None, 20, 20, 256)   590080      convolution2d_9[0][0]            
____________________________________________________________________________________________________
upsampling2d_2 (UpSampling2D)    (None, 40, 40, 256)   0           convolution2d_10[0][0]           
____________________________________________________________________________________________________
cropping2d_2 (Cropping2D)        (None, 40, 40, 128)   0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
merge_2 (Merge)                  (None, 40, 40, 384)   0           upsampling2d_2[0][0]             
                                                                   cropping2d_2[0][0]               
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D) (None, 38, 38, 128)   442496      merge_2[0][0]                    
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D) (None, 36, 36, 128)   147584      convolution2d_11[0][0]           
____________________________________________________________________________________________________
upsampling2d_3 (UpSampling2D)    (None, 72, 72, 128)   0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
cropping2d_1 (Cropping2D)        (None, 72, 72, 64)    0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
merge_3 (Merge)                  (None, 72, 72, 192)   0           upsampling2d_3[0][0]             
                                                                   cropping2d_1[0][0]               
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D) (None, 70, 70, 128)   221312      merge_3[0][0]                    
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D) (None, 68, 68, 128)   147584      convolution2d_13[0][0]           
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D) (None, 68, 68, 2)     258         convolution2d_14[0][0]           
====================================================================================================
Total params: 5662210
____________________________________________________________________________________________________
