{"config": {"output_layers": [["out_tau", 0, 0], ["out_v", 0, 0], ["out_vth", 0, 0], ["out_a", 0, 0], ["out_B", 0, 0], ["out_thB", 0, 0], ["out_phiB", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SI_input"}, "class_name": "InputLayer", "name": "SI_input", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SQ_input"}, "class_name": "InputLayer", "name": "SQ_input", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SU_input"}, "class_name": "InputLayer", "name": "SU_input", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SV_input"}, "class_name": "InputLayer", "name": "SV_input", "inbound_nodes": []}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convI_1", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 5, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convI_1", "inbound_nodes": [[["SI_input", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convQ_1", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 5, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convQ_1", "inbound_nodes": [[["SQ_input", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convU_1", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 5, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convU_1", "inbound_nodes": [[["SU_input", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convV_1", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 5, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convV_1", "inbound_nodes": [[["SV_input", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolI_1", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolI_1", "inbound_nodes": [[["convI_1", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolQ_1", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolQ_1", "inbound_nodes": [[["convQ_1", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolU_1", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolU_1", "inbound_nodes": [[["convU_1", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolV_1", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolV_1", "inbound_nodes": [[["convV_1", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convI_2", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 10, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convI_2", "inbound_nodes": [[["poolI_1", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convQ_2", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 10, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convQ_2", "inbound_nodes": [[["poolQ_1", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convU_2", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 10, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convU_2", "inbound_nodes": [[["poolU_1", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convV_2", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 10, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convV_2", "inbound_nodes": [[["poolV_1", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolI_2", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolI_2", "inbound_nodes": [[["convI_2", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolQ_2", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolQ_2", "inbound_nodes": [[["convQ_2", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolU_2", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolU_2", "inbound_nodes": [[["convU_2", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolV_2", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolV_2", "inbound_nodes": [[["convV_2", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convI_3", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 15, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convI_3", "inbound_nodes": [[["poolI_2", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convQ_3", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 15, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convQ_3", "inbound_nodes": [[["poolQ_2", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convU_3", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 15, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convU_3", "inbound_nodes": [[["poolU_2", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convV_3", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 15, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convV_3", "inbound_nodes": [[["poolV_2", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolI_3", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolI_3", "inbound_nodes": [[["convI_3", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolQ_3", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolQ_3", "inbound_nodes": [[["convQ_3", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolU_3", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolU_3", "inbound_nodes": [[["convU_3", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolV_3", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolV_3", "inbound_nodes": [[["convV_3", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convI_4", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 20, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convI_4", "inbound_nodes": [[["poolI_3", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convQ_4", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 20, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convQ_4", "inbound_nodes": [[["poolQ_3", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convU_4", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 20, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convU_4", "inbound_nodes": [[["poolU_3", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convV_4", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 20, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convV_4", "inbound_nodes": [[["poolV_3", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolI_4", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolI_4", "inbound_nodes": [[["convI_4", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolQ_4", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolQ_4", "inbound_nodes": [[["convQ_4", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolU_4", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolU_4", "inbound_nodes": [[["convU_4", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolV_4", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolV_4", "inbound_nodes": [[["convV_4", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convI_5", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 25, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convI_5", "inbound_nodes": [[["poolI_4", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convQ_5", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 25, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convQ_5", "inbound_nodes": [[["poolQ_4", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convU_5", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 25, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convU_5", "inbound_nodes": [[["poolU_4", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "input_length": null, "border_mode": "same", "W_constraint": null, "subsample_length": 1, "name": "convV_5", "activity_regularizer": null, "init": "he_normal", "nb_filter": 50, "filter_length": 25, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Convolution1D", "name": "convV_5", "inbound_nodes": [[["poolV_4", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolI_5", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolI_5", "inbound_nodes": [[["convI_5", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolQ_5", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolQ_5", "inbound_nodes": [[["convQ_5", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolU_5", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolU_5", "inbound_nodes": [[["convU_5", 0, 0]]]}, {"config": {"trainable": true, "stride": 2, "pool_length": 2, "name": "poolV_5", "border_mode": "valid"}, "class_name": "MaxPooling1D", "name": "poolV_5", "inbound_nodes": [[["convV_5", 0, 0]]]}, {"config": {"trainable": true, "name": "flatI"}, "class_name": "Flatten", "name": "flatI", "inbound_nodes": [[["poolI_5", 0, 0]]]}, {"config": {"trainable": true, "name": "flatQ"}, "class_name": "Flatten", "name": "flatQ", "inbound_nodes": [[["poolQ_5", 0, 0]]]}, {"config": {"trainable": true, "name": "flatU"}, "class_name": "Flatten", "name": "flatU", "inbound_nodes": [[["poolU_5", 0, 0]]]}, {"config": {"trainable": true, "name": "flatV"}, "class_name": "Flatten", "name": "flatV", "inbound_nodes": [[["poolV_5", 0, 0]]]}, {"config": {"batch_input_shape": [null, 1], "input_dtype": "float32", "name": "mu_input"}, "class_name": "InputLayer", "name": "mu_input", "inbound_nodes": []}, {"config": {"mode": "concat", "concat_axis": -1, "mode_type": "raw", "output_shape": null, "dot_axes": -1, "output_shape_type": "raw", "name": "FC"}, "class_name": "Merge", "name": "FC", "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0], ["mu_input", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "FC_tau", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 90, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Dense", "name": "FC_tau", "inbound_nodes": [[["FC", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "FC_B", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 90, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "relu"}, "class_name": "Dense", "name": "FC_B", "inbound_nodes": [[["FC", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_tau", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_tau", "inbound_nodes": [[["FC_tau", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_v", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_v", "inbound_nodes": [[["FC_tau", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_vth", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_vth", "inbound_nodes": [[["FC_tau", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_a", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_a", "inbound_nodes": [[["FC_tau", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_B", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_B", "inbound_nodes": [[["FC_B", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_thB", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_thB", "inbound_nodes": [[["FC_B", 0, 0]]]}, {"config": {"bias": true, "b_constraint": null, "W_constraint": null, "name": "out_phiB", "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 30, "b_regularizer": null, "input_dim": null, "trainable": true, "W_regularizer": null, "activation": "softmax"}, "class_name": "Dense", "name": "out_phiB", "inbound_nodes": [[["FC_B", 0, 0]]]}], "name": "model_1", "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0], ["mu_input", 0, 0]]}, "class_name": "Model", "keras_version": "1.0.8"}