{"keras_version": "1.0.8", "config": {"output_layers": [["out_tau", 0, 0], ["out_v", 0, 0], ["out_vth", 0, 0], ["out_a", 0, 0], ["out_B", 0, 0], ["out_thB", 0, 0], ["out_phiB", 0, 0], ["out_ThB", 0, 0], ["out_PhiB", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SI_input"}, "inbound_nodes": [], "name": "SI_input", "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SQ_input"}, "inbound_nodes": [], "name": "SQ_input", "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SU_input"}, "inbound_nodes": [], "name": "SU_input", "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 128, 1], "input_dtype": "float32", "name": "SV_input"}, "inbound_nodes": [], "name": "SV_input", "class_name": "InputLayer"}, {"config": {"trainable": true, "sigma": 0.0001, "name": "gaussiannoise_1"}, "inbound_nodes": [[["SI_input", 0, 0]]], "name": "gaussiannoise_1", "class_name": "GaussianNoise"}, {"config": {"trainable": true, "sigma": 0.0001, "name": "gaussiannoise_2"}, "inbound_nodes": [[["SQ_input", 0, 0]]], "name": "gaussiannoise_2", "class_name": "GaussianNoise"}, {"config": {"trainable": true, "sigma": 0.0001, "name": "gaussiannoise_3"}, "inbound_nodes": [[["SU_input", 0, 0]]], "name": "gaussiannoise_3", "class_name": "GaussianNoise"}, {"config": {"trainable": true, "sigma": 0.0001, "name": "gaussiannoise_4"}, "inbound_nodes": [[["SV_input", 0, 0]]], "name": "gaussiannoise_4", "class_name": "GaussianNoise"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 5, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convI_1", "bias": true}, "inbound_nodes": [[["gaussiannoise_1", 0, 0]]], "name": "convI_1", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 5, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convQ_1", "bias": true}, "inbound_nodes": [[["gaussiannoise_2", 0, 0]]], "name": "convQ_1", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 5, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convU_1", "bias": true}, "inbound_nodes": [[["gaussiannoise_3", 0, 0]]], "name": "convU_1", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 5, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convV_1", "bias": true}, "inbound_nodes": [[["gaussiannoise_4", 0, 0]]], "name": "convV_1", "class_name": "Convolution1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolI_1"}, "inbound_nodes": [[["convI_1", 0, 0]]], "name": "poolI_1", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolQ_1"}, "inbound_nodes": [[["convQ_1", 0, 0]]], "name": "poolQ_1", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolU_1"}, "inbound_nodes": [[["convU_1", 0, 0]]], "name": "poolU_1", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolV_1"}, "inbound_nodes": [[["convV_1", 0, 0]]], "name": "poolV_1", "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 10, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convI_2", "bias": true}, "inbound_nodes": [[["poolI_1", 0, 0]]], "name": "convI_2", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 10, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convQ_2", "bias": true}, "inbound_nodes": [[["poolQ_1", 0, 0]]], "name": "convQ_2", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 10, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convU_2", "bias": true}, "inbound_nodes": [[["poolU_1", 0, 0]]], "name": "convU_2", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 10, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convV_2", "bias": true}, "inbound_nodes": [[["poolV_1", 0, 0]]], "name": "convV_2", "class_name": "Convolution1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolI_2"}, "inbound_nodes": [[["convI_2", 0, 0]]], "name": "poolI_2", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolQ_2"}, "inbound_nodes": [[["convQ_2", 0, 0]]], "name": "poolQ_2", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolU_2"}, "inbound_nodes": [[["convU_2", 0, 0]]], "name": "poolU_2", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolV_2"}, "inbound_nodes": [[["convV_2", 0, 0]]], "name": "poolV_2", "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 15, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convI_3", "bias": true}, "inbound_nodes": [[["poolI_2", 0, 0]]], "name": "convI_3", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 15, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convQ_3", "bias": true}, "inbound_nodes": [[["poolQ_2", 0, 0]]], "name": "convQ_3", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 15, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convU_3", "bias": true}, "inbound_nodes": [[["poolU_2", 0, 0]]], "name": "convU_3", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 15, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convV_3", "bias": true}, "inbound_nodes": [[["poolV_2", 0, 0]]], "name": "convV_3", "class_name": "Convolution1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolI_3"}, "inbound_nodes": [[["convI_3", 0, 0]]], "name": "poolI_3", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolQ_3"}, "inbound_nodes": [[["convQ_3", 0, 0]]], "name": "poolQ_3", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolU_3"}, "inbound_nodes": [[["convU_3", 0, 0]]], "name": "poolU_3", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolV_3"}, "inbound_nodes": [[["convV_3", 0, 0]]], "name": "poolV_3", "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 20, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convI_4", "bias": true}, "inbound_nodes": [[["poolI_3", 0, 0]]], "name": "convI_4", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 20, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convQ_4", "bias": true}, "inbound_nodes": [[["poolQ_3", 0, 0]]], "name": "convQ_4", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 20, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convU_4", "bias": true}, "inbound_nodes": [[["poolU_3", 0, 0]]], "name": "convU_4", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 20, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convV_4", "bias": true}, "inbound_nodes": [[["poolV_3", 0, 0]]], "name": "convV_4", "class_name": "Convolution1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolI_4"}, "inbound_nodes": [[["convI_4", 0, 0]]], "name": "poolI_4", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolQ_4"}, "inbound_nodes": [[["convQ_4", 0, 0]]], "name": "poolQ_4", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolU_4"}, "inbound_nodes": [[["convU_4", 0, 0]]], "name": "poolU_4", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolV_4"}, "inbound_nodes": [[["convV_4", 0, 0]]], "name": "poolV_4", "class_name": "MaxPooling1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 25, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convI_5", "bias": true}, "inbound_nodes": [[["poolI_4", 0, 0]]], "name": "convI_5", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 25, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convQ_5", "bias": true}, "inbound_nodes": [[["poolQ_4", 0, 0]]], "name": "convQ_5", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 25, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convU_5", "bias": true}, "inbound_nodes": [[["poolU_4", 0, 0]]], "name": "convU_5", "class_name": "Convolution1D"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "he_normal", "subsample_length": 1, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "border_mode": "same", "filter_length": 25, "nb_filter": 50, "input_length": null, "b_regularizer": null, "name": "convV_5", "bias": true}, "inbound_nodes": [[["poolV_4", 0, 0]]], "name": "convV_5", "class_name": "Convolution1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolI_5"}, "inbound_nodes": [[["convI_5", 0, 0]]], "name": "poolI_5", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolQ_5"}, "inbound_nodes": [[["convQ_5", 0, 0]]], "name": "poolQ_5", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolU_5"}, "inbound_nodes": [[["convU_5", 0, 0]]], "name": "poolU_5", "class_name": "MaxPooling1D"}, {"config": {"pool_length": 2, "trainable": true, "border_mode": "valid", "stride": 2, "name": "poolV_5"}, "inbound_nodes": [[["convV_5", 0, 0]]], "name": "poolV_5", "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatI"}, "inbound_nodes": [[["poolI_5", 0, 0]]], "name": "flatI", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "flatQ"}, "inbound_nodes": [[["poolQ_5", 0, 0]]], "name": "flatQ", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "flatU"}, "inbound_nodes": [[["poolU_5", 0, 0]]], "name": "flatU", "class_name": "Flatten"}, {"config": {"trainable": true, "name": "flatV"}, "inbound_nodes": [[["poolV_5", 0, 0]]], "name": "flatV", "class_name": "Flatten"}, {"config": {"batch_input_shape": [null, 1], "input_dtype": "float32", "name": "mu_input"}, "inbound_nodes": [], "name": "mu_input", "class_name": "InputLayer"}, {"config": {"mode": "concat", "output_shape": null, "mode_type": "raw", "name": "FC", "concat_axis": -1, "output_shape_type": "raw", "dot_axes": -1}, "inbound_nodes": [[["flatI", 0, 0], ["flatQ", 0, 0], ["flatU", 0, 0], ["flatV", 0, 0], ["mu_input", 0, 0]]], "name": "FC", "class_name": "Merge"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "FC_tau", "b_regularizer": null, "output_dim": 90, "bias": true}, "inbound_nodes": [[["FC", 0, 0]]], "name": "FC_tau", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "FC_B", "b_regularizer": null, "output_dim": 90, "bias": true}, "inbound_nodes": [[["FC", 0, 0]]], "name": "FC_B", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_tau", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_tau", 0, 0]]], "name": "out_tau", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_v", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_tau", 0, 0]]], "name": "out_v", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_vth", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_tau", 0, 0]]], "name": "out_vth", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_a", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_tau", 0, 0]]], "name": "out_a", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_B", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_B", 0, 0]]], "name": "out_B", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_thB", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_B", 0, 0]]], "name": "out_thB", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_phiB", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_B", 0, 0]]], "name": "out_phiB", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_ThB", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_B", 0, 0]]], "name": "out_ThB", "class_name": "Dense"}, {"config": {"input_dim": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "name": "out_PhiB", "b_regularizer": null, "output_dim": 30, "bias": true}, "inbound_nodes": [[["FC_B", 0, 0]]], "name": "out_PhiB", "class_name": "Dense"}], "name": "model_1", "input_layers": [["SI_input", 0, 0], ["SQ_input", 0, 0], ["SU_input", 0, 0], ["SV_input", 0, 0], ["mu_input", 0, 0]]}, "class_name": "Model"}