____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 88, 88, 12)    0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 88, 88, 64)    6976                                         
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 44, 44, 128)   73856                                        
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 44, 44, 128)   512                                          
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 44, 44, 128)   147584                                       
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 44, 44, 128)   8320                                         
____________________________________________________________________________________________________
add_1 (Add)                      (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 44, 44, 128)   512                                          
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 22, 22, 256)   295168                                       
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 22, 22, 256)   590080                                       
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 22, 22, 256)   33024                                        
____________________________________________________________________________________________________
add_2 (Add)                      (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 11, 11, 256)   65792                                        
____________________________________________________________________________________________________
add_3 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_4 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_5 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_6 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_17 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_18 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_7 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_19 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_17 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_20 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_8 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_18 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_21 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_19 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_22 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_9 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_20 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_23 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_21 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_24 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_10 (Add)                     (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_22 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_22 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_25 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_23 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_23 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_26 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_11 (Add)                     (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_24 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_24 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_27 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_25 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_25 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_28 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_12 (Add)                     (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_26 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_26 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_29 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_27 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_27 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
conv2d_30 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_13 (Add)                     (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)   (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_28 (BatchNor (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_28 (Activation)       (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
conv2d_31 (Conv2D)               (None, 22, 22, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_29 (BatchNor (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_29 (Activation)       (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
conv2d_32 (Conv2D)               (None, 22, 22, 256)   590080                                       
____________________________________________________________________________________________________
conv2d_33 (Conv2D)               (None, 22, 22, 256)   65792                                        
____________________________________________________________________________________________________
add_14 (Add)                     (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)   (None, 44, 44, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_30 (BatchNor (None, 44, 44, 256)   1024                                         
____________________________________________________________________________________________________
activation_30 (Activation)       (None, 44, 44, 256)   0                                            
____________________________________________________________________________________________________
conv2d_34 (Conv2D)               (None, 44, 44, 128)   295040                                       
____________________________________________________________________________________________________
batch_normalization_31 (BatchNor (None, 44, 44, 128)   512                                          
____________________________________________________________________________________________________
activation_31 (Activation)       (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
conv2d_35 (Conv2D)               (None, 44, 44, 128)   147584                                       
____________________________________________________________________________________________________
conv2d_36 (Conv2D)               (None, 44, 44, 128)   32896                                        
____________________________________________________________________________________________________
add_15 (Add)                     (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)   (None, 88, 88, 128)   0                                            
____________________________________________________________________________________________________
batch_normalization_32 (BatchNor (None, 88, 88, 128)   512                                          
____________________________________________________________________________________________________
activation_32 (Activation)       (None, 88, 88, 128)   0                                            
____________________________________________________________________________________________________
conv2d_37 (Conv2D)               (None, 88, 88, 64)    73792                                        
____________________________________________________________________________________________________
batch_normalization_33 (BatchNor (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_33 (Activation)       (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_38 (Conv2D)               (None, 88, 88, 64)    36928                                        
____________________________________________________________________________________________________
conv2d_39 (Conv2D)               (None, 88, 88, 64)    8256                                         
____________________________________________________________________________________________________
add_16 (Add)                     (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
batch_normalization_34 (BatchNor (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_34 (Activation)       (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_40 (Conv2D)               (None, 88, 88, 64)    36928                                        
____________________________________________________________________________________________________
batch_normalization_35 (BatchNor (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_35 (Activation)       (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_41 (Conv2D)               (None, 88, 88, 64)    36928                                        
____________________________________________________________________________________________________
add_17 (Add)                     (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_42 (Conv2D)               (None, 88, 88, 1)     65                                           
====================================================================================================
Total params: 16,146,881.0
Trainable params: 16,131,905.0
Non-trainable params: 14,976.0
____________________________________________________________________________________________________
