____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 88, 88, 12)    0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 86, 86, 64)    6976                                         
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 86, 86, 64)    256                                          
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 86, 86, 64)    0                                            
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 86, 86, 64)    256                                          
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 86, 86, 64)    0                                            
____________________________________________________________________________________________________
reflection_padding2d_2 (Reflecti (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 43, 43, 128)   73856                                        
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 43, 43, 128)   512                                          
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 43, 43, 128)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_3 (Reflecti (None, 45, 45, 128)   0                                            
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 43, 43, 128)   147584                                       
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 43, 43, 128)   8320                                         
____________________________________________________________________________________________________
add_1 (Add)                      (None, 43, 43, 128)   0                                            
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 43, 43, 128)   512                                          
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 43, 43, 128)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_4 (Reflecti (None, 45, 45, 128)   0                                            
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 22, 22, 256)   295168                                       
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_5 (Reflecti (None, 24, 24, 256)   0                                            
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 22, 22, 256)   590080                                       
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 22, 22, 256)   33024                                        
____________________________________________________________________________________________________
add_2 (Add)                      (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_6 (Reflecti (None, 24, 24, 256)   0                                            
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_7 (Reflecti (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 11, 11, 256)   65792                                        
____________________________________________________________________________________________________
add_3 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_8 (Reflecti (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_9 (Reflecti (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_4 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_10 (Reflect (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_11 (Reflect (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_5 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_12 (Reflect (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 11, 11, 256)   1024                                         
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_13 (Reflect (None, 13, 13, 256)   0                                            
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, 11, 11, 256)   590080                                       
____________________________________________________________________________________________________
add_6 (Add)                      (None, 11, 11, 256)   0                                            
____________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)   (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_14 (Reflect (None, 24, 24, 256)   0                                            
____________________________________________________________________________________________________
conv2d_17 (Conv2D)               (None, 22, 22, 256)   590080                                       
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 22, 22, 256)   1024                                         
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_15 (Reflect (None, 24, 24, 256)   0                                            
____________________________________________________________________________________________________
conv2d_18 (Conv2D)               (None, 22, 22, 256)   590080                                       
____________________________________________________________________________________________________
conv2d_19 (Conv2D)               (None, 22, 22, 256)   65792                                        
____________________________________________________________________________________________________
add_7 (Add)                      (None, 22, 22, 256)   0                                            
____________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)   (None, 44, 44, 256)   0                                            
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, 44, 44, 256)   1024                                         
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 44, 44, 256)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_16 (Reflect (None, 46, 46, 256)   0                                            
____________________________________________________________________________________________________
conv2d_20 (Conv2D)               (None, 44, 44, 128)   295040                                       
____________________________________________________________________________________________________
batch_normalization_17 (BatchNor (None, 44, 44, 128)   512                                          
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_17 (Reflect (None, 46, 46, 128)   0                                            
____________________________________________________________________________________________________
conv2d_21 (Conv2D)               (None, 44, 44, 128)   147584                                       
____________________________________________________________________________________________________
conv2d_22 (Conv2D)               (None, 44, 44, 128)   32896                                        
____________________________________________________________________________________________________
add_8 (Add)                      (None, 44, 44, 128)   0                                            
____________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)   (None, 88, 88, 128)   0                                            
____________________________________________________________________________________________________
batch_normalization_18 (BatchNor (None, 88, 88, 128)   512                                          
____________________________________________________________________________________________________
activation_18 (Activation)       (None, 88, 88, 128)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_18 (Reflect (None, 90, 90, 128)   0                                            
____________________________________________________________________________________________________
conv2d_23 (Conv2D)               (None, 88, 88, 64)    73792                                        
____________________________________________________________________________________________________
batch_normalization_19 (BatchNor (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_19 (Activation)       (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
reflection_padding2d_19 (Reflect (None, 90, 90, 64)    0                                            
____________________________________________________________________________________________________
conv2d_24 (Conv2D)               (None, 88, 88, 64)    36928                                        
____________________________________________________________________________________________________
conv2d_25 (Conv2D)               (None, 88, 88, 64)    8256                                         
____________________________________________________________________________________________________
add_9 (Add)                      (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
batch_normalization_20 (BatchNor (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_20 (Activation)       (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
reflection_padding2d_20 (Reflect (None, 90, 90, 64)    0                                            
____________________________________________________________________________________________________
conv2d_26 (Conv2D)               (None, 88, 88, 64)    36928                                        
____________________________________________________________________________________________________
batch_normalization_21 (BatchNor (None, 88, 88, 64)    256                                          
____________________________________________________________________________________________________
activation_21 (Activation)       (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
reflection_padding2d_21 (Reflect (None, 90, 90, 64)    0                                            
____________________________________________________________________________________________________
conv2d_27 (Conv2D)               (None, 88, 88, 64)    36928                                        
____________________________________________________________________________________________________
add_10 (Add)                     (None, 88, 88, 64)    0                                            
____________________________________________________________________________________________________
conv2d_28 (Conv2D)               (None, 88, 88, 1)     65                                           
====================================================================================================
Total params: 7,871,425.0
Trainable params: 7,863,617.0
Non-trainable params: 7,808.0
____________________________________________________________________________________________________
