_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 88, 88, 12)        0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 88, 88, 12)        0         
_________________________________________________________________
reflection_padding2d_1 (Refl (None, 90, 90, 12)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 88, 88, 64)        6976      
_________________________________________________________________
batch_normalization_1 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
reflection_padding2d_2 (Refl (None, 90, 90, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
reflection_padding2d_3 (Refl (None, 90, 90, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
add_1 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
reflection_padding2d_4 (Refl (None, 90, 90, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
reflection_padding2d_5 (Refl (None, 90, 90, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
add_2 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
reflection_padding2d_6 (Refl (None, 90, 90, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 88, 88, 1)         65        
=================================================================
Total params: 193,217.0
Trainable params: 192,449.0
Non-trainable params: 768.0
_________________________________________________________________
