_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 88, 88, 12)        0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 88, 88, 12)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 88, 88, 64)        6976      
_________________________________________________________________
batch_normalization_1 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
add_1 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
add_2 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_7 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
add_3 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_8 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_9 (Batch (None, 88, 88, 64)        256       
_________________________________________________________________
add_4 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_10 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_5 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_12 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_13 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_6 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_14 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_8 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_15 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_7 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_16 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_9 (Activation)    (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_17 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_8 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_18 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_10 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_19 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_9 (Add)                  (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_20 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_11 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_21 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_10 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_22 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_12 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_23 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_11 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_24 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_13 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_25 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_12 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_26 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_14 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_27 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_13 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_28 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_15 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_29 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_14 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_30 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_16 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_31 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_15 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_32 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_17 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_33 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_16 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_34 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_18 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_35 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_17 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_36 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_19 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_37 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_37 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_18 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_38 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_20 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_39 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_19 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_40 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_21 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_41 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
add_20 (Add)                 (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 88, 88, 64)        36928     
_________________________________________________________________
batch_normalization_42 (Batc (None, 88, 88, 64)        256       
_________________________________________________________________
activation_22 (Activation)   (None, 88, 88, 64)        0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 88, 88, 1)         65        
=================================================================
Total params: 1,531,841.0
Trainable params: 1,526,465.0
Non-trainable params: 5,376.0
_________________________________________________________________
