{"config": {"output_layers": [["out_metals", 0, 0], ["out_C", 0, 0], ["out_N", 0, 0], ["out_O", 0, 0], ["out_alpha", 0, 0], ["out_log10vdop", 0, 0], ["out_Teff", 0, 0]], "layers": [{"config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 2920, 1], "name": "flux1_input"}, "class_name": "InputLayer", "name": "flux1_input", "inbound_nodes": []}, {"config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 1893, 1], "name": "flux3_input"}, "class_name": "InputLayer", "name": "flux3_input", "inbound_nodes": []}, {"config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_1"}, "class_name": "GaussianNoise", "name": "gaussiannoise_1", "inbound_nodes": [[["flux1_input", 0, 0]]]}, {"config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 2400, 1], "name": "flux2_input"}, "class_name": "InputLayer", "name": "flux2_input", "inbound_nodes": []}, {"config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_3"}, "class_name": "GaussianNoise", "name": "gaussiannoise_3", "inbound_nodes": [[["flux3_input", 0, 0]]]}, {"config": {"trainable": true, "padding": 24, "name": "zeropadding1d_1"}, "class_name": "ZeroPadding1D", "name": "zeropadding1d_1", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]]}, {"config": {"trainable": true, "sigma": 0.0, "name": "gaussiannoise_2"}, "class_name": "GaussianNoise", "name": "gaussiannoise_2", "inbound_nodes": [[["flux2_input", 0, 0]]]}, {"config": {"trainable": true, "padding": 27, "name": "zeropadding1d_2"}, "class_name": "ZeroPadding1D", "name": "zeropadding1d_2", "inbound_nodes": [[["gaussiannoise_3", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv1_1", "filter_length": 3, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv1_1", "inbound_nodes": [[["zeropadding1d_1", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv1_2", "filter_length": 3, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv1_2", "inbound_nodes": [[["gaussiannoise_2", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv1_3", "filter_length": 3, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv1_3", "inbound_nodes": [[["zeropadding1d_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool1_1", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool1_1", "inbound_nodes": [[["conv1_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool1_2", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool1_2", "inbound_nodes": [[["conv1_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool1_3", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool1_3", "inbound_nodes": [[["conv1_3", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv2_1", "filter_length": 6, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv2_1", "inbound_nodes": [[["pool1_1", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv2_2", "filter_length": 6, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv2_2", "inbound_nodes": [[["pool1_2", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv2_3", "filter_length": 6, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv2_3", "inbound_nodes": [[["pool1_3", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool2_1", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool2_1", "inbound_nodes": [[["conv2_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool2_2", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool2_2", "inbound_nodes": [[["conv2_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool2_3", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool2_3", "inbound_nodes": [[["conv2_3", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv3_1", "filter_length": 9, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv3_1", "inbound_nodes": [[["pool2_1", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv3_2", "filter_length": 9, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv3_2", "inbound_nodes": [[["pool2_2", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv3_3", "filter_length": 9, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv3_3", "inbound_nodes": [[["pool2_3", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool3_1", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool3_1", "inbound_nodes": [[["conv3_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool3_2", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool3_2", "inbound_nodes": [[["conv3_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool3_3", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool3_3", "inbound_nodes": [[["conv3_3", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv4_1", "filter_length": 12, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv4_1", "inbound_nodes": [[["pool3_1", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv4_2", "filter_length": 12, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv4_2", "inbound_nodes": [[["pool3_2", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv4_3", "filter_length": 12, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv4_3", "inbound_nodes": [[["pool3_3", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool4_1", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool4_1", "inbound_nodes": [[["conv4_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool4_2", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool4_2", "inbound_nodes": [[["conv4_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool4_3", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool4_3", "inbound_nodes": [[["conv4_3", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv5_1", "filter_length": 15, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv5_1", "inbound_nodes": [[["pool4_1", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv5_2", "filter_length": 15, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv5_2", "inbound_nodes": [[["pool4_2", 0, 0]]]}, {"config": {"W_regularizer": null, "name": "conv5_3", "filter_length": 15, "b_constraint": null, "border_mode": "same", "init": "he_normal", "input_length": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "W_constraint": null, "trainable": true, "subsample_length": 1, "bias": true, "input_dim": null, "nb_filter": 50}, "class_name": "Convolution1D", "name": "conv5_3", "inbound_nodes": [[["pool4_3", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool5_1", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool5_1", "inbound_nodes": [[["conv5_1", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool5_2", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool5_2", "inbound_nodes": [[["conv5_2", 0, 0]]]}, {"config": {"trainable": true, "border_mode": "valid", "name": "pool5_3", "pool_length": 2, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool5_3", "inbound_nodes": [[["conv5_3", 0, 0]]]}, {"config": {"trainable": true, "name": "flat_1"}, "class_name": "Flatten", "name": "flat_1", "inbound_nodes": [[["pool5_1", 0, 0]]]}, {"config": {"trainable": true, "name": "flat_2"}, "class_name": "Flatten", "name": "flat_2", "inbound_nodes": [[["pool5_2", 0, 0]]]}, {"config": {"trainable": true, "name": "flat_3"}, "class_name": "Flatten", "name": "flat_3", "inbound_nodes": [[["pool5_3", 0, 0]]]}, {"config": {"mode": "concat", "mode_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "output_shape": null, "name": "merge", "concat_axis": -1}, "class_name": "Merge", "name": "merge", "inbound_nodes": [[["flat_1", 0, 0], ["flat_2", 0, 0], ["flat_3", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 35, "b_regularizer": null, "bias": true, "name": "out_metals", "activity_regularizer": null}, "class_name": "Dense", "name": "out_metals", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 45, "b_regularizer": null, "bias": true, "name": "out_C", "activity_regularizer": null}, "class_name": "Dense", "name": "out_C", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 25, "b_regularizer": null, "bias": true, "name": "out_N", "activity_regularizer": null}, "class_name": "Dense", "name": "out_N", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 45, "b_regularizer": null, "bias": true, "name": "out_O", "activity_regularizer": null}, "class_name": "Dense", "name": "out_O", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 25, "b_regularizer": null, "bias": true, "name": "out_alpha", "activity_regularizer": null}, "class_name": "Dense", "name": "out_alpha", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 55, "b_regularizer": null, "bias": true, "name": "out_log10vdop", "activity_regularizer": null}, "class_name": "Dense", "name": "out_log10vdop", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "input_dim": null, "activation": "softmax", "trainable": true, "W_constraint": null, "output_dim": 55, "b_regularizer": null, "bias": true, "name": "out_Teff", "activity_regularizer": null}, "class_name": "Dense", "name": "out_Teff", "inbound_nodes": [[["merge", 0, 0]]]}], "name": "model_1", "input_layers": [["flux1_input", 0, 0], ["flux2_input", 0, 0], ["flux3_input", 0, 0]]}, "keras_version": "1.1.1", "class_name": "Model"}