____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
flux1_input (InputLayer)         (None, 2920, 1)       0                                            
____________________________________________________________________________________________________
flux3_input (InputLayer)         (None, 1893, 1)       0                                            
____________________________________________________________________________________________________
gaussiannoise_1 (GaussianNoise)  (None, 2920, 1)       0           flux1_input[0][0]                
____________________________________________________________________________________________________
flux2_input (InputLayer)         (None, 2400, 1)       0                                            
____________________________________________________________________________________________________
gaussiannoise_3 (GaussianNoise)  (None, 1893, 1)       0           flux3_input[0][0]                
____________________________________________________________________________________________________
zeropadding1d_1 (ZeroPadding1D)  (None, 2968, 1)       0           gaussiannoise_1[0][0]            
____________________________________________________________________________________________________
gaussiannoise_2 (GaussianNoise)  (None, 2400, 1)       0           flux2_input[0][0]                
____________________________________________________________________________________________________
zeropadding1d_2 (ZeroPadding1D)  (None, 1947, 1)       0           gaussiannoise_3[0][0]            
____________________________________________________________________________________________________
conv1_1 (Convolution1D)          (None, 2968, 50)      300         zeropadding1d_1[0][0]            
____________________________________________________________________________________________________
conv1_2 (Convolution1D)          (None, 2400, 50)      300         gaussiannoise_2[0][0]            
____________________________________________________________________________________________________
conv1_3 (Convolution1D)          (None, 1947, 50)      300         zeropadding1d_2[0][0]            
____________________________________________________________________________________________________
pool1_1 (MaxPooling1D)           (None, 1484, 50)      0           conv1_1[0][0]                    
____________________________________________________________________________________________________
pool1_2 (MaxPooling1D)           (None, 1200, 50)      0           conv1_2[0][0]                    
____________________________________________________________________________________________________
pool1_3 (MaxPooling1D)           (None, 973, 50)       0           conv1_3[0][0]                    
____________________________________________________________________________________________________
conv2_1 (Convolution1D)          (None, 1484, 50)      25050       pool1_1[0][0]                    
____________________________________________________________________________________________________
conv2_2 (Convolution1D)          (None, 1200, 50)      25050       pool1_2[0][0]                    
____________________________________________________________________________________________________
conv2_3 (Convolution1D)          (None, 973, 50)       25050       pool1_3[0][0]                    
____________________________________________________________________________________________________
pool2_1 (MaxPooling1D)           (None, 742, 50)       0           conv2_1[0][0]                    
____________________________________________________________________________________________________
pool2_2 (MaxPooling1D)           (None, 600, 50)       0           conv2_2[0][0]                    
____________________________________________________________________________________________________
pool2_3 (MaxPooling1D)           (None, 486, 50)       0           conv2_3[0][0]                    
____________________________________________________________________________________________________
conv3_1 (Convolution1D)          (None, 742, 50)       37550       pool2_1[0][0]                    
____________________________________________________________________________________________________
conv3_2 (Convolution1D)          (None, 600, 50)       37550       pool2_2[0][0]                    
____________________________________________________________________________________________________
conv3_3 (Convolution1D)          (None, 486, 50)       37550       pool2_3[0][0]                    
____________________________________________________________________________________________________
pool3_1 (MaxPooling1D)           (None, 371, 50)       0           conv3_1[0][0]                    
____________________________________________________________________________________________________
pool3_2 (MaxPooling1D)           (None, 300, 50)       0           conv3_2[0][0]                    
____________________________________________________________________________________________________
pool3_3 (MaxPooling1D)           (None, 243, 50)       0           conv3_3[0][0]                    
____________________________________________________________________________________________________
conv4_1 (Convolution1D)          (None, 371, 50)       50050       pool3_1[0][0]                    
____________________________________________________________________________________________________
conv4_2 (Convolution1D)          (None, 300, 50)       50050       pool3_2[0][0]                    
____________________________________________________________________________________________________
conv4_3 (Convolution1D)          (None, 243, 50)       50050       pool3_3[0][0]                    
____________________________________________________________________________________________________
pool4_1 (MaxPooling1D)           (None, 185, 50)       0           conv4_1[0][0]                    
____________________________________________________________________________________________________
pool4_2 (MaxPooling1D)           (None, 150, 50)       0           conv4_2[0][0]                    
____________________________________________________________________________________________________
pool4_3 (MaxPooling1D)           (None, 121, 50)       0           conv4_3[0][0]                    
____________________________________________________________________________________________________
conv5_1 (Convolution1D)          (None, 185, 50)       62550       pool4_1[0][0]                    
____________________________________________________________________________________________________
conv5_2 (Convolution1D)          (None, 150, 50)       62550       pool4_2[0][0]                    
____________________________________________________________________________________________________
conv5_3 (Convolution1D)          (None, 121, 50)       62550       pool4_3[0][0]                    
____________________________________________________________________________________________________
pool5_1 (MaxPooling1D)           (None, 92, 50)        0           conv5_1[0][0]                    
____________________________________________________________________________________________________
pool5_2 (MaxPooling1D)           (None, 75, 50)        0           conv5_2[0][0]                    
____________________________________________________________________________________________________
pool5_3 (MaxPooling1D)           (None, 60, 50)        0           conv5_3[0][0]                    
____________________________________________________________________________________________________
flat_1 (Flatten)                 (None, 4600)          0           pool5_1[0][0]                    
____________________________________________________________________________________________________
flat_2 (Flatten)                 (None, 3750)          0           pool5_2[0][0]                    
____________________________________________________________________________________________________
flat_3 (Flatten)                 (None, 3000)          0           pool5_3[0][0]                    
____________________________________________________________________________________________________
merge (Merge)                    (None, 11350)         0           flat_1[0][0]                     
                                                                   flat_2[0][0]                     
                                                                   flat_3[0][0]                     
____________________________________________________________________________________________________
out_metals (Dense)               (None, 35)            397285      merge[0][0]                      
____________________________________________________________________________________________________
out_C (Dense)                    (None, 45)            510795      merge[0][0]                      
____________________________________________________________________________________________________
out_N (Dense)                    (None, 25)            283775      merge[0][0]                      
____________________________________________________________________________________________________
out_O (Dense)                    (None, 45)            510795      merge[0][0]                      
____________________________________________________________________________________________________
out_alpha (Dense)                (None, 25)            283775      merge[0][0]                      
____________________________________________________________________________________________________
out_log10vdop (Dense)            (None, 55)            624305      merge[0][0]                      
____________________________________________________________________________________________________
out_Teff (Dense)                 (None, 55)            624305      merge[0][0]                      
====================================================================================================
Total params: 3761535
____________________________________________________________________________________________________
