{"config": {"input_layers": [["flux1_input", 0, 0], ["flux2_input", 0, 0], ["flux3_input", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 2920, 1], "input_dtype": "float32", "name": "flux1_input", "sparse": false}, "class_name": "InputLayer", "name": "flux1_input", "inbound_nodes": []}, {"config": {"batch_input_shape": [null, 1893, 1], "input_dtype": "float32", "name": "flux3_input", "sparse": false}, "class_name": "InputLayer", "name": "flux3_input", "inbound_nodes": []}, {"config": {"sigma": 0.0005, "trainable": true, "name": "gaussiannoise_1"}, "class_name": "GaussianNoise", "name": "gaussiannoise_1", "inbound_nodes": [[["flux1_input", 0, 0]]]}, {"config": {"batch_input_shape": [null, 2400, 1], "input_dtype": "float32", "name": "flux2_input", "sparse": false}, "class_name": "InputLayer", "name": "flux2_input", "inbound_nodes": []}, {"config": {"sigma": 0.0005, "trainable": true, "name": "gaussiannoise_3"}, "class_name": "GaussianNoise", "name": "gaussiannoise_3", "inbound_nodes": [[["flux3_input", 0, 0]]]}, {"config": {"padding": 24, "trainable": true, "name": "zeropadding1d_1"}, "class_name": "ZeroPadding1D", "name": "zeropadding1d_1", "inbound_nodes": [[["gaussiannoise_1", 0, 0]]]}, {"config": {"sigma": 0.0005, "trainable": true, "name": "gaussiannoise_2"}, "class_name": "GaussianNoise", "name": "gaussiannoise_2", "inbound_nodes": [[["flux2_input", 0, 0]]]}, {"config": {"padding": 27, "trainable": true, "name": "zeropadding1d_2"}, "class_name": "ZeroPadding1D", "name": "zeropadding1d_2", "inbound_nodes": [[["gaussiannoise_3", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 5, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv1_1", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv1_1", "inbound_nodes": [[["zeropadding1d_1", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 5, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv1_2", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv1_2", "inbound_nodes": [[["gaussiannoise_2", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 5, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv1_3", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv1_3", "inbound_nodes": [[["zeropadding1d_2", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool1_1", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool1_1", "inbound_nodes": [[["conv1_1", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool1_2", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool1_2", "inbound_nodes": [[["conv1_2", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool1_3", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool1_3", "inbound_nodes": [[["conv1_3", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 10, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv2_1", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv2_1", "inbound_nodes": [[["pool1_1", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 10, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv2_2", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv2_2", "inbound_nodes": [[["pool1_2", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 10, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv2_3", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv2_3", "inbound_nodes": [[["pool1_3", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool2_1", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool2_1", "inbound_nodes": [[["conv2_1", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool2_2", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool2_2", "inbound_nodes": [[["conv2_2", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool2_3", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool2_3", "inbound_nodes": [[["conv2_3", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 15, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv3_1", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv3_1", "inbound_nodes": [[["pool2_1", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 15, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv3_2", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv3_2", "inbound_nodes": [[["pool2_2", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 15, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv3_3", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv3_3", "inbound_nodes": [[["pool2_3", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool3_1", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool3_1", "inbound_nodes": [[["conv3_1", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool3_2", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool3_2", "inbound_nodes": [[["conv3_2", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool3_3", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool3_3", "inbound_nodes": [[["conv3_3", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 20, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv4_1", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv4_1", "inbound_nodes": [[["pool3_1", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 20, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv4_2", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv4_2", "inbound_nodes": [[["pool3_2", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 20, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv4_3", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv4_3", "inbound_nodes": [[["pool3_3", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool4_1", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool4_1", "inbound_nodes": [[["conv4_1", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool4_2", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool4_2", "inbound_nodes": [[["conv4_2", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool4_3", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool4_3", "inbound_nodes": [[["conv4_3", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 25, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv5_1", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv5_1", "inbound_nodes": [[["pool4_1", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 25, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv5_2", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv5_2", "inbound_nodes": [[["pool4_2", 0, 0]]]}, {"config": {"init": "he_normal", "b_constraint": null, "filter_length": 25, "trainable": true, "border_mode": "same", "b_regularizer": null, "input_dim": null, "nb_filter": 50, "input_length": null, "W_regularizer": null, "bias": true, "W_constraint": null, "activity_regularizer": null, "subsample_length": 1, "name": "conv5_3", "activation": "relu"}, "class_name": "Convolution1D", "name": "conv5_3", "inbound_nodes": [[["pool4_3", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool5_1", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool5_1", "inbound_nodes": [[["conv5_1", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool5_2", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool5_2", "inbound_nodes": [[["conv5_2", 0, 0]]]}, {"config": {"pool_length": 2, "name": "pool5_3", "border_mode": "valid", "trainable": true, "stride": 2}, "class_name": "MaxPooling1D", "name": "pool5_3", "inbound_nodes": [[["conv5_3", 0, 0]]]}, {"config": {"trainable": true, "name": "flat_1"}, "class_name": "Flatten", "name": "flat_1", "inbound_nodes": [[["pool5_1", 0, 0]]]}, {"config": {"trainable": true, "name": "flat_2"}, "class_name": "Flatten", "name": "flat_2", "inbound_nodes": [[["pool5_2", 0, 0]]]}, {"config": {"trainable": true, "name": "flat_3"}, "class_name": "Flatten", "name": "flat_3", "inbound_nodes": [[["pool5_3", 0, 0]]]}, {"config": {"output_shape_type": "raw", "mode": "concat", "output_shape": null, "dot_axes": -1, "concat_axis": -1, "mode_type": "raw", "name": "merge"}, "class_name": "Merge", "name": "merge", "inbound_nodes": [[["flat_1", 0, 0], ["flat_2", 0, 0], ["flat_3", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 35, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_metals", "activation": "softmax"}, "class_name": "Dense", "name": "out_metals", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 45, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_C", "activation": "softmax"}, "class_name": "Dense", "name": "out_C", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 25, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_N", "activation": "softmax"}, "class_name": "Dense", "name": "out_N", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 45, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_O", "activation": "softmax"}, "class_name": "Dense", "name": "out_O", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 25, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_alpha", "activation": "softmax"}, "class_name": "Dense", "name": "out_alpha", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 55, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_log10vdop", "activation": "softmax"}, "class_name": "Dense", "name": "out_log10vdop", "inbound_nodes": [[["merge", 0, 0]]]}, {"config": {"b_constraint": null, "bias": true, "init": "glorot_uniform", "b_regularizer": null, "output_dim": 55, "input_dim": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "activity_regularizer": null, "name": "out_Teff", "activation": "softmax"}, "class_name": "Dense", "name": "out_Teff", "inbound_nodes": [[["merge", 0, 0]]]}], "name": "model_1", "output_layers": [["out_metals", 0, 0], ["out_C", 0, 0], ["out_N", 0, 0], ["out_O", 0, 0], ["out_alpha", 0, 0], ["out_log10vdop", 0, 0], ["out_Teff", 0, 0]]}, "class_name": "Model", "keras_version": "1.1.0"}