{"class_name": "Model", "keras_version": "1.0.8", "config": {"input_layers": [["flux_input", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "flux_input", "config": {"input_dtype": "float32", "batch_input_shape": [null, 2400, 1], "name": "flux_input"}, "inbound_nodes": []}, {"class_name": "GaussianNoise", "name": "gaussiannoise_1", "config": {"name": "gaussiannoise_1", "sigma": 0.0001, "trainable": true}, "inbound_nodes": [[["flux_input", 0, 0]]]}, {"class_name": "Convolution1D", "name": "conv_1", "config": {"nb_filter": 50, "input_length": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu", "init": "he_normal", "filter_length": 5, "subsample_length": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": null, "name": "conv_1", "b_regularizer": null}, "inbound_nodes": [[["gaussiannoise_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "pool_1", "config": {"name": "pool_1", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 2}, "inbound_nodes": [[["conv_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "conv_2", "config": {"nb_filter": 50, "input_length": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu", "init": "he_normal", "filter_length": 10, "subsample_length": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": null, "name": "conv_2", "b_regularizer": null}, "inbound_nodes": [[["pool_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "pool_2", "config": {"name": "pool_2", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 2}, "inbound_nodes": [[["conv_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "conv_3", "config": {"nb_filter": 50, "input_length": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu", "init": "he_normal", "filter_length": 15, "subsample_length": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": null, "name": "conv_3", "b_regularizer": null}, "inbound_nodes": [[["pool_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "pool_3", "config": {"name": "pool_3", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 2}, "inbound_nodes": [[["conv_3", 0, 0]]]}, {"class_name": "Convolution1D", "name": "conv_4", "config": {"nb_filter": 50, "input_length": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu", "init": "he_normal", "filter_length": 20, "subsample_length": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": null, "name": "conv_4", "b_regularizer": null}, "inbound_nodes": [[["pool_3", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "pool_4", "config": {"name": "pool_4", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 2}, "inbound_nodes": [[["conv_4", 0, 0]]]}, {"class_name": "Convolution1D", "name": "conv_5", "config": {"nb_filter": 50, "input_length": null, "W_regularizer": null, "border_mode": "same", "W_constraint": null, "activation": "relu", "init": "he_normal", "filter_length": 25, "subsample_length": 1, "b_constraint": null, "bias": true, "activity_regularizer": null, "trainable": true, "input_dim": null, "name": "conv_5", "b_regularizer": null}, "inbound_nodes": [[["pool_4", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "pool_5", "config": {"name": "pool_5", "stride": 2, "trainable": true, "border_mode": "valid", "pool_length": 2}, "inbound_nodes": [[["conv_5", 0, 0]]]}, {"class_name": "Flatten", "name": "flat_flux", "config": {"name": "flat_flux", "trainable": true}, "inbound_nodes": [[["pool_5", 0, 0]]]}, {"class_name": "Dense", "name": "FC1", "config": {"W_regularizer": null, "W_constraint": null, "activation": "relu", "init": "glorot_uniform", "trainable": true, "output_dim": 300, "b_constraint": null, "bias": true, "activity_regularizer": null, "input_dim": null, "name": "FC1", "b_regularizer": null}, "inbound_nodes": [[["flat_flux", 0, 0]]]}, {"class_name": "Dense", "name": "out_metals", "config": {"W_regularizer": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "trainable": true, "output_dim": 30, "b_constraint": null, "bias": true, "activity_regularizer": null, "input_dim": null, "name": "out_metals", "b_regularizer": null}, "inbound_nodes": [[["FC1", 0, 0]]]}, {"class_name": "Dense", "name": "out_O", "config": {"W_regularizer": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "trainable": true, "output_dim": 30, "b_constraint": null, "bias": true, "activity_regularizer": null, "input_dim": null, "name": "out_O", "b_regularizer": null}, "inbound_nodes": [[["FC1", 0, 0]]]}, {"class_name": "Dense", "name": "out_vdop", "config": {"W_regularizer": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "trainable": true, "output_dim": 30, "b_constraint": null, "bias": true, "activity_regularizer": null, "input_dim": null, "name": "out_vdop", "b_regularizer": null}, "inbound_nodes": [[["FC1", 0, 0]]]}, {"class_name": "Dense", "name": "out_teff", "config": {"W_regularizer": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "trainable": true, "output_dim": 100, "b_constraint": null, "bias": true, "activity_regularizer": null, "input_dim": null, "name": "out_teff", "b_regularizer": null}, "inbound_nodes": [[["FC1", 0, 0]]]}, {"class_name": "Dense", "name": "out_logg", "config": {"W_regularizer": null, "W_constraint": null, "activation": "softmax", "init": "glorot_uniform", "trainable": true, "output_dim": 30, "b_constraint": null, "bias": true, "activity_regularizer": null, "input_dim": null, "name": "out_logg", "b_regularizer": null}, "inbound_nodes": [[["FC1", 0, 0]]]}], "output_layers": [["out_metals", 0, 0], ["out_O", 0, 0], ["out_vdop", 0, 0], ["out_teff", 0, 0], ["out_logg", 0, 0]]}}