____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 200, 200, 1)   0                                            
____________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise) (None, 200, 200, 1)   0           input_1[0][0]                    
____________________________________________________________________________________________________
reflection_padding2d_1 (Reflecti (None, 202, 202, 1)   0           gaussian_noise_1[0][0]           
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 200, 200, 32)  320         reflection_padding2d_1[0][0]     
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 200, 200, 32)  0           conv2d_1[0][0]                   
____________________________________________________________________________________________________
reflection_padding2d_2 (Reflecti (None, 202, 202, 32)  0           activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_2[0][0]     
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 200, 200, 32)  128         conv2d_2[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 200, 200, 32)  0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_3 (Reflecti (None, 202, 202, 32)  0           activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_3[0][0]     
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 200, 200, 32)  128         conv2d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 200, 200, 32)  0           batch_normalization_2[0][0]      
                                                                   activation_1[0][0]               
____________________________________________________________________________________________________
reflection_padding2d_4 (Reflecti (None, 202, 202, 32)  0           add_1[0][0]                      
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_4[0][0]     
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 200, 200, 32)  128         conv2d_4[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 200, 200, 32)  0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_5 (Reflecti (None, 202, 202, 32)  0           activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_5[0][0]     
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 200, 200, 32)  128         conv2d_5[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 200, 200, 32)  0           batch_normalization_4[0][0]      
                                                                   add_1[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_6 (Reflecti (None, 202, 202, 32)  0           add_2[0][0]                      
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_6[0][0]     
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 200, 200, 32)  128         conv2d_6[0][0]                   
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 200, 200, 32)  0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_7 (Reflecti (None, 202, 202, 32)  0           activation_4[0][0]               
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_7[0][0]     
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 200, 200, 32)  128         conv2d_7[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 200, 200, 32)  0           batch_normalization_6[0][0]      
                                                                   add_2[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_8 (Reflecti (None, 202, 202, 32)  0           add_3[0][0]                      
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 200, 200, 32)  9248        reflection_padding2d_8[0][0]     
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 200, 200, 32)  128         conv2d_8[0][0]                   
____________________________________________________________________________________________________
add_4 (Add)                      (None, 200, 200, 32)  0           batch_normalization_7[0][0]      
                                                                   activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 200, 200, 3)   99          add_4[0][0]                      
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 200, 200, 3)   0           conv2d_9[0][0]                   
====================================================================================================
Total params: 66,051
Trainable params: 65,603
Non-trainable params: 448
____________________________________________________________________________________________________
