____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 128, 128, 1)   0                                            
____________________________________________________________________________________________________
reflection_padding2d_1 (Reflecti (None, 130, 130, 1)   0           input_1[0][0]                    
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 128, 128, 32)  320         reflection_padding2d_1[0][0]     
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 128, 128, 32)  128         conv2d_1[0][0]                   
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 128, 128, 32)  0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_2 (Reflecti (None, 130, 130, 32)  0           activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 64, 64, 64)    18496       reflection_padding2d_2[0][0]     
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 64, 64, 64)    256         conv2d_2[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 64, 64, 64)    0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_3 (Reflecti (None, 66, 66, 64)    0           activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 32, 32, 128)   73856       reflection_padding2d_3[0][0]     
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 32, 32, 128)   512         conv2d_3[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 32, 32, 128)   0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_4 (Reflecti (None, 34, 34, 128)   0           activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 32, 32, 128)   147584      reflection_padding2d_4[0][0]     
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 32, 32, 128)   512         conv2d_4[0][0]                   
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 32, 32, 128)   0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_5 (Reflecti (None, 34, 34, 128)   0           activation_4[0][0]               
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 32, 32, 128)   147584      reflection_padding2d_5[0][0]     
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 32, 32, 128)   512         conv2d_5[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 32, 32, 128)   0           batch_normalization_5[0][0]      
                                                                   activation_3[0][0]               
____________________________________________________________________________________________________
reflection_padding2d_6 (Reflecti (None, 34, 34, 128)   0           add_1[0][0]                      
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 32, 32, 128)   147584      reflection_padding2d_6[0][0]     
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 32, 32, 128)   512         conv2d_6[0][0]                   
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 32, 32, 128)   0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_7 (Reflecti (None, 34, 34, 128)   0           activation_5[0][0]               
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 32, 32, 128)   147584      reflection_padding2d_7[0][0]     
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 32, 32, 128)   512         conv2d_7[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 32, 32, 128)   0           batch_normalization_7[0][0]      
                                                                   add_1[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_8 (Reflecti (None, 34, 34, 128)   0           add_2[0][0]                      
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 32, 32, 128)   147584      reflection_padding2d_8[0][0]     
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 32, 32, 128)   512         conv2d_8[0][0]                   
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 32, 32, 128)   0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_9 (Reflecti (None, 34, 34, 128)   0           activation_6[0][0]               
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 32, 32, 128)   147584      reflection_padding2d_9[0][0]     
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 32, 32, 128)   512         conv2d_9[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 32, 32, 128)   0           batch_normalization_9[0][0]      
                                                                   add_2[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_10 (Reflect (None, 34, 34, 128)   0           add_3[0][0]                      
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 32, 32, 128)   147584      reflection_padding2d_10[0][0]    
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 32, 32, 128)   512         conv2d_10[0][0]                  
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 32, 32, 128)   0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_11 (Reflect (None, 34, 34, 128)   0           activation_7[0][0]               
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, 32, 32, 128)   147584      reflection_padding2d_11[0][0]    
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 32, 32, 128)   512         conv2d_11[0][0]                  
____________________________________________________________________________________________________
add_4 (Add)                      (None, 32, 32, 128)   0           batch_normalization_11[0][0]     
                                                                   add_3[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_12 (Reflect (None, 34, 34, 128)   0           add_4[0][0]                      
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, 32, 32, 128)   147584      reflection_padding2d_12[0][0]    
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 32, 32, 128)   512         conv2d_12[0][0]                  
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 32, 32, 128)   0           batch_normalization_12[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_13 (Reflect (None, 34, 34, 128)   0           activation_8[0][0]               
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, 32, 32, 128)   147584      reflection_padding2d_13[0][0]    
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 32, 32, 128)   512         conv2d_13[0][0]                  
____________________________________________________________________________________________________
add_5 (Add)                      (None, 32, 32, 128)   0           batch_normalization_13[0][0]     
                                                                   add_4[0][0]                      
____________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)   (None, 64, 64, 128)   0           add_5[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_14 (Reflect (None, 66, 66, 128)   0           up_sampling2d_1[0][0]            
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, 64, 64, 64)    73792       reflection_padding2d_14[0][0]    
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 64, 64, 64)    256         conv2d_14[0][0]                  
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 64, 64, 64)    0           batch_normalization_14[0][0]     
____________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)   (None, 128, 128, 64)  0           activation_9[0][0]               
____________________________________________________________________________________________________
reflection_padding2d_15 (Reflect (None, 130, 130, 64)  0           up_sampling2d_2[0][0]            
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, 128, 128, 32)  18464       reflection_padding2d_15[0][0]    
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 128, 128, 32)  128         conv2d_15[0][0]                  
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 128, 128, 32)  0           batch_normalization_15[0][0]     
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, 128, 128, 3)   99          activation_10[0][0]              
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 128, 128, 3)   0           conv2d_16[0][0]                  
====================================================================================================
Total params: 1,667,267
Trainable params: 1,664,067
Non-trainable params: 3,200
____________________________________________________________________________________________________
