____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 128, 128, 1)   0                                            
____________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise) (None, 128, 128, 1)   0           input_1[0][0]                    
____________________________________________________________________________________________________
reflection_padding2d_1 (Reflecti (None, 130, 130, 1)   0           gaussian_noise_1[0][0]           
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 128, 128, 32)  320         reflection_padding2d_1[0][0]     
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 128, 128, 32)  0           conv2d_1[0][0]                   
____________________________________________________________________________________________________
reflection_padding2d_2 (Reflecti (None, 130, 130, 32)  0           activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_2[0][0]     
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 128, 128, 32)  128         conv2d_2[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 128, 128, 32)  0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_3 (Reflecti (None, 130, 130, 32)  0           activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_3[0][0]     
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 128, 128, 32)  128         conv2d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 128, 128, 32)  0           batch_normalization_2[0][0]      
                                                                   activation_1[0][0]               
____________________________________________________________________________________________________
reflection_padding2d_4 (Reflecti (None, 130, 130, 32)  0           add_1[0][0]                      
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_4[0][0]     
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 128, 128, 32)  128         conv2d_4[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 128, 128, 32)  0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_5 (Reflecti (None, 130, 130, 32)  0           activation_3[0][0]               
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_5[0][0]     
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 128, 128, 32)  128         conv2d_5[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 128, 128, 32)  0           batch_normalization_4[0][0]      
                                                                   add_1[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_6 (Reflecti (None, 130, 130, 32)  0           add_2[0][0]                      
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_6[0][0]     
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 128, 128, 32)  128         conv2d_6[0][0]                   
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 128, 128, 32)  0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_7 (Reflecti (None, 130, 130, 32)  0           activation_4[0][0]               
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_7[0][0]     
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 128, 128, 32)  128         conv2d_7[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 128, 128, 32)  0           batch_normalization_6[0][0]      
                                                                   add_2[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_8 (Reflecti (None, 130, 130, 32)  0           add_3[0][0]                      
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_8[0][0]     
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 128, 128, 32)  128         conv2d_8[0][0]                   
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 128, 128, 32)  0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_9 (Reflecti (None, 130, 130, 32)  0           activation_5[0][0]               
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 128, 128, 32)  9248        reflection_padding2d_9[0][0]     
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 128, 128, 32)  128         conv2d_9[0][0]                   
____________________________________________________________________________________________________
add_4 (Add)                      (None, 128, 128, 32)  0           batch_normalization_8[0][0]      
                                                                   add_3[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_10 (Reflect (None, 130, 130, 32)  0           add_4[0][0]                      
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_10[0][0]    
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 128, 128, 32)  128         conv2d_10[0][0]                  
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 128, 128, 32)  0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_11 (Reflect (None, 130, 130, 32)  0           activation_6[0][0]               
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_11[0][0]    
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 128, 128, 32)  128         conv2d_11[0][0]                  
____________________________________________________________________________________________________
add_5 (Add)                      (None, 128, 128, 32)  0           batch_normalization_10[0][0]     
                                                                   add_4[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_12 (Reflect (None, 130, 130, 32)  0           add_5[0][0]                      
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_12[0][0]    
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 128, 128, 32)  128         conv2d_12[0][0]                  
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 128, 128, 32)  0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_13 (Reflect (None, 130, 130, 32)  0           activation_7[0][0]               
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_13[0][0]    
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 128, 128, 32)  128         conv2d_13[0][0]                  
____________________________________________________________________________________________________
add_6 (Add)                      (None, 128, 128, 32)  0           batch_normalization_12[0][0]     
                                                                   add_5[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_14 (Reflect (None, 130, 130, 32)  0           add_6[0][0]                      
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_14[0][0]    
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 128, 128, 32)  128         conv2d_14[0][0]                  
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 128, 128, 32)  0           batch_normalization_13[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_15 (Reflect (None, 130, 130, 32)  0           activation_8[0][0]               
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_15[0][0]    
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 128, 128, 32)  128         conv2d_15[0][0]                  
____________________________________________________________________________________________________
add_7 (Add)                      (None, 128, 128, 32)  0           batch_normalization_14[0][0]     
                                                                   add_6[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_16 (Reflect (None, 130, 130, 32)  0           add_7[0][0]                      
____________________________________________________________________________________________________
conv2d_16 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_16[0][0]    
____________________________________________________________________________________________________
batch_normalization_15 (BatchNor (None, 128, 128, 32)  128         conv2d_16[0][0]                  
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 128, 128, 32)  0           batch_normalization_15[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_17 (Reflect (None, 130, 130, 32)  0           activation_9[0][0]               
____________________________________________________________________________________________________
conv2d_17 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_17[0][0]    
____________________________________________________________________________________________________
batch_normalization_16 (BatchNor (None, 128, 128, 32)  128         conv2d_17[0][0]                  
____________________________________________________________________________________________________
add_8 (Add)                      (None, 128, 128, 32)  0           batch_normalization_16[0][0]     
                                                                   add_7[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_18 (Reflect (None, 130, 130, 32)  0           add_8[0][0]                      
____________________________________________________________________________________________________
conv2d_18 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_18[0][0]    
____________________________________________________________________________________________________
batch_normalization_17 (BatchNor (None, 128, 128, 32)  128         conv2d_18[0][0]                  
____________________________________________________________________________________________________
activation_10 (Activation)       (None, 128, 128, 32)  0           batch_normalization_17[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_19 (Reflect (None, 130, 130, 32)  0           activation_10[0][0]              
____________________________________________________________________________________________________
conv2d_19 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_19[0][0]    
____________________________________________________________________________________________________
batch_normalization_18 (BatchNor (None, 128, 128, 32)  128         conv2d_19[0][0]                  
____________________________________________________________________________________________________
add_9 (Add)                      (None, 128, 128, 32)  0           batch_normalization_18[0][0]     
                                                                   add_8[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_20 (Reflect (None, 130, 130, 32)  0           add_9[0][0]                      
____________________________________________________________________________________________________
conv2d_20 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_20[0][0]    
____________________________________________________________________________________________________
batch_normalization_19 (BatchNor (None, 128, 128, 32)  128         conv2d_20[0][0]                  
____________________________________________________________________________________________________
activation_11 (Activation)       (None, 128, 128, 32)  0           batch_normalization_19[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_21 (Reflect (None, 130, 130, 32)  0           activation_11[0][0]              
____________________________________________________________________________________________________
conv2d_21 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_21[0][0]    
____________________________________________________________________________________________________
batch_normalization_20 (BatchNor (None, 128, 128, 32)  128         conv2d_21[0][0]                  
____________________________________________________________________________________________________
add_10 (Add)                     (None, 128, 128, 32)  0           batch_normalization_20[0][0]     
                                                                   add_9[0][0]                      
____________________________________________________________________________________________________
reflection_padding2d_22 (Reflect (None, 130, 130, 32)  0           add_10[0][0]                     
____________________________________________________________________________________________________
conv2d_22 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_22[0][0]    
____________________________________________________________________________________________________
batch_normalization_21 (BatchNor (None, 128, 128, 32)  128         conv2d_22[0][0]                  
____________________________________________________________________________________________________
activation_12 (Activation)       (None, 128, 128, 32)  0           batch_normalization_21[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_23 (Reflect (None, 130, 130, 32)  0           activation_12[0][0]              
____________________________________________________________________________________________________
conv2d_23 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_23[0][0]    
____________________________________________________________________________________________________
batch_normalization_22 (BatchNor (None, 128, 128, 32)  128         conv2d_23[0][0]                  
____________________________________________________________________________________________________
add_11 (Add)                     (None, 128, 128, 32)  0           batch_normalization_22[0][0]     
                                                                   add_10[0][0]                     
____________________________________________________________________________________________________
reflection_padding2d_24 (Reflect (None, 130, 130, 32)  0           add_11[0][0]                     
____________________________________________________________________________________________________
conv2d_24 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_24[0][0]    
____________________________________________________________________________________________________
batch_normalization_23 (BatchNor (None, 128, 128, 32)  128         conv2d_24[0][0]                  
____________________________________________________________________________________________________
activation_13 (Activation)       (None, 128, 128, 32)  0           batch_normalization_23[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_25 (Reflect (None, 130, 130, 32)  0           activation_13[0][0]              
____________________________________________________________________________________________________
conv2d_25 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_25[0][0]    
____________________________________________________________________________________________________
batch_normalization_24 (BatchNor (None, 128, 128, 32)  128         conv2d_25[0][0]                  
____________________________________________________________________________________________________
add_12 (Add)                     (None, 128, 128, 32)  0           batch_normalization_24[0][0]     
                                                                   add_11[0][0]                     
____________________________________________________________________________________________________
reflection_padding2d_26 (Reflect (None, 130, 130, 32)  0           add_12[0][0]                     
____________________________________________________________________________________________________
conv2d_26 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_26[0][0]    
____________________________________________________________________________________________________
batch_normalization_25 (BatchNor (None, 128, 128, 32)  128         conv2d_26[0][0]                  
____________________________________________________________________________________________________
activation_14 (Activation)       (None, 128, 128, 32)  0           batch_normalization_25[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_27 (Reflect (None, 130, 130, 32)  0           activation_14[0][0]              
____________________________________________________________________________________________________
conv2d_27 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_27[0][0]    
____________________________________________________________________________________________________
batch_normalization_26 (BatchNor (None, 128, 128, 32)  128         conv2d_27[0][0]                  
____________________________________________________________________________________________________
add_13 (Add)                     (None, 128, 128, 32)  0           batch_normalization_26[0][0]     
                                                                   add_12[0][0]                     
____________________________________________________________________________________________________
reflection_padding2d_28 (Reflect (None, 130, 130, 32)  0           add_13[0][0]                     
____________________________________________________________________________________________________
conv2d_28 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_28[0][0]    
____________________________________________________________________________________________________
batch_normalization_27 (BatchNor (None, 128, 128, 32)  128         conv2d_28[0][0]                  
____________________________________________________________________________________________________
activation_15 (Activation)       (None, 128, 128, 32)  0           batch_normalization_27[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_29 (Reflect (None, 130, 130, 32)  0           activation_15[0][0]              
____________________________________________________________________________________________________
conv2d_29 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_29[0][0]    
____________________________________________________________________________________________________
batch_normalization_28 (BatchNor (None, 128, 128, 32)  128         conv2d_29[0][0]                  
____________________________________________________________________________________________________
add_14 (Add)                     (None, 128, 128, 32)  0           batch_normalization_28[0][0]     
                                                                   add_13[0][0]                     
____________________________________________________________________________________________________
reflection_padding2d_30 (Reflect (None, 130, 130, 32)  0           add_14[0][0]                     
____________________________________________________________________________________________________
conv2d_30 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_30[0][0]    
____________________________________________________________________________________________________
batch_normalization_29 (BatchNor (None, 128, 128, 32)  128         conv2d_30[0][0]                  
____________________________________________________________________________________________________
activation_16 (Activation)       (None, 128, 128, 32)  0           batch_normalization_29[0][0]     
____________________________________________________________________________________________________
reflection_padding2d_31 (Reflect (None, 130, 130, 32)  0           activation_16[0][0]              
____________________________________________________________________________________________________
conv2d_31 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_31[0][0]    
____________________________________________________________________________________________________
batch_normalization_30 (BatchNor (None, 128, 128, 32)  128         conv2d_31[0][0]                  
____________________________________________________________________________________________________
add_15 (Add)                     (None, 128, 128, 32)  0           batch_normalization_30[0][0]     
                                                                   add_14[0][0]                     
____________________________________________________________________________________________________
reflection_padding2d_32 (Reflect (None, 130, 130, 32)  0           add_15[0][0]                     
____________________________________________________________________________________________________
conv2d_32 (Conv2D)               (None, 128, 128, 32)  9248        reflection_padding2d_32[0][0]    
____________________________________________________________________________________________________
batch_normalization_31 (BatchNor (None, 128, 128, 32)  128         conv2d_32[0][0]                  
____________________________________________________________________________________________________
add_16 (Add)                     (None, 128, 128, 32)  0           batch_normalization_31[0][0]     
                                                                   activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_33 (Conv2D)               (None, 128, 128, 3)   99          add_16[0][0]                     
____________________________________________________________________________________________________
activation_17 (Activation)       (None, 128, 128, 3)   0           conv2d_33[0][0]                  
====================================================================================================
Total params: 291,075
Trainable params: 289,091
Non-trainable params: 1,984
____________________________________________________________________________________________________
