____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 100, 100, 1)   0                                            
____________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise) (None, 100, 100, 1)   0           input_1[0][0]                    
____________________________________________________________________________________________________
reflection_padding2d_1 (Reflecti (None, 102, 102, 1)   0           gaussian_noise_1[0][0]           
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 100, 100, 32)  320         reflection_padding2d_1[0][0]     
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 100, 100, 32)  0           conv2d_1[0][0]                   
____________________________________________________________________________________________________
reflection_padding2d_2 (Reflecti (None, 102, 102, 32)  0           activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 100, 100, 32)  9248        reflection_padding2d_2[0][0]     
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 100, 100, 32)  128         conv2d_2[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 100, 100, 32)  0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
reflection_padding2d_3 (Reflecti (None, 102, 102, 32)  0           activation_2[0][0]               
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 100, 100, 32)  9248        reflection_padding2d_3[0][0]     
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 100, 100, 32)  128         conv2d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 100, 100, 32)  0           batch_normalization_2[0][0]      
                                                                   activation_1[0][0]               
____________________________________________________________________________________________________
reflection_padding2d_4 (Reflecti (None, 102, 102, 32)  0           add_1[0][0]                      
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 100, 100, 32)  9248        reflection_padding2d_4[0][0]     
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 100, 100, 32)  128         conv2d_4[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 100, 100, 32)  0           batch_normalization_3[0][0]      
                                                                   activation_1[0][0]               
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 100, 100, 3)   99          add_2[0][0]                      
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 100, 100, 3)   0           conv2d_5[0][0]                   
====================================================================================================
Total params: 28,547
Trainable params: 28,355
Non-trainable params: 192
____________________________________________________________________________________________________
