____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
stokes_input (InputLayer)        (None, 128, 4)        0                                            
____________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise) (None, 128, 4)        0           stokes_input[0][0]               
____________________________________________________________________________________________________
conv_1 (Conv1D)                  (None, 128, 64)       832         gaussian_noise_1[0][0]           
____________________________________________________________________________________________________
conv1d_2 (Conv1D)                (None, 64, 64)        12352       conv_1[0][0]                     
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 64, 64)        256         conv1d_2[0][0]                   
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 64, 64)        0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
conv1d_3 (Conv1D)                (None, 64, 64)        12352       activation_1[0][0]               
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 64, 64)        4160        conv_1[0][0]                     
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 64, 64)        256         conv1d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 64, 64)        0           conv1d_1[0][0]                   
                                                                   batch_normalization_2[0][0]      
____________________________________________________________________________________________________
conv1d_5 (Conv1D)                (None, 32, 128)       24704       add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 32, 128)       512         conv1d_5[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 32, 128)       0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
conv1d_6 (Conv1D)                (None, 32, 128)       49280       activation_2[0][0]               
____________________________________________________________________________________________________
conv1d_4 (Conv1D)                (None, 32, 128)       8320        add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 32, 128)       512         conv1d_6[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 32, 128)       0           conv1d_4[0][0]                   
                                                                   batch_normalization_4[0][0]      
____________________________________________________________________________________________________
conv1d_8 (Conv1D)                (None, 16, 256)       98560       add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 16, 256)       1024        conv1d_8[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 16, 256)       0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
conv1d_9 (Conv1D)                (None, 16, 256)       196864      activation_3[0][0]               
____________________________________________________________________________________________________
conv1d_7 (Conv1D)                (None, 16, 256)       33024       add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 16, 256)       1024        conv1d_9[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 16, 256)       0           conv1d_7[0][0]                   
                                                                   batch_normalization_6[0][0]      
____________________________________________________________________________________________________
flat (Flatten)                   (None, 4096)          0           add_3[0][0]                      
____________________________________________________________________________________________________
mu_input (InputLayer)            (None, 1)             0                                            
____________________________________________________________________________________________________
FC (Concatenate)                 (None, 4097)          0           flat[0][0]                       
                                                                   mu_input[0][0]                   
____________________________________________________________________________________________________
y_true (InputLayer)              (None, 1)             0                                            
____________________________________________________________________________________________________
weights (Dense)                  (None, 150)           614700      FC[0][0]                         
____________________________________________________________________________________________________
sigma (Dense)                    (None, 1)             4098        FC[0][0]                         
____________________________________________________________________________________________________
loss (Lambda)                    (None, 1)             0           y_true[0][0]                     
                                                                   weights[0][0]                    
                                                                   sigma[0][0]                      
====================================================================================================
Total params: 1,062,830
Trainable params: 1,061,038
Non-trainable params: 1,792
____________________________________________________________________________________________________
