____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
stokes_I (InputLayer)            (None, 128, 1)        0                                            
____________________________________________________________________________________________________
stokes_Q (InputLayer)            (None, 128, 1)        0                                            
____________________________________________________________________________________________________
stokes_U (InputLayer)            (None, 128, 1)        0                                            
____________________________________________________________________________________________________
stokes_V (InputLayer)            (None, 128, 1)        0                                            
____________________________________________________________________________________________________
gaussian_noise_1 (GaussianNoise) (None, 128, 1)        0           stokes_I[0][0]                   
____________________________________________________________________________________________________
gaussian_noise_2 (GaussianNoise) (None, 128, 1)        0           stokes_Q[0][0]                   
____________________________________________________________________________________________________
gaussian_noise_3 (GaussianNoise) (None, 128, 1)        0           stokes_U[0][0]                   
____________________________________________________________________________________________________
gaussian_noise_4 (GaussianNoise) (None, 128, 1)        0           stokes_V[0][0]                   
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 128, 4)        0           gaussian_noise_1[0][0]           
                                                                   gaussian_noise_2[0][0]           
                                                                   gaussian_noise_3[0][0]           
                                                                   gaussian_noise_4[0][0]           
____________________________________________________________________________________________________
conv_1 (Conv1D)                  (None, 128, 64)       832         concatenate_1[0][0]              
____________________________________________________________________________________________________
p_re_lu_1 (PReLU)                (None, 128, 64)       8192        conv_1[0][0]                     
____________________________________________________________________________________________________
conv1d_2 (Conv1D)                (None, 64, 64)        12352       p_re_lu_1[0][0]                  
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 64, 64)        256         conv1d_2[0][0]                   
____________________________________________________________________________________________________
p_re_lu_2 (PReLU)                (None, 64, 64)        4096        batch_normalization_1[0][0]      
____________________________________________________________________________________________________
conv1d_3 (Conv1D)                (None, 64, 64)        12352       p_re_lu_2[0][0]                  
____________________________________________________________________________________________________
conv1d_1 (Conv1D)                (None, 64, 64)        4160        p_re_lu_1[0][0]                  
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 64, 64)        256         conv1d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 64, 64)        0           conv1d_1[0][0]                   
                                                                   batch_normalization_2[0][0]      
____________________________________________________________________________________________________
conv1d_5 (Conv1D)                (None, 32, 64)        12352       add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 32, 64)        256         conv1d_5[0][0]                   
____________________________________________________________________________________________________
p_re_lu_3 (PReLU)                (None, 32, 64)        2048        batch_normalization_3[0][0]      
____________________________________________________________________________________________________
conv1d_6 (Conv1D)                (None, 32, 64)        12352       p_re_lu_3[0][0]                  
____________________________________________________________________________________________________
conv1d_4 (Conv1D)                (None, 32, 64)        4160        add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 32, 64)        256         conv1d_6[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 32, 64)        0           conv1d_4[0][0]                   
                                                                   batch_normalization_4[0][0]      
____________________________________________________________________________________________________
conv1d_8 (Conv1D)                (None, 16, 64)        12352       add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 16, 64)        256         conv1d_8[0][0]                   
____________________________________________________________________________________________________
p_re_lu_4 (PReLU)                (None, 16, 64)        1024        batch_normalization_5[0][0]      
____________________________________________________________________________________________________
conv1d_9 (Conv1D)                (None, 16, 64)        12352       p_re_lu_4[0][0]                  
____________________________________________________________________________________________________
conv1d_7 (Conv1D)                (None, 16, 64)        4160        add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 16, 64)        256         conv1d_9[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 16, 64)        0           conv1d_7[0][0]                   
                                                                   batch_normalization_6[0][0]      
____________________________________________________________________________________________________
flat (Flatten)                   (None, 1024)          0           add_3[0][0]                      
____________________________________________________________________________________________________
mu_input (InputLayer)            (None, 1)             0                                            
____________________________________________________________________________________________________
FC (Concatenate)                 (None, 1025)          0           flat[0][0]                       
                                                                   mu_input[0][0]                   
____________________________________________________________________________________________________
y_true (InputLayer)              (None, 1)             0                                            
____________________________________________________________________________________________________
weights (Dense)                  (None, 25)            25650       FC[0][0]                         
____________________________________________________________________________________________________
loss (Lambda)                    (None, 1)             0           y_true[0][0]                     
                                                                   weights[0][0]                    
====================================================================================================
Total params: 129,970
Trainable params: 129,202
Non-trainable params: 768
____________________________________________________________________________________________________
