_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 50, 50, 2)         0         
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 50, 50, 2)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 25, 25, 64)        1216      
_________________________________________________________________
batch_normalization_1 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
activation_2 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_3 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
add_1 (Add)                  [(None, 25, 25, 64), (Non 0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_4 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
activation_3 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
add_2 (Add)                  [(None, 25, 25, 64), (Non 0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_6 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
activation_4 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_7 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
add_3 (Add)                  [(None, 25, 25, 64), (Non 0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_8 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
activation_5 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_9 (Batch (None, 25, 25, 64)        256       
_________________________________________________________________
add_4 (Add)                  [(None, 25, 25, 64), (Non 0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_10 (Batc (None, 25, 25, 64)        256       
_________________________________________________________________
activation_6 (Activation)    (None, 25, 25, 64)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 25, 25, 64)        36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 25, 25, 64)        256       
_________________________________________________________________
add_5 (Add)                  [(None, 25, 25, 64), (Non 0         
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 50, 50, 64)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 50, 50, 64)        36928     
_________________________________________________________________
batch_normalization_12 (Batc (None, 50, 50, 64)        256       
_________________________________________________________________
activation_7 (Activation)    (None, 50, 50, 64)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 50, 50, 64)        36928     
_________________________________________________________________
batch_normalization_13 (Batc (None, 50, 50, 64)        256       
_________________________________________________________________
activation_8 (Activation)    (None, 50, 50, 64)        0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 50, 50, 1)         65        
=================================================================
Total params: 447,745.0
Trainable params: 446,081.0
Non-trainable params: 1,664.0
_________________________________________________________________
